{
  "recipes": [
    {
      "id": 1,
      "slug": "classic-cottage-cheese-pancakes",
      "title": "Classic Cottage Cheese Pancakes",
      "description": "These classic cottage cheese pancakes are the ultimate high-protein breakfast that has taken the internet by storm — and for good reason. By blending creamy cottage cheese directly into the batter, you get incredibly fluffy, tender pancakes with a subtle tang that pairs beautifully with maple syrup and fresh berries. Each serving delivers an impressive 25g of protein, making these cottage cheese pancakes a smart choice for meal prep, post-workout fuel, or a satisfying weekend brunch. The secret is blending the cottage cheese with eggs until completely smooth, creating a silky batter that cooks up golden and light every single time. Unlike traditional pancakes loaded with refined flour and sugar, this cottage cheese pancake recipe keeps the carbs moderate and the protein sky-high. They freeze beautifully too — just pop them in the toaster for a quick weekday breakfast. Whether you're new to cottage cheese recipes or a seasoned pro, these classic cottage cheese pancakes are the perfect starting point. Top them with Greek yogurt, fresh fruit, or a drizzle of honey for an unbeatable high-protein breakfast that the whole family will love.",
      "protein": 25,
      "calories": 280,
      "carbs": 28,
      "fat": 8,
      "fiber": 2,
      "sugar": 5,
      "servingSize": "3 pancakes",
      "yield": "12 pancakes",
      "prepTime": "5",
      "cookTime": "15",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Pancakes",
      "tags": ["Cottage Cheese", "Pancakes", "High-Protein", "Breakfast"],
      "methods": ["stovetop"],
      "image": "classic-cottage-cheese-pancakes.png",
      "ingredients": [
        "225g cottage cheese",
        "3 large eggs",
        "60g oat flour",
        "5g vanilla extract",
        "3g baking powder",
        "2g cinnamon",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Add cottage cheese, eggs, and vanilla extract to a blender. Blend on high for 30 seconds until completely smooth with no lumps remaining."},
        {"step": "Mix Dry", "text": "Add oat flour, baking powder, cinnamon, and salt to the blender. Pulse 3-4 times until just combined. Do not over-blend."},
        {"step": "Heat Pan", "text": "Heat a non-stick pan or griddle over medium heat. Lightly grease with cooking spray or a small amount of butter."},
        {"step": "Cook", "text": "Pour about 60ml of batter per pancake onto the pan. Cook for 2-3 minutes until bubbles form on the surface and edges look set."},
        {"step": "Flip", "text": "Carefully flip each pancake and cook for another 1-2 minutes until golden brown on both sides."},
        {"step": "Serve", "text": "Serve warm topped with fresh berries, a drizzle of maple syrup, or Greek yogurt for extra protein."}
      ],
      "related_recipes": [
        {"slug": "banana-cottage-cheese-pancakes", "title": "Banana Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "flourless-cottage-cheese-pancakes", "title": "Flourless Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "blueberry-cottage-cheese-protein-pancakes", "title": "Blueberry Cottage Cheese Protein Pancakes", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "classic-protein-pancakes", "title": "Classic Protein Pancakes", "domain": "proteinpancakes.co", "category": "protein pancakes"},
        {"slug": "chocolate-chip-protein-cookies", "title": "Chocolate Chip Protein Cookies", "domain": "proteincookies.co", "category": "protein cookies"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 2,
      "slug": "banana-cottage-cheese-pancakes",
      "title": "Banana Cottage Cheese Pancakes",
      "description": "Banana cottage cheese pancakes combine the natural sweetness of ripe bananas with the protein-packed creaminess of cottage cheese for a breakfast that feels indulgent but fuels your body right. These fluffy, golden pancakes deliver 22g of protein per serving without any added sugar — the banana provides all the sweetness you need. This cottage cheese pancake recipe is a favorite among fitness enthusiasts and busy families alike because it comes together in under 20 minutes with just a handful of wholesome ingredients. The ripe banana not only adds natural sweetness but also acts as a binding agent, giving these pancakes an incredibly moist and tender texture. Blending everything together creates a smooth batter that cooks up beautifully on a non-stick pan. These banana cottage cheese pancakes are perfect for meal prep — make a big batch on Sunday and reheat throughout the week. They also freeze wonderfully for up to 3 months. For extra protein, top with a dollop of Greek yogurt and a sprinkle of chopped walnuts. Whether you follow a high-protein diet or simply love delicious cottage cheese recipes, these banana pancakes deserve a permanent spot in your breakfast rotation.",
      "protein": 22,
      "calories": 265,
      "carbs": 32,
      "fat": 7,
      "fiber": 3,
      "sugar": 10,
      "servingSize": "3 pancakes",
      "yield": "12 pancakes",
      "prepTime": "5",
      "cookTime": "15",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Pancakes",
      "tags": ["Cottage Cheese", "Pancakes", "Banana", "High-Protein", "Breakfast", "No Added Sugar"],
      "methods": ["stovetop"],
      "image": "banana-cottage-cheese-pancakes.png",
      "ingredients": [
        "225g cottage cheese",
        "2 large eggs",
        "1 medium ripe banana (about 120g)",
        "50g oat flour",
        "3g baking powder",
        "3g cinnamon",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Add cottage cheese, eggs, and banana to a blender. Blend until completely smooth, about 30 seconds."},
        {"step": "Add Dry", "text": "Add oat flour, baking powder, cinnamon, and salt. Pulse until just combined."},
        {"step": "Cook", "text": "Heat a non-stick pan over medium heat. Pour 60ml portions of batter and cook for 2-3 minutes until bubbles appear."},
        {"step": "Flip & Finish", "text": "Flip carefully and cook another 1-2 minutes until golden brown. Serve with sliced banana and a drizzle of honey."}
      ],
      "related_recipes": [
        {"slug": "classic-cottage-cheese-pancakes", "title": "Classic Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "pumpkin-cottage-cheese-pancakes", "title": "Pumpkin Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "banana-protein-pancakes", "title": "Banana Protein Pancakes", "domain": "proteinpancakes.co", "category": "protein pancakes"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 3,
      "slug": "flourless-cottage-cheese-pancakes",
      "title": "Flourless Cottage Cheese Pancakes",
      "description": "These flourless cottage cheese pancakes prove you don't need any flour to make incredible pancakes. With just cottage cheese, eggs, and a few simple additions, you get light, creamy pancakes that are naturally gluten-free and packed with 28g of protein per serving. This minimalist cottage cheese pancake recipe is perfect for anyone following a low-carb, keto-friendly, or gluten-free diet without sacrificing taste or texture. The magic happens when you blend cottage cheese and eggs together — the proteins in both ingredients create structure, giving you pancakes that hold together beautifully despite having zero flour. They cook up thin and delicate, almost like protein-packed crepes, with crispy golden edges and a soft, custard-like center. Top them with fresh berries and a squeeze of lemon for a refreshing twist, or go savory with smoked salmon and avocado. These flourless cottage cheese pancakes are one of the simplest cottage cheese recipes you can make, requiring just 5 ingredients and about 15 minutes from start to finish. They're a revelation for anyone who thought you needed flour for great pancakes — once you try them, there's no going back.",
      "protein": 28,
      "calories": 220,
      "carbs": 5,
      "fat": 12,
      "fiber": 0,
      "sugar": 3,
      "servingSize": "3 pancakes",
      "yield": "9 pancakes",
      "prepTime": "5",
      "cookTime": "10",
      "totalTime": "15",
      "difficulty": "Easy",
      "category": "Pancakes",
      "tags": ["Cottage Cheese", "Pancakes", "Flourless", "Gluten-Free", "Low-Carb", "Keto"],
      "methods": ["stovetop"],
      "image": "flourless-cottage-cheese-pancakes.png",
      "ingredients": [
        "250g cottage cheese",
        "3 large eggs",
        "5g vanilla extract",
        "2g baking powder",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Combine cottage cheese, eggs, vanilla, baking powder, and salt in a blender. Blend until smooth and airy, about 30 seconds."},
        {"step": "Rest", "text": "Let the batter rest for 2 minutes to allow the baking powder to activate."},
        {"step": "Cook", "text": "Heat a non-stick pan over medium-low heat. Pour small rounds of batter (about 50ml each). Cook for 2-3 minutes until set on top."},
        {"step": "Flip", "text": "Gently flip and cook 1 more minute. These are delicate, so use a wide spatula."},
        {"step": "Serve", "text": "Serve immediately with fresh berries, lemon zest, or sugar-free syrup."}
      ],
      "related_recipes": [
        {"slug": "keto-cottage-cheese-pancakes", "title": "Keto Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "classic-cottage-cheese-pancakes", "title": "Classic Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "flourless-protein-pancakes", "title": "Flourless Protein Pancakes", "domain": "proteinpancakes.co", "category": "protein pancakes"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 4,
      "slug": "keto-cottage-cheese-pancakes",
      "title": "Keto Cottage Cheese Pancakes",
      "description": "These keto cottage cheese pancakes deliver all the fluffy, golden-brown pancake satisfaction you crave while keeping your net carbs incredibly low at just 4g per serving. By combining cottage cheese with almond flour and cream cheese, you get a rich, satisfying batter that cooks up thick and pillowy — nothing like the flat, rubbery keto pancakes you may have tried before. Each serving packs 26g of protein and only 240 calories, making these cottage cheese pancakes an ideal breakfast for anyone following a ketogenic or low-carb lifestyle. The cottage cheese adds moisture and protein while the almond flour provides structure and a subtle nutty flavor. These keto cottage cheese pancakes are incredibly versatile — enjoy them with sugar-free syrup and butter for a classic taste, or top with whipped cream and berries for a dessert-worthy breakfast. They're also perfect for meal prep: cook a batch, store in the fridge for up to 5 days, and reheat in a toaster or microwave. If you're looking for cottage cheese recipes that fit your keto macros perfectly, this recipe is your new go-to breakfast solution.",
      "protein": 26,
      "calories": 240,
      "carbs": 6,
      "fat": 16,
      "fiber": 2,
      "sugar": 3,
      "servingSize": "3 pancakes",
      "yield": "9 pancakes",
      "prepTime": "5",
      "cookTime": "12",
      "totalTime": "17",
      "difficulty": "Easy",
      "category": "Pancakes",
      "tags": ["Cottage Cheese", "Pancakes", "Keto", "Low-Carb", "Gluten-Free", "High-Protein"],
      "methods": ["stovetop"],
      "image": "keto-cottage-cheese-pancakes.png",
      "ingredients": [
        "200g cottage cheese",
        "3 large eggs",
        "30g almond flour",
        "30g cream cheese",
        "3g baking powder",
        "5g vanilla extract",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Add cottage cheese, eggs, cream cheese, and vanilla to a blender. Blend until completely smooth."},
        {"step": "Add Dry", "text": "Add almond flour, baking powder, and salt. Pulse until just combined."},
        {"step": "Cook", "text": "Heat a non-stick pan over medium heat with a small amount of butter. Pour 50ml portions and cook 2-3 minutes per side."},
        {"step": "Serve", "text": "Serve with sugar-free maple syrup, berries, or whipped cream."}
      ],
      "related_recipes": [
        {"slug": "flourless-cottage-cheese-pancakes", "title": "Flourless Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-scrambled-eggs", "title": "Cottage Cheese Scrambled Eggs", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "keto-protein-pancakes", "title": "Keto Protein Pancakes", "domain": "proteinpancakes.co", "category": "protein pancakes"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 5,
      "slug": "cottage-cheese-waffles",
      "title": "Cottage Cheese Waffles",
      "description": "Cottage cheese waffles are crispy on the outside, fluffy on the inside, and loaded with 24g of protein per serving — a breakfast game-changer for waffle lovers who want to eat smarter. This cottage cheese waffle recipe transforms ordinary waffle batter into something extraordinary by blending in creamy cottage cheese that adds moisture, protein, and a subtle tangy depth. The result is golden, perfectly crisp waffles with those beautiful deep pockets that hold syrup and toppings like a dream. These cottage cheese waffles are just as easy to make as regular waffles — simply blend, pour, and cook in your favorite waffle iron. They come out perfectly every time with a satisfying crunch that gives way to a tender, protein-rich interior. Top them with fresh strawberries and whipped cream for a special brunch, or keep it simple with butter and maple syrup. They also make excellent freezer-friendly meal prep — toast them straight from frozen for a quick high-protein breakfast on busy mornings. If you love cottage cheese recipes and want to elevate your waffle game, this recipe delivers the perfect balance of taste, texture, and nutrition.",
      "protein": 24,
      "calories": 295,
      "carbs": 30,
      "fat": 10,
      "fiber": 2,
      "sugar": 5,
      "servingSize": "2 waffles",
      "yield": "8 waffles",
      "prepTime": "5",
      "cookTime": "20",
      "totalTime": "25",
      "difficulty": "Easy",
      "category": "Pancakes",
      "tags": ["Cottage Cheese", "Waffles", "High-Protein", "Breakfast"],
      "methods": ["waffle iron"],
      "image": "cottage-cheese-waffles.png",
      "ingredients": [
        "225g cottage cheese",
        "3 large eggs",
        "80g oat flour",
        "5g vanilla extract",
        "3g baking powder",
        "15g melted butter",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Preheat", "text": "Preheat your waffle iron according to manufacturer instructions. Lightly grease if needed."},
        {"step": "Blend", "text": "Add cottage cheese, eggs, melted butter, and vanilla to a blender. Blend until smooth."},
        {"step": "Add Dry", "text": "Add oat flour, baking powder, and salt. Pulse until just combined."},
        {"step": "Cook", "text": "Pour batter into the preheated waffle iron, filling about 2/3 full. Cook according to your waffle iron instructions, typically 4-5 minutes until golden and crisp."},
        {"step": "Serve", "text": "Serve immediately with fresh fruit, syrup, or whipped cream. For extra crispiness, place cooked waffles on a wire rack in a 95°C oven while you make the rest."}
      ],
      "related_recipes": [
        {"slug": "classic-cottage-cheese-pancakes", "title": "Classic Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-french-toast", "title": "Cottage Cheese French Toast", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "protein-waffles", "title": "Protein Waffles", "domain": "proteinpancakes.co", "category": "protein waffles"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 6,
      "slug": "pumpkin-cottage-cheese-pancakes",
      "title": "Pumpkin Cottage Cheese Pancakes",
      "description": "Pumpkin cottage cheese pancakes bring the warm, cozy flavors of fall to your breakfast table with a high-protein twist. These seasonal favorites combine creamy cottage cheese with real pumpkin puree and a fragrant blend of cinnamon, nutmeg, and ginger for pancakes that taste like pumpkin pie in fluffy pancake form. Each serving delivers 23g of protein and only 275 calories, making them a nutritious indulgence you can enjoy guilt-free. The pumpkin puree adds natural sweetness, moisture, and a beautiful golden-orange color, while the cottage cheese ensures these pancakes are exceptionally tender and protein-dense. This cottage cheese pancake recipe is perfect for autumn mornings but honestly tastes incredible year-round — canned pumpkin is always available and works just as well as fresh. Top these pumpkin cottage cheese pancakes with a drizzle of maple syrup, a dollop of Greek yogurt, and a sprinkle of pecans for the ultimate fall breakfast experience. They're also wonderful for holiday brunches and meal prep, as they reheat beautifully in the toaster. If you love pumpkin spice and cottage cheese recipes, these pancakes are an absolute must-try.",
      "protein": 23,
      "calories": 275,
      "carbs": 32,
      "fat": 7,
      "fiber": 4,
      "sugar": 8,
      "servingSize": "3 pancakes",
      "yield": "12 pancakes",
      "prepTime": "5",
      "cookTime": "15",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Pancakes",
      "tags": ["Cottage Cheese", "Pancakes", "Pumpkin", "Seasonal", "High-Protein", "Breakfast"],
      "methods": ["stovetop"],
      "image": "pumpkin-cottage-cheese-pancakes.png",
      "ingredients": [
        "200g cottage cheese",
        "2 large eggs",
        "120g pumpkin puree",
        "60g oat flour",
        "3g baking powder",
        "3g cinnamon",
        "1g nutmeg",
        "1g ground ginger",
        "5g vanilla extract",
        "15g maple syrup",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Combine cottage cheese, eggs, pumpkin puree, vanilla, and maple syrup in a blender. Blend until smooth."},
        {"step": "Add Dry", "text": "Add oat flour, baking powder, cinnamon, nutmeg, ginger, and salt. Pulse until just combined."},
        {"step": "Cook", "text": "Heat a non-stick pan over medium heat. Pour 60ml portions and cook 3 minutes until bubbles form on top."},
        {"step": "Flip & Serve", "text": "Flip and cook another 2 minutes. Serve with maple syrup, pecans, and a dusting of cinnamon."}
      ],
      "related_recipes": [
        {"slug": "banana-cottage-cheese-pancakes", "title": "Banana Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "oatmeal-cottage-cheese-pancakes", "title": "Oatmeal Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "pumpkin-spice-protein-pancakes", "title": "Pumpkin Spice Protein Pancakes", "domain": "proteinpancakes.co", "category": "protein pancakes"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 7,
      "slug": "oatmeal-cottage-cheese-pancakes",
      "title": "Oatmeal Cottage Cheese Pancakes",
      "description": "Oatmeal cottage cheese pancakes are the heartiest, most satisfying cottage cheese pancake variation you'll find. By combining rolled oats with creamy cottage cheese, you get pancakes with wonderful texture — slightly chewy from the oats with a tender, moist crumb from the cottage cheese. Each serving packs 24g of protein and 5g of fiber, keeping you full and energized all morning long. This cottage cheese pancake recipe is perfect for anyone who loves the wholesome flavor of oatmeal but wants something more exciting than a bowl of porridge. The rolled oats blend right into the batter, adding complex carbohydrates and fiber while the cottage cheese brings the protein. These oatmeal cottage cheese pancakes have a rustic, homestyle quality that pairs beautifully with warm cinnamon, a drizzle of honey, and fresh sliced banana. They're also incredibly budget-friendly and use pantry staples you probably already have on hand. Make a double batch for easy meal prep — they store well in the fridge for 4 days or freezer for 3 months. If you're looking for cottage cheese recipes that are filling, nutritious, and genuinely delicious, these oatmeal pancakes check every box.",
      "protein": 24,
      "calories": 290,
      "carbs": 34,
      "fat": 8,
      "fiber": 5,
      "sugar": 5,
      "servingSize": "3 pancakes",
      "yield": "12 pancakes",
      "prepTime": "5",
      "cookTime": "15",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Pancakes",
      "tags": ["Cottage Cheese", "Pancakes", "Oatmeal", "High-Fiber", "High-Protein", "Breakfast"],
      "methods": ["stovetop"],
      "image": "oatmeal-cottage-cheese-pancakes.png",
      "ingredients": [
        "225g cottage cheese",
        "2 large eggs",
        "80g rolled oats",
        "5g vanilla extract",
        "3g baking powder",
        "2g cinnamon",
        "10g honey",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Add cottage cheese, eggs, rolled oats, vanilla, and honey to a blender. Blend for 45 seconds until oats are broken down and batter is smooth."},
        {"step": "Add Dry", "text": "Add baking powder, cinnamon, and salt. Pulse 2-3 times to combine."},
        {"step": "Rest", "text": "Let batter rest for 3 minutes to allow oats to absorb moisture and thicken."},
        {"step": "Cook", "text": "Heat a non-stick pan over medium heat. Cook 60ml portions for 3 minutes per side until golden brown."},
        {"step": "Serve", "text": "Serve topped with sliced banana, a drizzle of honey, and a sprinkle of cinnamon."}
      ],
      "related_recipes": [
        {"slug": "classic-cottage-cheese-pancakes", "title": "Classic Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-breakfast-bowl", "title": "Cottage Cheese Breakfast Bowl", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "oat-flour-protein-pancakes", "title": "Oat Flour Protein Pancakes", "domain": "proteinpancakes.co", "category": "protein pancakes"},
        {"slug": "protein-overnight-oats", "title": "Protein Overnight Oats", "domain": "proteinoatmeal.co", "category": "protein oatmeal"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 8,
      "slug": "blueberry-cottage-cheese-protein-pancakes",
      "title": "Blueberry Cottage Cheese Protein Pancakes",
      "description": "Blueberry cottage cheese protein pancakes are bursting with juicy berries and loaded with an impressive 27g of protein per serving, thanks to the powerful combination of cottage cheese and vanilla protein powder. These pancakes are the perfect marriage of nutrition and indulgence — each bite delivers sweet, jammy blueberry pockets nestled in fluffy, protein-rich batter. This cottage cheese pancake recipe takes things to the next level by adding a scoop of protein powder, making these the highest-protein pancakes in our collection without sacrificing flavor or texture. The blueberries add natural sweetness, antioxidants, and beautiful purple swirls throughout the golden pancakes. Fresh or frozen blueberries both work perfectly — frozen berries create even more dramatic color and burst with juicy flavor as they cook. These blueberry cottage cheese protein pancakes are a post-workout breakfast dream, providing the protein you need for muscle recovery along with complex carbs from the oat flour and natural sugars from the berries. Top with additional fresh blueberries and a light drizzle of maple syrup. Whether you're a gym-goer looking to hit your protein targets or simply love delicious cottage cheese recipes, these blueberry protein pancakes will become a staple in your kitchen.",
      "protein": 27,
      "calories": 300,
      "carbs": 30,
      "fat": 8,
      "fiber": 3,
      "sugar": 9,
      "servingSize": "3 pancakes",
      "yield": "12 pancakes",
      "prepTime": "5",
      "cookTime": "15",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Pancakes",
      "tags": ["Cottage Cheese", "Pancakes", "Blueberry", "Protein Powder", "High-Protein", "Breakfast"],
      "methods": ["stovetop"],
      "image": "blueberry-cottage-cheese-protein-pancakes.png",
      "ingredients": [
        "200g cottage cheese",
        "2 large eggs",
        "30g vanilla protein powder",
        "50g oat flour",
        "3g baking powder",
        "5g vanilla extract",
        "100g fresh or frozen blueberries",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Add cottage cheese, eggs, protein powder, and vanilla to a blender. Blend until smooth."},
        {"step": "Add Dry", "text": "Add oat flour, baking powder, and salt. Pulse until combined."},
        {"step": "Fold", "text": "Pour batter into a bowl and gently fold in blueberries with a spatula. Do not crush them."},
        {"step": "Cook", "text": "Heat a non-stick pan over medium heat. Cook 60ml portions for 3 minutes per side until golden."},
        {"step": "Serve", "text": "Stack pancakes and top with fresh blueberries, a drizzle of maple syrup, and optional Greek yogurt."}
      ],
      "related_recipes": [
        {"slug": "classic-cottage-cheese-pancakes", "title": "Classic Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-smoothie-bowl", "title": "Cottage Cheese Smoothie Bowl", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "blueberry-protein-pancakes", "title": "Blueberry Protein Pancakes", "domain": "proteinpancakes.co", "category": "protein pancakes"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 9,
      "slug": "cottage-cheese-scrambled-eggs",
      "title": "Cottage Cheese Scrambled Eggs",
      "description": "Cottage cheese scrambled eggs are the creamiest, most luxurious scrambled eggs you will ever taste. Adding cottage cheese to your eggs might sound unusual, but this simple trick creates incredibly soft, fluffy curds with a rich, almost custard-like texture that regular scrambled eggs simply can't match. Each serving delivers a massive 30g of protein from the combination of eggs and cottage cheese, making this one of the most protein-dense breakfast options available. The secret is stirring the cottage cheese into the eggs just before cooking and using low-to-medium heat for gentle, slow scrambling. This creates large, pillowy curds studded with tiny pockets of melted cottage cheese that add a subtle creaminess and tang. These cottage cheese scrambled eggs cook in just 5 minutes, making them perfect for busy weekday mornings when you need a quick, high-protein breakfast. Season simply with salt, pepper, and fresh chives, or get creative with smoked paprika, everything bagel seasoning, or fresh herbs. Serve on toast, in a tortilla, or alongside avocado for a complete meal. This is one of the simplest cottage cheese recipes that delivers maximum flavor and nutrition with minimal effort.",
      "protein": 30,
      "calories": 250,
      "carbs": 4,
      "fat": 16,
      "fiber": 0,
      "sugar": 3,
      "servingSize": "1 plate",
      "yield": "2 servings",
      "prepTime": "2",
      "cookTime": "5",
      "totalTime": "7",
      "difficulty": "Easy",
      "category": "Breakfast",
      "tags": ["Cottage Cheese", "Eggs", "Breakfast", "High-Protein", "Quick", "Keto"],
      "methods": ["stovetop"],
      "image": "cottage-cheese-scrambled-eggs.png",
      "ingredients": [
        "4 large eggs",
        "100g cottage cheese",
        "10g butter",
        "2g salt",
        "1g black pepper",
        "5g fresh chives, chopped"
      ],
      "instructions": [
        {"step": "Whisk", "text": "Crack eggs into a bowl and whisk lightly. Stir in cottage cheese, salt, and pepper."},
        {"step": "Heat", "text": "Melt butter in a non-stick pan over medium-low heat."},
        {"step": "Scramble", "text": "Pour in the egg and cottage cheese mixture. Stir gently with a spatula, creating large, soft curds. Cook slowly for 3-4 minutes, pushing eggs from the edges to the center."},
        {"step": "Finish", "text": "Remove from heat while eggs still look slightly wet — they'll continue cooking from residual heat. Top with fresh chives and serve immediately."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-egg-muffins", "title": "Cottage Cheese Egg Muffins", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-breakfast-bowl", "title": "Cottage Cheese Breakfast Bowl", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "high-protein-breakfast-muffins", "title": "High-Protein Breakfast Muffins", "domain": "proteinmuffins.com", "category": "protein muffins"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 10,
      "slug": "cottage-cheese-egg-muffins",
      "title": "Cottage Cheese Egg Muffins",
      "description": "Cottage cheese egg muffins are the ultimate grab-and-go high-protein breakfast, perfect for meal prep and busy mornings. These savory muffins combine beaten eggs with creamy cottage cheese, colorful vegetables, and flavorful seasonings, all baked in a muffin tin until golden and puffy. Each muffin delivers 12g of protein with only 95 calories, making them an incredibly efficient way to start your day. The cottage cheese makes these egg muffins extra moist and creamy compared to regular egg muffins, and they hold up beautifully for meal prep — store them in the fridge for up to 5 days and reheat in the microwave for 30 seconds. This cottage cheese recipe is endlessly customizable: swap in your favorite vegetables, add crumbled turkey sausage or bacon, or throw in fresh herbs like basil or dill. The base recipe uses bell peppers, spinach, and cherry tomatoes for a colorful, veggie-loaded option that's as beautiful as it is delicious. Make a batch of 12 on Sunday and you've got breakfast covered for the whole week. These cottage cheese egg muffins are also fantastic for kids' lunchboxes, picnics, or any time you need a quick protein boost on the go.",
      "protein": 12,
      "calories": 95,
      "carbs": 3,
      "fat": 5,
      "fiber": 1,
      "sugar": 2,
      "servingSize": "2 muffins",
      "yield": "12 muffins",
      "prepTime": "10",
      "cookTime": "20",
      "totalTime": "30",
      "difficulty": "Easy",
      "category": "Breakfast",
      "tags": ["Cottage Cheese", "Eggs", "Breakfast", "Meal Prep", "High-Protein", "Quick"],
      "methods": ["oven"],
      "image": "cottage-cheese-egg-muffins.png",
      "ingredients": [
        "8 large eggs",
        "150g cottage cheese",
        "60g bell pepper, diced",
        "40g fresh spinach, chopped",
        "40g cherry tomatoes, quartered",
        "30g shredded cheddar cheese",
        "2g salt",
        "1g black pepper",
        "1g garlic powder"
      ],
      "instructions": [
        {"step": "Preheat", "text": "Preheat oven to 190°C (375°F). Grease a 12-cup muffin tin or line with silicone liners."},
        {"step": "Mix", "text": "Whisk eggs in a large bowl. Stir in cottage cheese, salt, pepper, and garlic powder until combined."},
        {"step": "Add Veggies", "text": "Distribute diced bell pepper, spinach, and cherry tomatoes evenly among the muffin cups."},
        {"step": "Pour & Top", "text": "Pour the egg-cottage cheese mixture into each cup, filling about 3/4 full. Top with shredded cheddar."},
        {"step": "Bake", "text": "Bake for 18-20 minutes until eggs are set and tops are lightly golden. Let cool in pan for 5 minutes before removing."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-scrambled-eggs", "title": "Cottage Cheese Scrambled Eggs", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-breakfast-bowl", "title": "Cottage Cheese Breakfast Bowl", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "savory-protein-muffins", "title": "Savory Protein Muffins", "domain": "proteinmuffins.com", "category": "protein muffins"}
      ],
      "intent_class": "meal-prep"
    },
    {
      "id": 11,
      "slug": "cottage-cheese-breakfast-bowl",
      "title": "Cottage Cheese Breakfast Bowl",
      "description": "The cottage cheese breakfast bowl is the simplest yet most satisfying way to enjoy cottage cheese for breakfast. This no-cook recipe takes creamy cottage cheese and transforms it into a protein-packed canvas topped with fresh fruit, crunchy granola, and a drizzle of honey — a complete meal ready in under 5 minutes. Each bowl delivers 28g of protein with a perfect balance of complex carbs, healthy fats, and natural sweetness. This cottage cheese breakfast bowl has become a viral sensation for good reason: it proves that cottage cheese recipes don't have to be complicated to be incredible. The key is using high-quality, full-fat or 4% cottage cheese for the best flavor and texture, though any variety works. The beauty of this recipe is its versatility — customize your toppings based on the season. Summer calls for fresh berries and peaches, fall brings sliced apples and pecans, and winter is perfect for pomegranate seeds and dark chocolate shavings. You can also go savory with avocado, everything bagel seasoning, and cherry tomatoes. This cottage cheese breakfast bowl is proof that eating healthy doesn't have to mean sacrificing convenience or flavor — it's the perfect busy-morning breakfast solution.",
      "protein": 28,
      "calories": 350,
      "carbs": 38,
      "fat": 10,
      "fiber": 4,
      "sugar": 18,
      "servingSize": "1 bowl",
      "yield": "1 serving",
      "prepTime": "5",
      "cookTime": "0",
      "totalTime": "5",
      "difficulty": "Easy",
      "category": "Breakfast",
      "tags": ["Cottage Cheese", "Breakfast", "No-Cook", "High-Protein", "Quick", "Bowl"],
      "methods": ["no-cook"],
      "image": "cottage-cheese-breakfast-bowl.png",
      "ingredients": [
        "225g cottage cheese",
        "80g fresh mixed berries",
        "30g granola",
        "15g honey",
        "10g chia seeds",
        "15g almond butter"
      ],
      "instructions": [
        {"step": "Base", "text": "Add cottage cheese to a bowl. For an extra smooth texture, blend briefly or whip with a fork for 30 seconds."},
        {"step": "Top", "text": "Arrange fresh berries on top. Add granola for crunch and sprinkle with chia seeds."},
        {"step": "Drizzle", "text": "Add a spoonful of almond butter and drizzle with honey."},
        {"step": "Serve", "text": "Enjoy immediately while the granola is still crunchy. Customize with your favorite seasonal fruits and toppings."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-smoothie-bowl", "title": "Cottage Cheese Smoothie Bowl", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-scrambled-eggs", "title": "Cottage Cheese Scrambled Eggs", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "protein-overnight-oats", "title": "Protein Overnight Oats", "domain": "proteinoatmeal.co", "category": "protein oatmeal"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 12,
      "slug": "cottage-cheese-french-toast",
      "title": "Cottage Cheese French Toast",
      "description": "Cottage cheese French toast elevates a beloved breakfast classic into a protein powerhouse, delivering 26g of protein per serving with a custardy, golden-brown exterior and a soft, rich interior. By blending cottage cheese into the classic egg dip, you create an incredibly thick, creamy coating that clings to each slice of bread and cooks up beautifully golden. This cottage cheese recipe turns ordinary French toast into something extraordinary — the cottage cheese adds protein and a subtle richness that makes each bite taste almost like a dessert. Use thick-cut bread like brioche or challah for the best results, as the sturdy slices absorb the protein-rich custard without falling apart. The batter includes vanilla, cinnamon, and a touch of maple syrup for warm, comforting flavor. These cottage cheese French toast slices are perfect for lazy weekend brunches or special occasion breakfasts. They also work beautifully for meal prep — cook them, cool completely, and freeze in a single layer. Pop them in the toaster for a quick weekday breakfast that tastes freshly made. Top with fresh berries, powdered sugar, and real maple syrup for the ultimate indulgence that happens to be loaded with protein.",
      "protein": 26,
      "calories": 320,
      "carbs": 35,
      "fat": 10,
      "fiber": 2,
      "sugar": 10,
      "servingSize": "2 slices",
      "yield": "6 slices",
      "prepTime": "10",
      "cookTime": "10",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Breakfast",
      "tags": ["Cottage Cheese", "French Toast", "Breakfast", "High-Protein", "Weekend Brunch"],
      "methods": ["stovetop"],
      "image": "cottage-cheese-french-toast.png",
      "ingredients": [
        "150g cottage cheese",
        "3 large eggs",
        "5g vanilla extract",
        "3g cinnamon",
        "15g maple syrup",
        "6 slices thick-cut bread (about 240g)",
        "15g butter for cooking"
      ],
      "instructions": [
        {"step": "Blend", "text": "Add cottage cheese, eggs, vanilla, cinnamon, and maple syrup to a blender. Blend until completely smooth."},
        {"step": "Dip", "text": "Pour custard mixture into a shallow dish. Dip each bread slice, letting it soak for 15-20 seconds per side."},
        {"step": "Cook", "text": "Melt butter in a large non-stick pan over medium heat. Cook soaked bread slices for 2-3 minutes per side until deeply golden brown."},
        {"step": "Serve", "text": "Serve hot with fresh berries, a dusting of powdered sugar, and maple syrup."}
      ],
      "related_recipes": [
        {"slug": "classic-cottage-cheese-pancakes", "title": "Classic Cottage Cheese Pancakes", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-waffles", "title": "Cottage Cheese Waffles", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "protein-french-toast", "title": "Protein French Toast", "domain": "proteinpancakes.co", "category": "protein pancakes"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 13,
      "slug": "cottage-cheese-smoothie-bowl",
      "title": "Cottage Cheese Smoothie Bowl",
      "description": "This cottage cheese smoothie bowl is thick, creamy, and absolutely loaded with 30g of protein — making it one of the most nutritious smoothie bowls you can make. Unlike traditional smoothie bowls that rely on banana and yogurt for creaminess, this recipe uses blended cottage cheese as the protein-rich base, creating an incredibly thick and scoopable texture that holds toppings beautifully. When blended with frozen berries and a splash of milk, cottage cheese transforms into a smooth, ice cream-like consistency that tastes nothing like cottage cheese itself. This cottage cheese smoothie bowl recipe is a revelation for anyone who doesn't love the texture of cottage cheese on its own — once blended, it becomes silky smooth with a neutral, creamy flavor that lets the fruit shine. Top with granola, fresh fruit, coconut flakes, and a drizzle of nut butter for a bowl that's as beautiful as it is nourishing. It's ready in under 5 minutes with zero cooking required, making it the perfect summer breakfast or post-workout refuel. For extra thickness, freeze your cottage cheese in an ice cube tray beforehand. This is one of the most popular cottage cheese recipes for good reason.",
      "protein": 30,
      "calories": 340,
      "carbs": 40,
      "fat": 8,
      "fiber": 5,
      "sugar": 22,
      "servingSize": "1 bowl",
      "yield": "1 serving",
      "prepTime": "5",
      "cookTime": "0",
      "totalTime": "5",
      "difficulty": "Easy",
      "category": "Breakfast",
      "tags": ["Cottage Cheese", "Smoothie Bowl", "Breakfast", "No-Cook", "High-Protein", "Quick"],
      "methods": ["blender"],
      "image": "cottage-cheese-smoothie-bowl.png",
      "ingredients": [
        "200g cottage cheese",
        "150g frozen mixed berries",
        "1 frozen banana (about 100g)",
        "30ml milk",
        "15g honey",
        "30g granola for topping",
        "30g fresh fruit for topping",
        "10g coconut flakes for topping"
      ],
      "instructions": [
        {"step": "Blend", "text": "Add cottage cheese, frozen berries, frozen banana, milk, and honey to a high-speed blender. Blend until thick and smooth, scraping sides as needed."},
        {"step": "Adjust", "text": "The consistency should be thick like soft-serve ice cream. Add a splash more milk if too thick, or more frozen fruit if too thin."},
        {"step": "Pour", "text": "Pour into a bowl. The mixture should hold its shape and not be runny."},
        {"step": "Top", "text": "Arrange granola, fresh fruit, and coconut flakes on top in an aesthetically pleasing pattern. Serve immediately."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-breakfast-bowl", "title": "Cottage Cheese Breakfast Bowl", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-banana-pudding", "title": "Cottage Cheese Banana Pudding", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "protein-smoothie-oats", "title": "Protein Smoothie Oats", "domain": "proteinoatmeal.co", "category": "protein oatmeal"}
      ],
      "intent_class": "breakfast"
    },
    {
      "id": 14,
      "slug": "cottage-cheese-flatbread",
      "title": "Cottage Cheese Flatbread",
      "description": "Cottage cheese flatbread is the viral two-ingredient sensation that has completely changed the way people think about cottage cheese recipes. With just cottage cheese and flour, you can make soft, pliable, protein-packed flatbreads in under 15 minutes — no yeast, no rising time, no kneading required. Each flatbread delivers 14g of protein, making them a brilliant high-protein alternative to traditional naan or tortillas. The cottage cheese provides moisture, protein, and a subtle flavor that works beautifully with both sweet and savory toppings. Roll them thin for crispy wraps or keep them thicker for pillowy naan-style bread. These cottage cheese flatbreads are incredibly versatile: use them as pizza bases, sandwich wraps, taco shells, or simply tear and dip into hummus. The dough comes together in minutes and cooks in a hot pan in about 2 minutes per side, developing beautiful golden-brown spots and a slightly chewy texture. This cottage cheese flatbread recipe has gone viral on social media for good reason — it's simple, quick, and produces legitimately delicious results. Once you master this basic recipe, you'll never look at cottage cheese the same way again.",
      "protein": 14,
      "calories": 185,
      "carbs": 24,
      "fat": 4,
      "fiber": 1,
      "sugar": 2,
      "servingSize": "1 flatbread",
      "yield": "4 flatbreads",
      "prepTime": "5",
      "cookTime": "10",
      "totalTime": "15",
      "difficulty": "Easy",
      "category": "Bread",
      "tags": ["Cottage Cheese", "Flatbread", "High-Protein", "Quick", "Viral", "2-Ingredient"],
      "methods": ["stovetop"],
      "image": "cottage-cheese-flatbread.png",
      "ingredients": [
        "225g cottage cheese",
        "150g all-purpose flour",
        "3g salt",
        "5g olive oil"
      ],
      "instructions": [
        {"step": "Mix", "text": "Combine cottage cheese, flour, and salt in a bowl. Mix with a fork until a shaggy dough forms. If too sticky, add a bit more flour."},
        {"step": "Knead", "text": "Turn onto a lightly floured surface and knead briefly for 1 minute until smooth. Divide into 4 equal portions."},
        {"step": "Roll", "text": "Roll each portion into a thin circle, about 3mm thick. Dust with flour to prevent sticking."},
        {"step": "Cook", "text": "Heat a dry non-stick pan or cast iron skillet over medium-high heat. Cook each flatbread for 1-2 minutes per side until golden spots appear and bread puffs slightly."},
        {"step": "Finish", "text": "Brush with a tiny amount of olive oil while warm. Stack and wrap in a clean towel to keep soft."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-bread", "title": "Cottage Cheese Bread", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-garlic-knots", "title": "Cottage Cheese Garlic Knots", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "protein-pizza-dough", "title": "Protein Pizza Dough", "domain": "proteinpizzas.co", "category": "protein pizza"},
        {"slug": "high-protein-bread", "title": "High-Protein Bread", "domain": "protein-bread.com", "category": "protein bread"}
      ],
      "intent_class": "lunch"
    },
    {
      "id": 15,
      "slug": "cottage-cheese-bread",
      "title": "Cottage Cheese Bread",
      "description": "Cottage cheese bread is a soft, pillowy loaf that's incredibly moist and packed with protein — a healthier homemade bread that tastes just as good as the bakery version. By incorporating cottage cheese directly into the bread dough, you add significant protein (18g per slice) while keeping the bread tender and preventing it from drying out. This cottage cheese bread recipe requires no bread machine or special equipment — just a bowl, a loaf pan, and your oven. The cottage cheese adds a mild tanginess reminiscent of sourdough, creating a complex flavor profile that's absolutely addictive. This loaf is perfect for sandwiches, toast, or simply enjoyed warm with a spread of butter. It stays fresh and soft for days thanks to the moisture from the cottage cheese, unlike many homemade breads that go stale quickly. The recipe uses a simple yeast dough enriched with cottage cheese, eggs, and a touch of honey for a well-rounded flavor. Let it rise once, shape it into a loaf, and bake until golden. The aroma that fills your kitchen is incredible. If you've been searching for cottage cheese recipes beyond breakfast, this bread is a must-try that will become a weekly staple in your kitchen.",
      "protein": 18,
      "calories": 240,
      "carbs": 32,
      "fat": 6,
      "fiber": 2,
      "sugar": 4,
      "servingSize": "1 slice",
      "yield": "10 slices",
      "prepTime": "20",
      "cookTime": "35",
      "totalTime": "120",
      "difficulty": "Medium",
      "category": "Bread",
      "tags": ["Cottage Cheese", "Bread", "High-Protein", "Baking", "Homemade"],
      "methods": ["oven"],
      "image": "cottage-cheese-bread.png",
      "ingredients": [
        "250g cottage cheese",
        "300g bread flour",
        "2 large eggs",
        "7g instant yeast",
        "20g honey",
        "5g salt",
        "30g butter, softened"
      ],
      "instructions": [
        {"step": "Warm", "text": "Warm cottage cheese slightly in the microwave for 15 seconds. It should be at room temperature, not hot."},
        {"step": "Mix", "text": "In a large bowl, combine flour, yeast, and salt. Add cottage cheese, eggs, honey, and softened butter. Mix until a dough forms."},
        {"step": "Knead", "text": "Knead on a floured surface for 8-10 minutes until smooth and elastic. The dough will be slightly sticky — resist adding too much flour."},
        {"step": "Rise", "text": "Place in an oiled bowl, cover with a damp towel, and let rise in a warm place for 60-75 minutes until doubled."},
        {"step": "Shape", "text": "Punch down dough, shape into a loaf, and place in a greased 23x13cm loaf pan. Cover and let rise 30 minutes."},
        {"step": "Bake", "text": "Preheat oven to 175°C (350°F). Bake for 30-35 minutes until golden brown and internal temperature reaches 90°C. Cool completely before slicing."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-flatbread", "title": "Cottage Cheese Flatbread", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-cinnamon-roll-bread", "title": "Cottage Cheese Cinnamon Roll Bread", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "high-protein-sandwich-bread", "title": "High-Protein Sandwich Bread", "domain": "protein-bread.com", "category": "protein bread"}
      ],
      "intent_class": "baking"
    },
    {
      "id": 16,
      "slug": "cottage-cheese-cinnamon-roll-bread",
      "title": "Cottage Cheese Cinnamon Roll Bread",
      "description": "Cottage cheese cinnamon roll bread combines the irresistible flavors of a cinnamon roll with the protein-packed benefits of cottage cheese in a stunning swirl bread that will make your kitchen smell like a bakery. This show-stopping loaf features a soft, cottage cheese-enriched dough filled with layers of cinnamon sugar and topped with a creamy cottage cheese glaze. Each slice delivers 16g of protein — unheard of for a cinnamon roll treat. The cottage cheese in the dough creates an incredibly tender, moist crumb that stays soft for days, while the cinnamon sugar filling caramelizes during baking for gooey, sweet perfection. This cottage cheese recipe is perfect for weekend baking projects, holiday mornings, or any time you want something special without completely blowing your macros. The cottage cheese glaze on top is a game-changer — blend cottage cheese with a touch of powdered sugar and vanilla for a high-protein frosting that rivals cream cheese icing. Pull-apart slices reveal beautiful cinnamon swirls that look bakery-worthy. Share this bread at brunch and watch your guests' eyes widen when you tell them the secret ingredient is cottage cheese. It's one of the most impressive cottage cheese recipes you can make.",
      "protein": 16,
      "calories": 285,
      "carbs": 40,
      "fat": 8,
      "fiber": 2,
      "sugar": 14,
      "servingSize": "1 slice",
      "yield": "10 slices",
      "prepTime": "30",
      "cookTime": "35",
      "totalTime": "135",
      "difficulty": "Medium",
      "category": "Bread",
      "tags": ["Cottage Cheese", "Bread", "Cinnamon Roll", "Sweet", "Baking", "High-Protein"],
      "methods": ["oven"],
      "image": "cottage-cheese-cinnamon-roll-bread.png",
      "ingredients": [
        "200g cottage cheese",
        "280g all-purpose flour",
        "2 large eggs",
        "7g instant yeast",
        "30g sugar",
        "5g salt",
        "30g butter, softened",
        "60g brown sugar for filling",
        "8g cinnamon for filling",
        "20g butter, melted for filling",
        "50g cottage cheese for glaze",
        "30g powdered sugar for glaze",
        "3g vanilla extract for glaze"
      ],
      "instructions": [
        {"step": "Make Dough", "text": "Mix flour, yeast, sugar, and salt. Add cottage cheese, eggs, and softened butter. Knead 8 minutes until smooth."},
        {"step": "Rise", "text": "Cover and let rise 60-75 minutes until doubled in size."},
        {"step": "Fill", "text": "Roll dough into a large rectangle (about 40x30cm). Brush with melted butter, then sprinkle evenly with brown sugar and cinnamon."},
        {"step": "Shape", "text": "Roll up tightly from the long side. Place seam-side down in a greased loaf pan. Cover and let rise 30 minutes."},
        {"step": "Bake", "text": "Preheat oven to 175°C (350°F). Bake 30-35 minutes until golden. Tent with foil if browning too quickly."},
        {"step": "Glaze", "text": "Blend cottage cheese, powdered sugar, and vanilla until smooth. Drizzle over warm bread. Let cool 15 minutes before slicing."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-bread", "title": "Cottage Cheese Bread", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-muffins", "title": "Cottage Cheese Muffins", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "cinnamon-swirl-protein-bread", "title": "Cinnamon Swirl Protein Bread", "domain": "protein-bread.com", "category": "protein bread"}
      ],
      "intent_class": "baking"
    },
    {
      "id": 17,
      "slug": "cottage-cheese-garlic-knots",
      "title": "Cottage Cheese Garlic Knots",
      "description": "Cottage cheese garlic knots are soft, pillowy, buttery knots of bread infused with garlic and parsley, each one delivering 10g of protein thanks to the cottage cheese-enriched dough. These irresistible rolls are the perfect side dish for pasta night, soup, or any meal that deserves a basket of warm, garlicky bread. The cottage cheese creates a dough that's incredibly easy to work with and bakes up beautifully — soft and chewy on the inside with a golden, garlic-butter-brushed exterior. Unlike traditional garlic knots from your local pizza shop, these are packed with protein and made with wholesome ingredients. The process is simple: make a quick dough, roll into ropes, tie into knots, bake, and toss in garlic butter. The result is restaurant-quality garlic knots that are ready in about 45 minutes including rising time. These cottage cheese garlic knots are always a hit at gatherings, game day parties, or family dinners. Make a double batch because they disappear fast. They're also great for meal prep — bake, cool, and freeze. Reheat in the oven for 5 minutes and they taste freshly baked. This is one of those cottage cheese recipes that proves cottage cheese can do so much more than breakfast.",
      "protein": 10,
      "calories": 155,
      "carbs": 20,
      "fat": 5,
      "fiber": 1,
      "sugar": 2,
      "servingSize": "2 knots",
      "yield": "12 knots",
      "prepTime": "15",
      "cookTime": "15",
      "totalTime": "60",
      "difficulty": "Medium",
      "category": "Bread",
      "tags": ["Cottage Cheese", "Bread", "Garlic Knots", "Savory", "High-Protein", "Side Dish"],
      "methods": ["oven"],
      "image": "cottage-cheese-garlic-knots.png",
      "ingredients": [
        "150g cottage cheese",
        "200g all-purpose flour",
        "5g instant yeast",
        "5g sugar",
        "3g salt",
        "1 large egg",
        "30g butter, melted for topping",
        "10g garlic, minced for topping",
        "10g fresh parsley, chopped for topping",
        "15g parmesan cheese, grated for topping"
      ],
      "instructions": [
        {"step": "Make Dough", "text": "Mix flour, yeast, sugar, and salt. Add cottage cheese and egg. Mix and knead for 5 minutes until smooth. Cover and rest 30 minutes."},
        {"step": "Shape", "text": "Divide dough into 12 pieces. Roll each into a 15cm rope and tie into a simple knot. Place on a lined baking sheet."},
        {"step": "Bake", "text": "Preheat oven to 200°C (400°F). Bake knots for 12-15 minutes until golden brown."},
        {"step": "Garlic Butter", "text": "While knots bake, mix melted butter with minced garlic, parsley, and parmesan."},
        {"step": "Toss", "text": "Remove knots from oven and immediately toss in the garlic butter mixture. Serve warm."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-flatbread", "title": "Cottage Cheese Flatbread", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-pizza-crust", "title": "Cottage Cheese Pizza Crust", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "protein-garlic-bread", "title": "Protein Garlic Bread", "domain": "protein-bread.com", "category": "protein bread"}
      ],
      "intent_class": "dinner"
    },
    {
      "id": 18,
      "slug": "cottage-cheese-protein-brownies",
      "title": "Cottage Cheese Protein Brownies",
      "description": "Cottage cheese protein brownies are fudgy, rich, and impossibly decadent — and yet they deliver 20g of protein per brownie with only 180 calories. The secret ingredient is, of course, cottage cheese, which when blended into the batter creates an incredibly moist brownie with a dense, fudgy texture that rivals any bakery brownie. You genuinely cannot taste the cottage cheese once it's blended with cocoa powder, chocolate, and a touch of maple syrup. This cottage cheese brownie recipe has converted even the most skeptical cottage cheese critics because the results are just that good. The brownies stay moist and fudgy for days thanks to the moisture from the cottage cheese, and they actually taste better the next day as the flavors meld together. They're perfect for satisfying chocolate cravings without derailing your nutrition goals. Each brownie is packed with protein from both the cottage cheese and optional protein powder, making them an ideal post-workout treat or healthy dessert option. Cut into squares and store in an airtight container for easy snacking throughout the week. These cottage cheese protein brownies prove that healthy desserts don't have to taste healthy — they're genuinely, seriously delicious.",
      "protein": 20,
      "calories": 180,
      "carbs": 18,
      "fat": 7,
      "fiber": 3,
      "sugar": 10,
      "servingSize": "1 brownie",
      "yield": "9 brownies",
      "prepTime": "10",
      "cookTime": "22",
      "totalTime": "32",
      "difficulty": "Easy",
      "category": "Desserts",
      "tags": ["Cottage Cheese", "Brownies", "Chocolate", "High-Protein", "Dessert", "Fudgy"],
      "methods": ["oven"],
      "image": "cottage-cheese-protein-brownies.png",
      "ingredients": [
        "225g cottage cheese",
        "2 large eggs",
        "40g cocoa powder",
        "30g chocolate protein powder",
        "60g maple syrup",
        "50g oat flour",
        "3g baking powder",
        "45g dark chocolate chips",
        "5g vanilla extract",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Preheat", "text": "Preheat oven to 175°C (350°F). Line a 20x20cm baking pan with parchment paper."},
        {"step": "Blend", "text": "Add cottage cheese, eggs, cocoa powder, protein powder, maple syrup, and vanilla to a blender. Blend until completely smooth."},
        {"step": "Mix", "text": "Add oat flour, baking powder, and salt. Pulse to combine. Fold in half the chocolate chips."},
        {"step": "Bake", "text": "Pour batter into prepared pan. Top with remaining chocolate chips. Bake 20-22 minutes until a toothpick comes out with moist crumbs (not wet batter)."},
        {"step": "Cool", "text": "Let cool completely in the pan before cutting into 9 squares. They firm up significantly as they cool."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-blondies", "title": "Cottage Cheese Blondies", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-chocolate-chip-cookies", "title": "Cottage Cheese Chocolate Chip Cookies", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "fudgy-protein-brownies", "title": "Fudgy Protein Brownies", "domain": "proteinbrownies.co", "category": "protein brownies"}
      ],
      "intent_class": "dessert"
    },
    {
      "id": 19,
      "slug": "cottage-cheese-chocolate-chip-cookies",
      "title": "Cottage Cheese Chocolate Chip Cookies",
      "description": "Cottage cheese chocolate chip cookies are soft, chewy, and loaded with melty chocolate chips while packing a protein punch that regular cookies can only dream of. Each cookie delivers 10g of protein and only 145 calories, thanks to the cottage cheese that replaces most of the butter you'd find in traditional recipes. The result is a cookie that's surprisingly light yet satisfying, with a tender crumb and golden edges. This cottage cheese cookie recipe produces cookies that spread perfectly, develop beautiful crackly tops, and have that irresistible chewy center. The cottage cheese keeps them incredibly moist — these cookies stay soft for days without becoming dry or crumbly. Nobody will guess the secret ingredient unless you tell them, because when blended smooth and mixed with chocolate and vanilla, the cottage cheese simply adds creaminess and protein without any detectable taste. These cottage cheese chocolate chip cookies are perfect for lunchboxes, after-school snacks, or late-night cravings when you want something sweet but don't want to completely abandon your nutrition goals. Bake a batch, cool completely, and store in an airtight container for up to a week. These are the cottage cheese recipes that convert skeptics into believers.",
      "protein": 10,
      "calories": 145,
      "carbs": 16,
      "fat": 6,
      "fiber": 1,
      "sugar": 8,
      "servingSize": "2 cookies",
      "yield": "16 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Desserts",
      "tags": ["Cottage Cheese", "Cookies", "Chocolate Chip", "High-Protein", "Dessert"],
      "methods": ["oven"],
      "image": "cottage-cheese-chocolate-chip-cookies.png",
      "ingredients": [
        "150g cottage cheese",
        "1 large egg",
        "100g oat flour",
        "50g all-purpose flour",
        "60g brown sugar",
        "30g butter, softened",
        "5g vanilla extract",
        "3g baking soda",
        "60g dark chocolate chips",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Blend cottage cheese until completely smooth. This step is key — no lumps should remain."},
        {"step": "Cream", "text": "In a bowl, cream softened butter and brown sugar. Beat in the blended cottage cheese, egg, and vanilla."},
        {"step": "Mix Dry", "text": "Add oat flour, all-purpose flour, baking soda, and salt. Mix until just combined. Fold in chocolate chips."},
        {"step": "Chill", "text": "Refrigerate dough for 30 minutes for best results (cookies spread less and have better texture)."},
        {"step": "Bake", "text": "Preheat oven to 175°C (350°F). Scoop tablespoon-sized portions onto a lined baking sheet. Bake 10-12 minutes until edges are golden."},
        {"step": "Cool", "text": "Let cool on baking sheet 5 minutes before transferring to a wire rack."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-protein-brownies", "title": "Cottage Cheese Protein Brownies", "domain": "cottagecheeserecipes.co"},
        {"slug": "no-bake-cottage-cheese-cookies", "title": "No-Bake Cottage Cheese Cookies", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "chocolate-chip-protein-cookies", "title": "Chocolate Chip Protein Cookies", "domain": "proteincookies.co", "category": "protein cookies"}
      ],
      "intent_class": "dessert"
    },
    {
      "id": 20,
      "slug": "cottage-cheese-blondies",
      "title": "Cottage Cheese Blondies",
      "description": "Cottage cheese blondies are dense, chewy, and bursting with butterscotch-like sweetness — a lighter take on the classic blondie that sneaks in 16g of protein per square without sacrificing an ounce of flavor. The cottage cheese blends seamlessly into the batter, adding moisture and protein while keeping these bars incredibly soft and chewy. Unlike many protein-enhanced desserts that taste chalky or dry, these cottage cheese blondies are genuinely indulgent with a rich caramel-vanilla flavor profile. Brown sugar is the star sweetener here, creating those signature butterscotch notes that make blondies so irresistible. Add white chocolate chips and chopped pecans for a textural contrast that elevates these from good to extraordinary. Each bite offers a perfect balance of sweet, salty, and nutty flavors. These cottage cheese blondies are perfect for bake sales, potlucks, or any time you need a crowd-pleasing dessert that happens to be packed with protein. They cut into neat squares, travel well, and taste even better the next day. Store in an airtight container at room temperature for up to 5 days. This is one of those cottage cheese recipes that proves you can have your blondie and eat it too — with protein.",
      "protein": 16,
      "calories": 195,
      "carbs": 24,
      "fat": 7,
      "fiber": 1,
      "sugar": 14,
      "servingSize": "1 blondie",
      "yield": "9 blondies",
      "prepTime": "10",
      "cookTime": "25",
      "totalTime": "35",
      "difficulty": "Easy",
      "category": "Desserts",
      "tags": ["Cottage Cheese", "Blondies", "High-Protein", "Dessert", "Baking"],
      "methods": ["oven"],
      "image": "cottage-cheese-blondies.png",
      "ingredients": [
        "200g cottage cheese",
        "2 large eggs",
        "80g brown sugar",
        "60g oat flour",
        "30g vanilla protein powder",
        "30g butter, melted",
        "5g vanilla extract",
        "3g baking powder",
        "40g white chocolate chips",
        "30g pecans, chopped",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Preheat", "text": "Preheat oven to 175°C (350°F). Line a 20x20cm baking pan with parchment paper."},
        {"step": "Blend", "text": "Blend cottage cheese, eggs, brown sugar, melted butter, and vanilla until smooth."},
        {"step": "Mix", "text": "Add oat flour, protein powder, baking powder, and salt. Mix until combined. Fold in white chocolate chips and pecans."},
        {"step": "Bake", "text": "Pour into prepared pan. Bake 22-25 minutes until top is golden and a toothpick comes out with a few moist crumbs."},
        {"step": "Cool", "text": "Cool completely in pan before cutting into 9 squares. They firm up as they cool."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-protein-brownies", "title": "Cottage Cheese Protein Brownies", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-chocolate-chip-cookies", "title": "Cottage Cheese Chocolate Chip Cookies", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "peanut-butter-protein-blondies", "title": "Peanut Butter Protein Blondies", "domain": "proteinbrownies.co", "category": "protein blondies"}
      ],
      "intent_class": "dessert"
    },
    {
      "id": 21,
      "slug": "no-bake-cottage-cheese-cookies",
      "title": "No-Bake Cottage Cheese Cookies",
      "description": "No-bake cottage cheese cookies are the quickest, easiest cookie recipe in this collection — ready in just 15 minutes with zero baking required. These protein-packed treats combine cottage cheese with oats, peanut butter, cocoa powder, and honey for a chewy, fudgy cookie that satisfies sweet cravings while delivering 12g of protein per serving. The cottage cheese binds everything together while adding creaminess and protein, creating a texture somewhere between a cookie and a protein ball. This no-bake cottage cheese recipe is perfect for hot summer days when you don't want to turn on the oven, or for quick meal prep when you need protein-rich snacks ready fast. Simply blend the cottage cheese smooth, mix everything together, shape into cookies, and refrigerate until firm. These no-bake cookies are endlessly customizable — swap peanut butter for almond butter, add coconut flakes, dried fruit, or mini chocolate chips. They store perfectly in the fridge for up to a week and in the freezer for up to 3 months. Kids love them too, making them an excellent lunchbox treat. If you're looking for cottage cheese recipes that require minimal effort and maximum satisfaction, these no-bake cookies are your answer.",
      "protein": 12,
      "calories": 165,
      "carbs": 18,
      "fat": 7,
      "fiber": 2,
      "sugar": 8,
      "servingSize": "2 cookies",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "0",
      "totalTime": "40",
      "difficulty": "Easy",
      "category": "Desserts",
      "tags": ["Cottage Cheese", "Cookies", "No-Bake", "High-Protein", "Quick", "Dessert"],
      "methods": ["no-cook"],
      "image": "no-bake-cottage-cheese-cookies.png",
      "ingredients": [
        "150g cottage cheese",
        "80g rolled oats",
        "40g peanut butter",
        "30g cocoa powder",
        "40g honey",
        "5g vanilla extract",
        "30g mini chocolate chips",
        "pinch of salt"
      ],
      "instructions": [
        {"step": "Blend", "text": "Blend cottage cheese until completely smooth in a blender or food processor."},
        {"step": "Mix", "text": "In a bowl, combine blended cottage cheese with oats, peanut butter, cocoa powder, honey, vanilla, and salt. Mix well."},
        {"step": "Fold", "text": "Fold in mini chocolate chips."},
        {"step": "Shape", "text": "Drop tablespoon-sized portions onto a parchment-lined baking sheet. Press gently to form cookie shapes."},
        {"step": "Chill", "text": "Refrigerate for at least 30 minutes until firm. Store in an airtight container in the fridge for up to 7 days."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-chocolate-chip-cookies", "title": "Cottage Cheese Chocolate Chip Cookies", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-protein-balls", "title": "Cottage Cheese Protein Balls", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "no-bake-protein-cookies", "title": "No-Bake Protein Cookies", "domain": "proteincookies.co", "category": "protein cookies"}
      ],
      "intent_class": "snack"
    },
    {
      "id": 22,
      "slug": "cottage-cheese-protein-cheesecake",
      "title": "Cottage Cheese Protein Cheesecake",
      "description": "Cottage cheese protein cheesecake delivers all the creamy, dreamy, indulgent satisfaction of a New York-style cheesecake with a fraction of the calories and a massive protein boost. Each slice packs 24g of protein and only 220 calories, compared to 400+ calories in a traditional cheesecake slice. The magic is in blending cottage cheese until silky smooth and combining it with Greek yogurt and a touch of cream cheese for a filling that bakes up rich, creamy, and perfectly dense. This cottage cheese cheesecake recipe uses a simple oat-based crust that adds fiber and keeps things wholesome. The filling is lightly sweetened with honey and vanilla, letting the tangy creaminess of the cottage cheese and yogurt shine through. Bake low and slow for a crack-free top, then let it cool gradually in the oven for the smoothest texture. This protein cheesecake is a game-changer for dessert lovers on a high-protein diet — it genuinely tastes like a real cheesecake. Top with fresh berries, a fruit compote, or simply enjoy plain. Make it ahead for dinner parties and watch your guests refuse to believe this decadent cheesecake is high in protein. These are the cottage cheese recipes that redefine what healthy desserts can be.",
      "protein": 24,
      "calories": 220,
      "carbs": 20,
      "fat": 8,
      "fiber": 2,
      "sugar": 12,
      "servingSize": "1 slice",
      "yield": "8 slices",
      "prepTime": "15",
      "cookTime": "45",
      "totalTime": "180",
      "difficulty": "Medium",
      "category": "Cheesecake",
      "tags": ["Cottage Cheese", "Cheesecake", "High-Protein", "Dessert", "Baking"],
      "methods": ["oven"],
      "image": "cottage-cheese-protein-cheesecake.png",
      "ingredients": [
        "400g cottage cheese",
        "150g Greek yogurt",
        "60g cream cheese, softened",
        "3 large eggs",
        "60g honey",
        "30g cornstarch",
        "10g vanilla extract",
        "80g oat flour for crust",
        "30g butter, melted for crust",
        "15g honey for crust"
      ],
      "instructions": [
        {"step": "Crust", "text": "Preheat oven to 160°C (325°F). Mix oat flour, melted butter, and honey. Press into the bottom of a 23cm springform pan. Bake 10 minutes."},
        {"step": "Blend Filling", "text": "Add cottage cheese to a blender. Blend for 60 seconds until perfectly smooth — this step is critical for a silky texture."},
        {"step": "Mix", "text": "Add Greek yogurt, cream cheese, eggs, honey, cornstarch, and vanilla. Blend until smooth, scraping sides."},
        {"step": "Bake", "text": "Pour filling over crust. Bake at 160°C for 40-45 minutes until edges are set but center still jiggles slightly."},
        {"step": "Cool", "text": "Turn oven off and crack door open. Let cheesecake cool in the oven for 1 hour, then refrigerate for at least 2 hours (overnight is best)."},
        {"step": "Serve", "text": "Remove from springform pan. Top with fresh berries or fruit compote. Slice and serve chilled."}
      ],
      "related_recipes": [
        {"slug": "no-bake-cottage-cheese-cheesecake", "title": "No-Bake Cottage Cheese Cheesecake", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-protein-pudding", "title": "Cottage Cheese Protein Pudding", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "classic-protein-cheesecake", "title": "Classic Protein Cheesecake", "domain": "proteincheesecake.co", "category": "protein cheesecake"}
      ],
      "intent_class": "dessert"
    },
    {
      "id": 23,
      "slug": "no-bake-cottage-cheese-cheesecake",
      "title": "No-Bake Cottage Cheese Cheesecake",
      "description": "No-bake cottage cheese cheesecake is the easiest cheesecake you will ever make — no oven, no water bath, no fuss. Just blend, pour, chill, and enjoy a light, mousse-like cheesecake that's packed with 22g of protein per slice. This no-bake cottage cheese recipe uses gelatin to set the filling into a perfectly sliceable cheesecake that holds its shape beautifully when cut. The filling is incredibly simple: blended cottage cheese, Greek yogurt, honey, vanilla, and a bit of whipped cream folded in for cloud-like lightness. The result is a refreshing, not-too-sweet cheesecake that's perfect for warm weather desserts and effortless entertaining. The graham cracker-style crust comes together with crushed digestive biscuits and melted butter — pressed into the pan and chilled while you prep the filling. The whole process takes about 20 minutes of active time, then the fridge does the rest. This no-bake cheesecake is lighter and more delicate than a traditional baked version, with a lovely tangy undertone from the cottage cheese. Perfect for summer gatherings, this cottage cheese cheesecake can be made a day ahead and tastes even better after chilling overnight. Top with a drizzle of lemon curd, fresh strawberries, or a mixed berry sauce.",
      "protein": 22,
      "calories": 235,
      "carbs": 22,
      "fat": 9,
      "fiber": 1,
      "sugar": 14,
      "servingSize": "1 slice",
      "yield": "8 slices",
      "prepTime": "20",
      "cookTime": "0",
      "totalTime": "260",
      "difficulty": "Easy",
      "category": "Cheesecake",
      "tags": ["Cottage Cheese", "Cheesecake", "No-Bake", "High-Protein", "Dessert"],
      "methods": ["no-cook"],
      "image": "no-bake-cottage-cheese-cheesecake.png",
      "ingredients": [
        "400g cottage cheese",
        "150g Greek yogurt",
        "60g honey",
        "10g vanilla extract",
        "10g gelatin powder",
        "60ml warm water",
        "80ml heavy cream",
        "100g digestive biscuits, crushed for crust",
        "40g butter, melted for crust"
      ],
      "instructions": [
        {"step": "Crust", "text": "Mix crushed biscuits with melted butter. Press firmly into the bottom of a 20cm springform pan. Refrigerate."},
        {"step": "Bloom Gelatin", "text": "Sprinkle gelatin over warm water. Let sit 5 minutes until bloomed, then microwave 10 seconds until dissolved."},
        {"step": "Blend", "text": "Blend cottage cheese until perfectly smooth. Add Greek yogurt, honey, vanilla, and dissolved gelatin. Blend until combined."},
        {"step": "Whip & Fold", "text": "In a separate bowl, whip heavy cream to soft peaks. Gently fold into the cottage cheese mixture."},
        {"step": "Set", "text": "Pour filling over crust. Smooth the top. Refrigerate for at least 4 hours, preferably overnight, until fully set."},
        {"step": "Serve", "text": "Remove from springform pan. Top with fresh berries or fruit sauce. Slice with a warm knife for clean cuts."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-protein-cheesecake", "title": "Cottage Cheese Protein Cheesecake", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-protein-pudding", "title": "Cottage Cheese Protein Pudding", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "no-bake-protein-cheesecake", "title": "No-Bake Protein Cheesecake", "domain": "proteincheesecake.co", "category": "protein cheesecake"}
      ],
      "intent_class": "dessert"
    },
    {
      "id": 24,
      "slug": "cottage-cheese-protein-pudding",
      "title": "Cottage Cheese Protein Pudding",
      "description": "Cottage cheese protein pudding is the TikTok-viral snack that's taken the fitness world by storm, and it lives up to every bit of the hype. By blending cottage cheese with protein powder and a touch of sweetener until impossibly smooth, you create a thick, creamy pudding that tastes like chocolate mousse but packs 35g of protein per serving. Yes, you read that right — 35 grams. This might be the single most protein-dense cottage cheese recipe in existence, and it takes just 2 minutes to make. The key is blending the cottage cheese long enough to break down every single curd, transforming it from lumpy to silky. Add chocolate protein powder for a rich, decadent chocolate pudding, or try vanilla for a more subtle flavor. The texture is thick and spoonable, similar to a Greek yogurt but richer and more satisfying. This cottage cheese protein pudding is perfect as a post-workout snack, a high-protein dessert, or even a late-night treat that won't wreck your macros. Customize with toppings like crushed graham crackers, fresh berries, peanut butter swirls, or coconut flakes. It keeps in the fridge for 3 days but honestly, it rarely lasts that long. Simple, delicious, and incredibly effective for hitting your protein goals.",
      "protein": 35,
      "calories": 210,
      "carbs": 12,
      "fat": 5,
      "fiber": 1,
      "sugar": 6,
      "servingSize": "1 bowl",
      "yield": "1 serving",
      "prepTime": "3",
      "cookTime": "0",
      "totalTime": "3",
      "difficulty": "Easy",
      "category": "Cheesecake",
      "tags": ["Cottage Cheese", "Pudding", "Protein Powder", "High-Protein", "Quick", "Viral", "No-Cook"],
      "methods": ["blender"],
      "image": "cottage-cheese-protein-pudding.png",
      "ingredients": [
        "225g cottage cheese",
        "30g chocolate protein powder",
        "15g cocoa powder",
        "15g honey or sweetener",
        "30ml milk",
        "3g vanilla extract"
      ],
      "instructions": [
        {"step": "Blend", "text": "Add cottage cheese, protein powder, cocoa powder, honey, milk, and vanilla to a blender or food processor."},
        {"step": "Process", "text": "Blend on high for 45-60 seconds until perfectly smooth and thick. Scrape sides and blend again if needed."},
        {"step": "Adjust", "text": "Taste and adjust sweetness. Add a splash more milk if you prefer a thinner consistency."},
        {"step": "Serve", "text": "Transfer to a bowl and enjoy immediately, or refrigerate for 30 minutes for a firmer, mousse-like texture. Top with your favorite toppings."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-banana-pudding", "title": "Cottage Cheese Banana Pudding", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-protein-cheesecake", "title": "Cottage Cheese Protein Cheesecake", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "chocolate-protein-pudding", "title": "Chocolate Protein Pudding", "domain": "proteinpudding.co", "category": "protein pudding"}
      ],
      "intent_class": "snack"
    },
    {
      "id": 25,
      "slug": "cottage-cheese-banana-pudding",
      "title": "Cottage Cheese Banana Pudding",
      "description": "Cottage cheese banana pudding puts a high-protein spin on the beloved Southern classic, layering creamy blended cottage cheese with fresh banana slices and vanilla wafers for a dessert that's nostalgic, comforting, and packed with 26g of protein per serving. The cottage cheese is blended until silky smooth and mixed with vanilla pudding mix for that authentic banana pudding flavor and texture. Unlike traditional banana pudding that's loaded with heavy cream and condensed milk, this cottage cheese version delivers rich creaminess with significantly less fat and sugar while dramatically boosting the protein content. The layering is key to this recipe — alternate between the creamy cottage cheese mixture, sliced ripe bananas, and crunchy vanilla wafers for a dessert with incredible textural contrast. As it chills in the fridge, the wafers soften slightly and the flavors meld together beautifully. This cottage cheese banana pudding is perfect for summer cookouts, potlucks, or any time you're craving something sweet and satisfying. Make it in a large dish for sharing or portion into individual jars for beautiful grab-and-go desserts. It tastes even better after chilling overnight, making it an ideal make-ahead cottage cheese recipe for entertaining.",
      "protein": 26,
      "calories": 280,
      "carbs": 38,
      "fat": 6,
      "fiber": 2,
      "sugar": 22,
      "servingSize": "1 portion",
      "yield": "4 servings",
      "prepTime": "15",
      "cookTime": "0",
      "totalTime": "135",
      "difficulty": "Easy",
      "category": "Cheesecake",
      "tags": ["Cottage Cheese", "Banana Pudding", "High-Protein", "Dessert", "No-Bake", "Southern"],
      "methods": ["no-cook"],
      "image": "cottage-cheese-banana-pudding.png",
      "ingredients": [
        "400g cottage cheese",
        "1 package (28g) instant vanilla pudding mix",
        "120ml milk",
        "5g vanilla extract",
        "3 ripe bananas (about 360g), sliced",
        "60g vanilla wafers",
        "60g whipped cream for topping"
      ],
      "instructions": [
        {"step": "Blend", "text": "Blend cottage cheese until perfectly smooth, about 60 seconds."},
        {"step": "Mix", "text": "Add pudding mix, milk, and vanilla. Blend until thick and creamy."},
        {"step": "Layer", "text": "In a serving dish, create layers: cottage cheese mixture, sliced bananas, vanilla wafers. Repeat 2-3 times."},
        {"step": "Top", "text": "Finish with a final layer of the cottage cheese mixture. Top with whipped cream and a few wafer crumbs."},
        {"step": "Chill", "text": "Refrigerate for at least 2 hours (overnight is best) before serving. The flavors develop beautifully as it chills."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-protein-pudding", "title": "Cottage Cheese Protein Pudding", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-smoothie-bowl", "title": "Cottage Cheese Smoothie Bowl", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "banana-protein-pudding", "title": "Banana Protein Pudding", "domain": "proteinpudding.co", "category": "protein pudding"}
      ],
      "intent_class": "dessert"
    },
    {
      "id": 26,
      "slug": "cottage-cheese-pizza-crust",
      "title": "Cottage Cheese Pizza Crust",
      "description": "Cottage cheese pizza crust is the high-protein pizza base that has revolutionized homemade pizza for health-conscious food lovers. This simple dough comes together in minutes using cottage cheese, flour, and a few basic ingredients, producing a crust that's crispy on the outside, soft and chewy on the inside, and loaded with 18g of protein per serving — before you even add your toppings. The cottage cheese adds moisture and protein to the dough, creating a crust that's more tender and flavorful than standard pizza dough while being significantly more nutritious. This cottage cheese pizza crust recipe works beautifully with any toppings you love, from classic margherita to loaded meat lovers. The dough is easy to roll out and holds up well under the weight of toppings without getting soggy. For the crispiest results, par-bake the crust for 8 minutes before adding toppings, then finish baking until everything is golden and bubbly. This cottage cheese recipe is perfect for pizza night — make it a family activity and let everyone customize their own personal pizzas. The crust freezes well too, so you can prep several and have high-protein pizza bases ready whenever cravings strike. Welcome to a new era of guilt-free pizza nights.",
      "protein": 18,
      "calories": 230,
      "carbs": 28,
      "fat": 6,
      "fiber": 2,
      "sugar": 3,
      "servingSize": "2 slices",
      "yield": "8 slices (1 large pizza)",
      "prepTime": "15",
      "cookTime": "20",
      "totalTime": "35",
      "difficulty": "Easy",
      "category": "Pizza",
      "tags": ["Cottage Cheese", "Pizza", "High-Protein", "Savory", "Dinner"],
      "methods": ["oven"],
      "image": "cottage-cheese-pizza-crust.png",
      "ingredients": [
        "225g cottage cheese",
        "200g all-purpose flour",
        "1 large egg",
        "5g salt",
        "3g baking powder",
        "5g garlic powder",
        "5g Italian seasoning",
        "10g olive oil"
      ],
      "instructions": [
        {"step": "Mix", "text": "Combine cottage cheese, egg, and olive oil in a bowl. Add flour, salt, baking powder, garlic powder, and Italian seasoning. Mix until a dough forms."},
        {"step": "Knead", "text": "Turn out onto a floured surface and knead briefly for 2 minutes until smooth. The dough should be soft but not overly sticky."},
        {"step": "Shape", "text": "Roll dough into a circle about 30cm in diameter on a parchment-lined baking sheet. Aim for about 5mm thickness."},
        {"step": "Par-Bake", "text": "Preheat oven to 220°C (425°F). Par-bake the crust for 8 minutes until it starts to firm up but isn't fully cooked."},
        {"step": "Top & Bake", "text": "Remove from oven. Add your favorite sauce, cheese, and toppings. Bake for another 10-12 minutes until cheese is melted and crust is golden."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-pizza-bowl", "title": "Cottage Cheese Pizza Bowl", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-protein-pizza", "title": "Cottage Cheese Protein Pizza", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "high-protein-pizza-crust", "title": "High-Protein Pizza Crust", "domain": "proteinpizzas.co", "category": "protein pizza"}
      ],
      "intent_class": "dinner"
    },
    {
      "id": 27,
      "slug": "cottage-cheese-pizza-bowl",
      "title": "Cottage Cheese Pizza Bowl",
      "description": "The cottage cheese pizza bowl is the laziest, most satisfying way to get pizza flavor with ridiculous amounts of protein — no dough-making required. This genius recipe layers seasoned cottage cheese with pizza sauce, mozzarella, pepperoni, and all your favorite pizza toppings in an oven-safe bowl, then bakes until bubbly, golden, and irresistible. Each serving delivers 32g of protein with the familiar, comforting flavors of your favorite pizza in a fraction of the time. This cottage cheese pizza bowl has become a viral sensation because it's so simple yet so effective — you literally dump ingredients in a bowl and bake. The cottage cheese melts and mingles with the mozzarella and pizza sauce, creating a rich, gooey filling that tastes remarkably like the inside of a deep-dish pizza. Scoop it up with low-carb crackers, toasted bread, or eat it straight with a spoon. It's ready in about 20 minutes, making it perfect for weeknight dinners when you want something fast and filling. Customize with your favorite pizza toppings — mushrooms, olives, bell peppers, sausage, or jalapeños all work beautifully. This cottage cheese recipe is proof that eating high-protein doesn't have to be boring or complicated. It's become a weeknight staple in thousands of kitchens for good reason.",
      "protein": 32,
      "calories": 310,
      "carbs": 10,
      "fat": 16,
      "fiber": 2,
      "sugar": 5,
      "servingSize": "1 bowl",
      "yield": "2 servings",
      "prepTime": "5",
      "cookTime": "15",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Pizza",
      "tags": ["Cottage Cheese", "Pizza", "Bowl", "High-Protein", "Quick", "Savory", "Keto"],
      "methods": ["oven"],
      "image": "cottage-cheese-pizza-bowl.png",
      "ingredients": [
        "250g cottage cheese",
        "60g pizza sauce",
        "80g shredded mozzarella",
        "30g pepperoni slices",
        "3g Italian seasoning",
        "2g garlic powder",
        "1g red pepper flakes",
        "5g fresh basil for topping"
      ],
      "instructions": [
        {"step": "Layer", "text": "Preheat oven to 200°C (400°F). Spread cottage cheese in the bottom of two oven-safe bowls or a small baking dish."},
        {"step": "Sauce", "text": "Spoon pizza sauce over the cottage cheese. Sprinkle with Italian seasoning, garlic powder, and red pepper flakes."},
        {"step": "Top", "text": "Add pepperoni slices and top with shredded mozzarella."},
        {"step": "Bake", "text": "Bake for 12-15 minutes until cheese is melted, bubbly, and starting to brown on top."},
        {"step": "Serve", "text": "Let cool for 2 minutes. Top with fresh basil and serve with crackers or toasted bread for dipping."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-pizza-crust", "title": "Cottage Cheese Pizza Crust", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-protein-pizza", "title": "Cottage Cheese Protein Pizza", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "pizza-protein-bowl", "title": "Pizza Protein Bowl", "domain": "proteinpizzas.co", "category": "protein pizza"}
      ],
      "intent_class": "dinner"
    },
    {
      "id": 28,
      "slug": "cottage-cheese-protein-pizza",
      "title": "Cottage Cheese Protein Pizza",
      "description": "Cottage cheese protein pizza takes the beloved cottage cheese pizza crust and tops it with protein-packed ingredients for a complete meal that delivers a staggering 40g of protein per serving. This isn't just pizza with cottage cheese in the crust — it goes all-in with a cottage cheese and ricotta white sauce base, grilled chicken, and a blend of mozzarella and parmesan on top. The crust is made with cottage cheese, egg, and flour enhanced with protein powder, creating the most protein-dense pizza you've ever tasted. Each slice is a macro-friendly powerhouse that satisfies pizza cravings while supporting your fitness goals. This cottage cheese protein pizza recipe is perfect for gym-goers, athletes, and anyone who refuses to give up pizza in pursuit of their protein targets. The white cottage cheese sauce adds creaminess and tang that pairs perfectly with the savory toppings. Load it up with your favorite vegetables — roasted red peppers, caramelized onions, fresh arugula, or sun-dried tomatoes all work beautifully. This is one of the most impressive cottage cheese recipes for dinner, proving that high-protein eating can be exciting, delicious, and completely satisfying.",
      "protein": 40,
      "calories": 380,
      "carbs": 28,
      "fat": 14,
      "fiber": 2,
      "sugar": 4,
      "servingSize": "2 slices",
      "yield": "8 slices (1 large pizza)",
      "prepTime": "15",
      "cookTime": "25",
      "totalTime": "40",
      "difficulty": "Medium",
      "category": "Pizza",
      "tags": ["Cottage Cheese", "Pizza", "High-Protein", "Dinner", "Meal Prep", "Chicken"],
      "methods": ["oven"],
      "image": "cottage-cheese-protein-pizza.png",
      "ingredients": [
        "200g cottage cheese for crust",
        "150g all-purpose flour for crust",
        "30g protein powder for crust",
        "1 large egg for crust",
        "3g salt for crust",
        "100g cottage cheese for sauce",
        "50g ricotta cheese for sauce",
        "2g garlic powder for sauce",
        "150g cooked chicken breast, shredded",
        "100g shredded mozzarella",
        "20g parmesan cheese, grated",
        "30g baby spinach",
        "fresh basil for topping"
      ],
      "instructions": [
        {"step": "Make Crust", "text": "Mix 200g cottage cheese with flour, protein powder, egg, and salt. Knead briefly and roll into a 30cm circle on parchment paper."},
        {"step": "Par-Bake", "text": "Preheat oven to 220°C (425°F). Par-bake crust for 10 minutes until firm."},
        {"step": "Make Sauce", "text": "Blend 100g cottage cheese with ricotta and garlic powder until smooth."},
        {"step": "Assemble", "text": "Spread cottage cheese sauce over par-baked crust. Top with shredded chicken, baby spinach, mozzarella, and parmesan."},
        {"step": "Bake", "text": "Bake for 12-15 minutes until cheese is melted and crust is golden. Top with fresh basil before serving."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-pizza-crust", "title": "Cottage Cheese Pizza Crust", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-pizza-bowl", "title": "Cottage Cheese Pizza Bowl", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "chicken-protein-pizza", "title": "Chicken Protein Pizza", "domain": "proteinpizzas.co", "category": "protein pizza"}
      ],
      "intent_class": "dinner"
    },
    {
      "id": 29,
      "slug": "cottage-cheese-protein-balls",
      "title": "Cottage Cheese Protein Balls",
      "description": "Cottage cheese protein balls are the perfect high-protein snack — portable, pop-able, and packed with 15g of protein per serving. These energy-boosting bites combine blended cottage cheese with oats, protein powder, peanut butter, and honey for a no-bake snack that's ready in just 15 minutes. The cottage cheese adds creaminess and extra protein, binding everything together into perfectly round, satisfying bites. Unlike many protein balls that taste dry or chalky, these cottage cheese protein balls are incredibly moist and chewy thanks to the moisture from the cottage cheese. They taste like a peanut butter cookie in bite-form — sweet, nutty, and deeply satisfying. Make a batch on Sunday and stash them in the fridge for the entire week. They're perfect for mid-afternoon energy dips, pre-workout fuel, or a healthy dessert alternative. Kids love them too, making them an excellent lunchbox addition. Customize with your favorite add-ins: mini chocolate chips, dried cranberries, coconut flakes, chia seeds, or crushed pretzels for a sweet-salty combo. Roll them in cocoa powder, shredded coconut, or crushed graham crackers for a pretty finish. These cottage cheese protein balls are one of the easiest and most rewarding cottage cheese recipes for snack prep.",
      "protein": 15,
      "calories": 175,
      "carbs": 18,
      "fat": 7,
      "fiber": 2,
      "sugar": 8,
      "servingSize": "3 balls",
      "yield": "15 balls",
      "prepTime": "10",
      "cookTime": "0",
      "totalTime": "40",
      "difficulty": "Easy",
      "category": "Snacks",
      "tags": ["Cottage Cheese", "Protein Balls", "No-Bake", "Snack", "High-Protein", "Meal Prep"],
      "methods": ["no-cook"],
      "image": "cottage-cheese-protein-balls.png",
      "ingredients": [
        "150g cottage cheese",
        "80g rolled oats",
        "30g vanilla protein powder",
        "40g peanut butter",
        "30g honey",
        "5g vanilla extract",
        "30g mini chocolate chips",
        "20g shredded coconut for rolling"
      ],
      "instructions": [
        {"step": "Blend", "text": "Blend cottage cheese until smooth."},
        {"step": "Mix", "text": "In a bowl, combine blended cottage cheese with oats, protein powder, peanut butter, honey, and vanilla. Mix until a thick, sticky dough forms."},
        {"step": "Fold", "text": "Fold in mini chocolate chips."},
        {"step": "Roll", "text": "Using wet hands, roll tablespoon-sized portions into balls. Roll in shredded coconut if desired."},
        {"step": "Chill", "text": "Place on a parchment-lined tray and refrigerate for at least 30 minutes until firm. Store in an airtight container in the fridge for up to 7 days."}
      ],
      "related_recipes": [
        {"slug": "no-bake-cottage-cheese-cookies", "title": "No-Bake Cottage Cheese Cookies", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-muffins", "title": "Cottage Cheese Muffins", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "peanut-butter-protein-bites", "title": "Peanut Butter Protein Bites", "domain": "proteinbites.co", "category": "protein bites"}
      ],
      "intent_class": "snack"
    },
    {
      "id": 30,
      "slug": "cottage-cheese-muffins",
      "title": "Cottage Cheese Muffins",
      "description": "Cottage cheese muffins are incredibly moist, tender, and packed with 14g of protein per muffin — making them the perfect grab-and-go breakfast or snack. The cottage cheese is the star here, replacing much of the butter and oil you'd find in traditional muffin recipes while adding protein and creating an unbelievably soft crumb. These muffins rise tall and dome beautifully, with a slightly crispy top that gives way to a cloud-soft interior. This cottage cheese muffin recipe is wonderfully versatile — the base recipe works with countless mix-in combinations. Add blueberries for a classic breakfast muffin, chocolate chips for a sweet treat, or lemon zest and poppy seeds for a bright, refreshing variation. The batter comes together in one bowl in about 5 minutes, making these the easiest baking project you'll tackle this week. Bake a batch of 12, cool completely, and store in an airtight container for up to 5 days. They also freeze beautifully — thaw overnight or microwave for 30 seconds for a warm, fresh-tasting muffin any morning. These cottage cheese muffins prove that the simplest cottage cheese recipes can also be the most delicious. Once you taste the difference cottage cheese makes in a muffin, you'll never go back to the butter-heavy version.",
      "protein": 14,
      "calories": 190,
      "carbs": 24,
      "fat": 6,
      "fiber": 2,
      "sugar": 10,
      "servingSize": "1 muffin",
      "yield": "12 muffins",
      "prepTime": "10",
      "cookTime": "22",
      "totalTime": "32",
      "difficulty": "Easy",
      "category": "Snacks",
      "tags": ["Cottage Cheese", "Muffins", "Breakfast", "High-Protein", "Baking", "Meal Prep"],
      "methods": ["oven"],
      "image": "cottage-cheese-muffins.png",
      "ingredients": [
        "225g cottage cheese",
        "2 large eggs",
        "180g all-purpose flour",
        "60g sugar",
        "60g Greek yogurt",
        "30g butter, melted",
        "5g vanilla extract",
        "6g baking powder",
        "3g salt",
        "100g fresh blueberries"
      ],
      "instructions": [
        {"step": "Preheat", "text": "Preheat oven to 190°C (375°F). Line a 12-cup muffin tin with paper liners."},
        {"step": "Blend Wet", "text": "Blend cottage cheese until smooth. Mix with eggs, Greek yogurt, melted butter, sugar, and vanilla in a large bowl."},
        {"step": "Mix Dry", "text": "In a separate bowl, whisk flour, baking powder, and salt. Add to wet ingredients and mix until just combined. Do not overmix."},
        {"step": "Fold", "text": "Gently fold in blueberries using a spatula."},
        {"step": "Bake", "text": "Divide batter evenly among muffin cups (about 2/3 full). Bake for 20-22 minutes until a toothpick comes out clean and tops are golden."},
        {"step": "Cool", "text": "Let cool in pan for 5 minutes, then transfer to a wire rack. Best served warm or at room temperature."}
      ],
      "related_recipes": [
        {"slug": "cottage-cheese-protein-balls", "title": "Cottage Cheese Protein Balls", "domain": "cottagecheeserecipes.co"},
        {"slug": "cottage-cheese-breakfast-bowl", "title": "Cottage Cheese Breakfast Bowl", "domain": "cottagecheeserecipes.co"}
      ],
      "empire_links": [
        {"slug": "blueberry-protein-muffins", "title": "Blueberry Protein Muffins", "domain": "proteinmuffins.com", "category": "protein muffins"}
      ],
      "intent_class": "breakfast"
    }
  ]
}
