{
  "recipes": [
    {
      "id": 1,
      "slug": "chocolate-chip-protein-cookies",
      "title": "Chocolate Chip Protein Cookies",
      "description": "These classic soft and chewy chocolate chip cookies are not only irresistibly delicious but also packed with a powerful protein punch, delivering 21g of protein per serving to support your active lifestyle. The rich, melt-in-your-mouth texture pairs perfectly with the sweet bursts of chocolate chips, creating a satisfying treat that tastes just like the real thing—without the guilt. Perfect for post-workout recovery or a midday snack, these cookies provide a balanced mix of macros to fuel your day while satisfying your sweet tooth. Their moist, chewy consistency makes them a comforting choice for meal prep, as they stay fresh and delightful for days when stored properly. For those with dietary restrictions, they can easily be made gluten-free by swapping in almond or oat flour, and vegan options are simple to achieve with plant-based protein powders and dairy-free chocolate chips. To get the best results, use high-quality protein powder for a smoother texture and avoid overmixing to keep the cookies tender. Enjoy these cookies fresh out of the oven or stored in an airtight container—either way, they’re a tasty way to boost your protein intake without sacrificing flavor.",
      "protein": 21,
      "calories": 165,
      "carbs": 14,
      "fat": 6,
      "fiber": 2,
      "sugar": 5,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Classic",
      "tags": [
        "Chocolate Chip",
        "Classic",
        "Whey"
      ],
      "methods": [
        "whey"
      ],
      "image": "chocolate-chip-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "3g baking soda",
        "2g salt",
        "115g almond butter",
        "80g maple syrup",
        "1 large egg",
        "5g vanilla extract",
        "60g dark chocolate chips"
      ],
      "instructions": [
        {
          "step": "Preheat and Prep",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper or a silicone baking mat."
        },
        {
          "step": "Mix Dry Ingredients",
          "text": "In a large bowl, whisk together the oat flour, protein powder, baking soda, and salt until well combined."
        },
        {
          "step": "Combine Wet Ingredients",
          "text": "In a separate bowl, mix the almond butter, maple syrup, egg, and vanilla extract until smooth."
        },
        {
          "step": "Form Dough",
          "text": "Pour the wet ingredients into the dry and stir until just combined. Fold in the chocolate chips. Do not overmix."
        },
        {
          "step": "Shape and Bake",
          "text": "Scoop 12 equal portions of dough onto the prepared baking sheet. Flatten slightly with your palm. Bake for 10-12 minutes until edges are golden but centers look slightly underdone."
        },
        {
          "step": "Cool",
          "text": "Let cookies cool on the baking sheet for 5 minutes before transferring to a wire rack. They will firm up as they cool."
        }
      ],
      "related_recipes": [
        {
          "slug": "snickerdoodle-protein-cookies",
          "title": "Snickerdoodle Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "raspberry-swirl-protein-brownies",
          "title": "Raspberry Swirl Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "vegan-peanut-butter-jelly-bars",
          "title": "Vegan Peanut Butter & Jelly Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 2,
      "slug": "peanut-butter-protein-cookies",
      "title": "Peanut Butter Protein Cookies",
      "description": "Rich, flourless peanut butter cookies with an incredible 24g of protein per cookie, making them the perfect guilt-free indulgence for fitness enthusiasts. Crafted with just four simple ingredients, these cookies deliver a satisfying chewy texture with a slightly crispy edge, complemented by the creamy, nutty flavor of peanut butter that melts in your mouth. Each bite provides a balanced mix of healthy fats and high-quality protein, helping to fuel your muscles and keep you full longer. They’re an ideal post-workout treat or a convenient snack for meal prep, offering a delicious way to boost your macros without sacrificing taste. Naturally gluten-free, these cookies can easily be adapted to vegan diets by using plant-based sweeteners or egg substitutes—just be sure to select options that maintain the rich, moist texture. For best results, use natural, creamy peanut butter and avoid overbaking to preserve the soft, chewy interior. These cookies are not only a protein-packed delight but also a versatile, satisfying option for anyone looking to satisfy sweet cravings while staying on track with their nutritional goals.",
      "protein": 24,
      "calories": 185,
      "carbs": 10,
      "fat": 9,
      "fiber": 2,
      "sugar": 4,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "8",
      "cookTime": "10",
      "totalTime": "18",
      "difficulty": "Beginner",
      "category": "High Protein",
      "tags": [
        "Peanut Butter",
        "Flourless",
        "25g+"
      ],
      "methods": [
        "whey"
      ],
      "image": "peanut-butter-protein-cookies.png",
      "ingredients": [
        "256g natural peanut butter",
        "60g vanilla whey protein powder",
        "2 large eggs",
        "80g granulated sweetener (monk fruit or erythritol)",
        "3g baking soda",
        "2g vanilla extract"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Ingredients",
          "text": "In a large bowl, combine the peanut butter, eggs, sweetener, and vanilla. Mix until smooth."
        },
        {
          "step": "Add Dry",
          "text": "Add the protein powder and baking soda. Stir until a thick dough forms."
        },
        {
          "step": "Shape",
          "text": "Roll dough into 12 balls and place on the baking sheet. Use a fork to create the classic crosshatch pattern, pressing down to flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 9-10 minutes until edges are set but centers are still soft. Do not overbake."
        },
        {
          "step": "Cool",
          "text": "Cool on the baking sheet for 10 minutes. Cookies will firm up significantly as they cool."
        }
      ],
      "related_recipes": [
        {
          "slug": "monster-protein-cookies",
          "title": "Monster Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-peanut-butter-protein-cookies",
          "title": "Chocolate Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "peanut-butter-protein-brownies",
          "title": "Peanut Butter Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "no-bake-birthday-cake-bars",
          "title": "No-Bake Birthday Cake Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 3,
      "slug": "no-bake-protein-cookies",
      "title": "No-Bake Protein Cookies",
      "description": "These no-bake protein cookies are a quick and effortless treat, ready in just 15 minutes, making them perfect for busy mornings or post-workout fuel. Packed with 18 grams of high-quality protein per serving, they support muscle recovery and keep you feeling satisfied longer, thanks to their balanced macros and wholesome ingredients. The fudgy, chewy texture offers a delightful contrast to traditional baked cookies, with rich chocolatey flavor and a hint of sweetness that will satisfy any sweet tooth. Enjoy these cookies as a nutritious snack after your workout, or prepare a batch ahead of time for convenient, on-the-go energy boosts throughout the week. They’re versatile enough to fit into various dietary needs—gluten-free options are easily achieved with gluten-free oats, and vegan versions can be made with plant-based protein and sweeteners. For best results, mix the ingredients thoroughly to ensure even distribution of protein powder and binders, then refrigerate for at least 30 minutes to firm up before enjoying. Whether you’re aiming to hit your macros or just craving a healthy, indulgent treat, these cookies are a delicious, guilt-free way to stay on track.",
      "protein": 18,
      "calories": 155,
      "carbs": 16,
      "fat": 6,
      "fiber": 3,
      "sugar": 6,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "0",
      "totalTime": "15",
      "difficulty": "Beginner",
      "category": "Quick",
      "tags": [
        "No-Bake",
        "Quick",
        "Meal Prep"
      ],
      "methods": [
        "noBake"
      ],
      "image": "no-bake-protein-cookies.png",
      "ingredients": [
        "90g rolled oats",
        "60g chocolate whey protein powder",
        "128g natural peanut butter",
        "80g honey or maple syrup",
        "30g unsweetened cocoa powder",
        "60ml almond milk",
        "3g vanilla extract"
      ],
      "instructions": [
        {
          "step": "Mix Base",
          "text": "In a large bowl, combine the oats, protein powder, and cocoa powder. Stir to combine."
        },
        {
          "step": "Add Wet Ingredients",
          "text": "Add the peanut butter, honey, almond milk, and vanilla extract. Mix until a thick, sticky dough forms."
        },
        {
          "step": "Adjust Consistency",
          "text": "If the mixture is too dry, add more almond milk 1 tablespoon at a time. If too wet, add more oats."
        },
        {
          "step": "Shape Cookies",
          "text": "Using wet hands, roll the mixture into 12 balls and flatten into cookie shapes on a parchment-lined tray."
        },
        {
          "step": "Chill",
          "text": "Refrigerate for at least 30 minutes until firm. Store in the refrigerator for up to 1 week."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-cookie-dough-bites",
          "title": "Protein Cookie Dough Bites",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "high-protein-brownies",
          "title": "High Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "candy-bar-copycat-almond-mound",
          "title": "Candy Bar Copycat: Almond Mound",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 4,
      "slug": "oatmeal-raisin-protein-cookies",
      "title": "Oatmeal Raisin Protein Cookies",
      "description": "Soft and chewy oatmeal raisin cookies with 19g protein make for a satisfying, macro-friendly snack that hits all the right notes. Packed with high-quality protein, these cookies support muscle recovery and keep you energized throughout the day, making them perfect for post-workout refueling or a nutritious midday treat. The cinnamon-spiced aroma combined with tender oats and sweet raisins creates a delightful balance of flavors and textures—crispy edges give way to a chewy, hearty center that’s both comforting and indulgent. Rich in fiber, they aid digestion and promote sustained fullness, helping you stay on track with your health goals. For best results, use a combination of rolled oats and protein powder to ensure the perfect chewy texture and balanced macros. They’re naturally gluten-free if you opt for certified gluten-free oats, and vegan versions can be easily made with plant-based protein and dairy-free sweeteners. These cookies are ideal for meal prep, allowing you to grab a wholesome snack anytime, whether as a quick breakfast or a nourishing afternoon pick-me-up. Enjoy them warm from the oven or stored in an airtight container for a convenient, delicious way to boost your protein intake while satisfying your sweet tooth.",
      "protein": 19,
      "calories": 170,
      "carbs": 20,
      "fat": 5,
      "fiber": 3,
      "sugar": 8,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "12",
      "cookTime": "14",
      "totalTime": "26",
      "difficulty": "Easy",
      "category": "Classic",
      "tags": [
        "Oatmeal",
        "Raisin",
        "Fiber"
      ],
      "methods": [
        "whey"
      ],
      "image": "oatmeal-raisin-protein-cookies.png",
      "ingredients": [
        "120g rolled oats",
        "60g vanilla whey protein powder",
        "60g oat flour",
        "5g cinnamon",
        "3g baking soda",
        "2g salt",
        "170g unsweetened applesauce",
        "60g maple syrup",
        "1 large egg",
        "60g raisins"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "In a large bowl, combine oats, oat flour, protein powder, cinnamon, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "In another bowl, whisk together applesauce, maple syrup, and egg."
        },
        {
          "step": "Combine",
          "text": "Pour wet ingredients into dry and stir until combined. Fold in raisins."
        },
        {
          "step": "Shape and Bake",
          "text": "Drop rounded tablespoons onto the baking sheet. Bake for 12-14 minutes until edges are golden."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring to a wire rack."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "protein-blondies",
          "title": "Protein Blondies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "meal-prep-banana-bread-bars",
          "title": "Meal Prep Banana Bread Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 5,
      "slug": "double-chocolate-protein-cookies",
      "title": "Double Chocolate Protein Cookies",
      "description": "Decadent double chocolate cookies with 22g protein are the perfect indulgence for chocolate lovers seeking a nutritious boost. Rich cocoa creates a deep, satisfying flavor, while chocolate chips add delightful bursts of sweetness with every bite. These cookies boast a balanced macro profile—high in protein to support muscle recovery and sustained energy, making them an ideal post-workout treat or mid-afternoon pick-me-up. Their tender, chewy texture combined with crispy edges offers a satisfying contrast that keeps you reaching for more. Whether enjoyed fresh out of the oven or packed into your meal prep for the week, they’re versatile and easy to savor anytime. For those with dietary restrictions, they can be made gluten-free by using a gluten-free flour blend, and vegan options are simple with dairy-free chocolate chips and plant-based protein sources. For best results, slightly underbake to achieve a perfect chewy center, and store in an airtight container to maintain freshness. These cookies are as nourishing as they are indulgent, making them a guilt-free way to satisfy your sweet tooth while fueling your body.",
      "protein": 22,
      "calories": 175,
      "carbs": 15,
      "fat": 7,
      "fiber": 3,
      "sugar": 5,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Dessert",
      "tags": [
        "Chocolate",
        "Double Chocolate",
        "Decadent"
      ],
      "methods": [
        "whey"
      ],
      "image": "double-chocolate-protein-cookies.png",
      "ingredients": [
        "90g oat flour",
        "60g chocolate whey protein powder",
        "30g unsweetened cocoa powder",
        "3g baking soda",
        "2g salt",
        "115g almond butter",
        "80g maple syrup",
        "1 large egg",
        "60g dark chocolate chips"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, cocoa powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "In a separate bowl, combine almond butter, maple syrup, and egg until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and stir until just combined. Fold in chocolate chips."
        },
        {
          "step": "Bake",
          "text": "Scoop 12 portions onto the baking sheet. Bake for 10-12 minutes until set around edges."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes. Cookies will be very soft but will firm up."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-peanut-butter-protein-cookies",
          "title": "Chocolate Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "sweet-potato-protein-brownies",
          "title": "Sweet Potato Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "nut-free-vanilla-funfetti-bars",
          "title": "Nut-Free Vanilla Funfetti Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 6,
      "slug": "snickerdoodle-protein-cookies",
      "title": "Snickerdoodle Protein Cookies",
      "description": "Soft, pillowy snickerdoodle cookies rolled in cinnamon sugar with 20g of protein per serving. A guilt-free version of the classic that tastes just like the original. These cookies boast a tender, melt-in-your-mouth texture with a delightful cinnamon-sugar crust that offers just the right crunch on the outside while remaining irresistibly soft inside. Packed with high-quality protein, they make a perfect post-workout treat or a satisfying snack to fuel your day without piling on empty calories. With their balanced macros—combining protein, moderate carbs, and healthy fats—they support your fitness goals while indulging your sweet tooth. The recipe is naturally gluten-free if you use a gluten-free flour blend, and vegan options can be easily accommodated with plant-based protein powder and dairy-free butter. For best results, chill the dough for at least 30 minutes to enhance the cinnamon-sugar coating and improve the overall texture. These cookies are ideal for meal prep, allowing you to enjoy a protein-packed dessert anytime you crave a comforting, nostalgic treat that doesn’t compromise your health.",
      "protein": 20,
      "calories": 160,
      "carbs": 14,
      "fat": 5,
      "fiber": 1,
      "sugar": 4,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "12",
      "cookTime": "10",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Classic",
      "tags": [
        "Snickerdoodle",
        "Cinnamon",
        "Classic"
      ],
      "methods": [
        "whey"
      ],
      "image": "snickerdoodle-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "3g cream of tartar",
        "2g baking soda",
        "2g salt",
        "85g coconut oil, softened",
        "80g granulated sweetener",
        "1 large egg",
        "5g vanilla extract",
        "15g cinnamon-sweetener coating (10g sweetener + 5g cinnamon)"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, cream of tartar, baking soda, and salt."
        },
        {
          "step": "Cream Wet",
          "text": "In another bowl, beat coconut oil and sweetener until fluffy. Add egg and vanilla, mix well."
        },
        {
          "step": "Combine",
          "text": "Add dry ingredients to wet and mix until a dough forms."
        },
        {
          "step": "Roll and Coat",
          "text": "Mix cinnamon and sweetener in a small bowl. Roll dough into 12 balls, then roll each in the cinnamon mixture."
        },
        {
          "step": "Bake",
          "text": "Place on baking sheet and flatten slightly. Bake for 8-10 minutes until edges are set."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "raspberry-swirl-protein-brownies",
          "title": "Raspberry Swirl Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "no-bake-key-lime-pie-bars",
          "title": "No-Bake Key Lime Pie Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 7,
      "slug": "birthday-cake-protein-cookies",
      "title": "Birthday Cake Protein Cookies",
      "description": "These festive funfetti-style protein cookies are a delightful way to indulge while fueling your body with 19 grams of high-quality protein per serving, making them an excellent choice for post-workout recovery or a satisfying snack. Packed with vibrant sprinkles and rich cake batter flavor, each bite offers a perfect balance of soft, chewy texture and a subtle crunch from the colorful sprinkles, creating a celebration-worthy treat that’s as fun to eat as it is nourishing. With a satisfying sweetness and a hint of vanilla, these cookies satisfy your sweet tooth without derailing your fitness goals. Thanks to their high protein content and moderate calories, they’re ideal for meal prepping or enjoying as a guilt-free dessert anytime. They’re naturally gluten-free if you opt for gluten-free flour, and vegan variations can be made using plant-based protein powders and egg substitutes. For best results, ensure your ingredients are well combined and chilled before baking to achieve a consistently soft and chewy texture. Whether enjoyed as a midday pick-me-up or a festive snack, these cookies make a tasty, nutritious addition to any healthy lifestyle.",
      "protein": 19,
      "calories": 165,
      "carbs": 16,
      "fat": 5,
      "fiber": 1,
      "sugar": 6,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "10",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Dessert",
      "tags": [
        "Birthday Cake",
        "Funfetti",
        "Sprinkles"
      ],
      "methods": [
        "whey"
      ],
      "image": "birthday-cake-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "3g baking powder",
        "2g salt",
        "85g Greek yogurt",
        "60g maple syrup",
        "30g coconut oil, melted",
        "5g vanilla extract",
        "3g butter extract (optional)",
        "40g rainbow sprinkles"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, baking powder, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "In another bowl, combine Greek yogurt, maple syrup, coconut oil, vanilla, and butter extract."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until combined. Gently fold in sprinkles."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto the baking sheet. Flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 9-10 minutes until edges are just set. Do not overbake."
        },
        {
          "step": "Decorate",
          "text": "Press additional sprinkles on top while still warm. Cool completely."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "no-bake-protein-brownie-bars",
          "title": "No-Bake Protein Brownie Bars",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "nut-free-sunbutter-bars",
          "title": "Nut-Free Sunbutter Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 8,
      "slug": "vegan-protein-cookies",
      "title": "Vegan Protein Cookies",
      "description": "These 100% plant-based protein cookies pack a powerful nutritional punch, boasting 17 grams of high-quality protein per serving to fuel your muscles and keep you satisfied throughout the day. Made with wholesome pea protein and flax eggs, they offer a dairy-free, vegan-friendly indulgence that doesn’t compromise on flavor or texture. The cookies feature a satisfyingly chewy exterior with a slightly crisp edge, while the inside remains soft and gooey, offering a delightful balance of crunch and tenderness. Their subtly sweet, nutty taste makes them an irresistible treat after a workout or as a nutritious snack on busy days. Perfect for meal prepping, these cookies store well in the fridge and make for a quick, grab-and-go option when you need a clean, energizing boost. For those with gluten sensitivities, they can be easily made gluten-free by using certified gluten-free oats or flour. To get the best results, be sure to measure your ingredients accurately and avoid overbaking, which can dry out the cookies. Whether you're looking to support your fitness goals or simply craving a tasty, plant-based sweet, these cookies are an excellent addition to any health-conscious diet.",
      "protein": 17,
      "calories": 160,
      "carbs": 18,
      "fat": 6,
      "fiber": 3,
      "sugar": 6,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "15",
      "cookTime": "12",
      "totalTime": "27",
      "difficulty": "Medium",
      "category": "Vegan",
      "tags": [
        "Vegan",
        "Plant-Based",
        "Dairy-Free"
      ],
      "methods": [
        "vegan"
      ],
      "image": "vegan-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla pea protein powder",
        "3g baking soda",
        "2g salt",
        "2 flax eggs (14g ground flaxseed + 90ml water)",
        "128g almond butter",
        "80g maple syrup",
        "5g vanilla extract",
        "60g dairy-free chocolate chips"
      ],
      "instructions": [
        {
          "step": "Make Flax Eggs",
          "text": "Mix ground flaxseed with water and let sit for 5 minutes until gel-like."
        },
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine flax eggs, almond butter, maple syrup, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until combined. Fold in chocolate chips."
        },
        {
          "step": "Bake",
          "text": "Scoop 12 portions onto baking sheet. Bake for 11-12 minutes until edges are golden."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 10 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "zucchini-protein-brownies",
          "title": "Zucchini Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "candy-bar-copycat-snickers",
          "title": "Candy Bar Copycat: Protein Snickers",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 9,
      "slug": "gluten-free-protein-cookies",
      "title": "Gluten-Free Protein Cookies",
      "description": "These celiac-safe gluten-free protein cookies are a perfect guilt-free indulgence, packing a robust 20 grams of high-quality protein per serving to support your active lifestyle. Made with certified gluten-free oats and almond flour, they offer a satisfying chewy texture with a slight crunch on the edges, complemented by a rich, nutty flavor that melts in your mouth. The balanced macros make these cookies an excellent post-workout snack or energy-boosting treat during busy days, helping to fuel muscle recovery and keep you full longer. Their versatile, allergen-friendly ingredients make them suitable for gluten-sensitive, celiac, and vegan diets—simply swap honey for a vegan sweetener if needed. For best results, gently fold in extras like dark chocolate chips or chopped nuts to add texture and flavor, and store them in an airtight container to maintain their freshness. Whether you're meal prepping for the week or craving a wholesome snack on the go, these cookies are a delicious way to satisfy your sweet tooth while supporting your nutritional goals.",
      "protein": 20,
      "calories": 170,
      "carbs": 12,
      "fat": 8,
      "fiber": 2,
      "sugar": 5,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Gluten-Free",
      "tags": [
        "Gluten-Free",
        "GF",
        "Celiac-Safe"
      ],
      "methods": [
        "whey"
      ],
      "image": "gluten-free-protein-cookies.png",
      "ingredients": [
        "90g certified gluten-free oat flour",
        "60g almond flour",
        "60g vanilla whey protein powder",
        "3g baking soda",
        "2g salt",
        "115g almond butter",
        "80g maple syrup",
        "1 large egg",
        "5g vanilla extract"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together GF oat flour, almond flour, protein powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine almond butter, maple syrup, egg, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until a dough forms."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto the baking sheet. Flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 10-12 minutes until edges are golden."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "single-serving-protein-brownie",
          "title": "Single-Serving Protein Brownie",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "nut-free-chocolate-seed-bars",
          "title": "Nut-Free Chocolate Seed Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 10,
      "slug": "protein-cookie-dough-bites",
      "title": "Protein Cookie Dough Bites",
      "description": "These edible cookie dough bites pack an impressive 15 grams of protein per serving, making them an ideal guilt-free treat to fuel your active lifestyle. Crafted with heat-treated flour and egg-free ingredients, they’re completely safe to enjoy raw—perfect for a quick, satisfying snack or dessert. The rich, buttery flavor combined with a chewy yet tender texture creates a delightful balance that melts in your mouth, while hints of vanilla and chocolate chips add extra indulgence. With their high-protein content and balanced macros, they make a great post-workout recovery bite or a wholesome addition to your meal prep routine. For those with gluten sensitivities, simply swap in gluten-free oats or flour to keep this treat gluten-free, and vegan options are easily achieved by using plant-based protein powder and dairy-free chocolate chips. To get the best results, ensure your flour is thoroughly heat-treated to eliminate any raw flour concerns, and mix the ingredients until smooth and creamy for a uniform, gooey consistency. These bites are not only nourishing but also versatile—perfect for satisfying sweet cravings without spiking your calorie intake.",
      "protein": 15,
      "calories": 140,
      "carbs": 14,
      "fat": 6,
      "fiber": 2,
      "sugar": 5,
      "servingSize": "2 bites",
      "yield": "24 bites",
      "prepTime": "15",
      "cookTime": "0",
      "totalTime": "15",
      "difficulty": "Beginner",
      "category": "Quick",
      "tags": [
        "Cookie Dough",
        "No-Bake",
        "Edible"
      ],
      "methods": [
        "noBake"
      ],
      "image": "protein-cookie-dough-bites.png",
      "ingredients": [
        "120g heat-treated oat flour",
        "60g vanilla whey protein powder",
        "128g almond butter",
        "60g maple syrup",
        "30ml almond milk",
        "5g vanilla extract",
        "2g salt",
        "45g mini chocolate chips"
      ],
      "instructions": [
        {
          "step": "Heat-Treat Flour",
          "text": "If not using pre-treated flour, microwave oat flour for 1 minute, stirring halfway, to kill any bacteria."
        },
        {
          "step": "Mix Dry",
          "text": "In a large bowl, combine oat flour, protein powder, and salt."
        },
        {
          "step": "Add Wet",
          "text": "Add almond butter, maple syrup, almond milk, and vanilla. Mix until a dough forms."
        },
        {
          "step": "Add Chips",
          "text": "Fold in mini chocolate chips."
        },
        {
          "step": "Shape",
          "text": "Roll into 24 small balls. Place on a parchment-lined tray."
        },
        {
          "step": "Chill",
          "text": "Refrigerate for 30 minutes until firm. Store in the refrigerator for up to 2 weeks."
        }
      ],
      "related_recipes": [
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "sweet-potato-protein-brownies",
          "title": "Sweet Potato Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "nut-free-sunbutter-bars",
          "title": "Nut-Free Sunbutter Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 11,
      "slug": "white-chocolate-macadamia-protein-cookies",
      "title": "White Chocolate Macadamia Protein Cookies",
      "description": "These buttery white chocolate macadamia cookies are a bakery-style treat that packs an impressive 18g of protein per serving, making them the perfect indulgence for your active lifestyle. Crafted to be macro-friendly without sacrificing flavor, they offer a rich, melt-in-your-mouth texture with a delightful crunch from the toasted macadamias and a luscious sweetness from the creamy white chocolate chunks. The buttery aroma and decadent taste make each bite truly irresistible, whether enjoyed as a post-workout reward or a satisfying snack on the go. Thanks to their high protein content, these cookies help support muscle recovery and keep you feeling full longer, making them ideal for meal prep or a midday pick-me-up. They are naturally gluten-free if made with gluten-free oats and can be easily adapted to vegan diets by substituting plant-based white chocolate and dairy-free butter. For best results, chill the dough before baking to enhance the flavors and ensure the cookies hold their shape. These cookies are a versatile, delicious way to indulge your sweet tooth while fueling your body with clean, nourishing ingredients.",
      "protein": 18,
      "calories": 180,
      "carbs": 15,
      "fat": 9,
      "fiber": 2,
      "sugar": 6,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "12",
      "cookTime": "12",
      "totalTime": "24",
      "difficulty": "Easy",
      "category": "Dessert",
      "tags": [
        "White Chocolate",
        "Macadamia",
        "Bakery-Style"
      ],
      "methods": [
        "whey"
      ],
      "image": "white-chocolate-macadamia-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "3g baking soda",
        "2g salt",
        "85g cashew butter",
        "80g maple syrup",
        "1 large egg",
        "5g vanilla extract",
        "45g white chocolate chips",
        "40g chopped macadamia nuts"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine cashew butter, maple syrup, egg, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix. Fold in white chocolate chips and macadamia nuts."
        },
        {
          "step": "Bake",
          "text": "Scoop 12 portions onto baking sheet. Bake for 10-12 minutes until edges are golden."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "cottage-cheese-protein-brownies",
          "title": "Cottage Cheese Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "meal-prep-pumpkin-spice-bars",
          "title": "Meal Prep Pumpkin Spice Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 12,
      "slug": "protein-cookies-for-kids",
      "title": "Protein Cookies for Kids",
      "description": "Kid-approved protein cookies with 12g of muscle-building protein and no artificial sweeteners make for a nutritious and delicious treat that parents can feel good about packing into lunchboxes or serving as an after-school snack. These cookies offer a satisfying combination of a soft, chewy center with just the right amount of crisp on the edges, delivering a tempting blend of sweet and nutty flavors that kids love. Packed with wholesome ingredients, they provide a balanced macronutrient boost—perfect for supporting growing bodies, active kids, and those looking to increase their daily protein intake without sacrificing taste. The cookies are ideal for post-play or homework time, giving kids sustained energy and helping to curb afternoon cravings. For added versatility, they can be made gluten-free by using almond or oat flour, and vegan options are easy to create with plant-based protein powders and non-dairy sweeteners. To ensure the best texture, be sure to measure ingredients precisely and avoid overbaking; they’re best enjoyed slightly soft and chewy. These cookies are a convenient, nutritious snack that fits seamlessly into busy family routines while supporting healthy, active lifestyles.",
      "protein": 12,
      "calories": 130,
      "carbs": 16,
      "fat": 4,
      "fiber": 2,
      "sugar": 7,
      "servingSize": "1 cookie",
      "yield": "16 cookies",
      "prepTime": "10",
      "cookTime": "10",
      "totalTime": "20",
      "difficulty": "Beginner",
      "category": "Kids",
      "tags": [
        "Kids",
        "Lunchbox",
        "School-Safe"
      ],
      "methods": [
        "whey"
      ],
      "image": "protein-cookies-for-kids.png",
      "ingredients": [
        "150g oat flour",
        "45g vanilla whey protein powder",
        "3g baking soda",
        "1g salt",
        "170g mashed ripe banana",
        "60g honey",
        "30g coconut oil, melted",
        "5g vanilla extract",
        "45g mini chocolate chips"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Mash banana until smooth. Add honey, coconut oil, and vanilla. Mix well."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until combined. Fold in chocolate chips."
        },
        {
          "step": "Shape",
          "text": "Scoop 16 small portions onto baking sheet."
        },
        {
          "step": "Bake",
          "text": "Bake for 9-10 minutes until edges are golden."
        },
        {
          "step": "Cool",
          "text": "Cool completely before packing in lunchboxes."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "dairy-free-avocado-protein-brownies",
          "title": "Dairy-Free Avocado Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "meal-prep-pumpkin-spice-bars",
          "title": "Meal Prep Pumpkin Spice Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 13,
      "slug": "cottage-cheese-protein-cookies",
      "title": "Cottage Cheese Protein Cookies",
      "description": "These ultra-soft protein cookies, crafted with creamy cottage cheese, pack a impressive 23 grams of muscle-building protein per serving, making them an ideal choice for post-workout recovery or a satisfying snack to fuel your day. The secret ingredient not only boosts the protein content but also ensures each bite is incredibly moist, tender, and melt-in-your-mouth delicious. With a balanced blend of flavors and a satisfying, chewy texture, these cookies offer a guilt-free indulgence that keeps you full and energized for hours. Their rich, subtly cheesy taste pairs perfectly with a cup of coffee or a glass of milk, making them a versatile treat any time of day. Plus, they’re gluten-free by nature—just ensure your oats are certified gluten-free if needed—and vegan alternatives can easily be made using plant-based protein sources and dairy-free cottage cheese substitutes. For best results, use high-quality cottage cheese and avoid overmixing to preserve that soft, delicate crumb. Whether enjoyed as a quick breakfast, a snack during busy afternoons, or part of your meal prep routine, these cookies are a delicious way to boost your protein intake without sacrificing flavor or texture.",
      "protein": 23,
      "calories": 155,
      "carbs": 12,
      "fat": 4,
      "fiber": 1,
      "sugar": 4,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "14",
      "totalTime": "24",
      "difficulty": "Easy",
      "category": "Whole Food",
      "tags": [
        "Cottage Cheese",
        "Soft",
        "Moist"
      ],
      "methods": [
        "noPowder",
        "blender"
      ],
      "image": "cottage-cheese-protein-cookies.png",
      "ingredients": [
        "225g cottage cheese (blended smooth)",
        "60g vanilla whey protein powder",
        "90g oat flour",
        "60g maple syrup",
        "1 large egg",
        "3g baking powder",
        "5g vanilla extract",
        "2g salt"
      ],
      "instructions": [
        {
          "step": "Blend Cottage Cheese",
          "text": "Blend cottage cheese until completely smooth with no lumps."
        },
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Wet",
          "text": "Combine blended cottage cheese, egg, maple syrup, and vanilla."
        },
        {
          "step": "Add Dry",
          "text": "Add oat flour, protein powder, baking powder, and salt. Mix until combined."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto baking sheet. Flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 12-14 minutes until edges are set and tops are slightly golden."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes. These are very soft when warm."
        }
      ],
      "related_recipes": [
        {
          "slug": "greek-yogurt-protein-cookies",
          "title": "Greek Yogurt Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "no-bake-protein-brownie-bars",
          "title": "No-Bake Protein Brownie Bars",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "gluten-free-chocolate-peanut-butter-protein-bars",
          "title": "Gluten-Free Chocolate Peanut Butter Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 14,
      "slug": "greek-yogurt-protein-cookies",
      "title": "Greek Yogurt Protein Cookies",
      "description": "These incredibly moist protein cookies, crafted with creamy Greek yogurt, deliver a satisfying 21 grams of protein per serving, making them an ideal choice for post-workout recovery or a nourishing snack. The light, fluffy texture melts in your mouth, with a subtle tang from the yogurt that adds a delightful depth of flavor without overpowering sweetness. Packed with wholesome ingredients, they provide a balanced macro profile—rich in protein, moderate in healthy carbs, and low in fat—perfect for supporting muscle repair and sustained energy. Their versatile taste and soft bite make them an irresistible treat that can be enjoyed anytime, whether as an afternoon pick-me-up or part of a meal prep plan for busy weekdays. For gluten-sensitive individuals, simply use gluten-free oats and flour options to ensure the recipe suits your needs; vegans can swap Greek yogurt for plant-based alternatives like coconut or almond yogurt. To achieve the best results, be sure not to overmix the batter to maintain that light, airy consistency, and for extra flavor, consider adding mix-ins like dark chocolate chips or chopped nuts. These cookies are a delicious way to fuel your body while satisfying your sweet tooth—guilt-free and packed with high-quality protein.",
      "protein": 21,
      "calories": 150,
      "carbs": 14,
      "fat": 4,
      "fiber": 1,
      "sugar": 5,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Whole Food",
      "tags": [
        "Greek Yogurt",
        "Moist",
        "Light"
      ],
      "methods": [
        "noPowder"
      ],
      "image": "greek-yogurt-protein-cookies.png",
      "ingredients": [
        "170g nonfat Greek yogurt",
        "60g vanilla whey protein powder",
        "90g oat flour",
        "60g maple syrup",
        "1 large egg",
        "3g baking powder",
        "5g vanilla extract",
        "2g salt",
        "45g chocolate chips (optional)"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Wet",
          "text": "Combine Greek yogurt, egg, maple syrup, and vanilla until smooth."
        },
        {
          "step": "Add Dry",
          "text": "Add oat flour, protein powder, baking powder, and salt. Mix until combined."
        },
        {
          "step": "Add Mix-ins",
          "text": "Fold in chocolate chips if using."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto baking sheet. Flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 10-12 minutes until edges are set."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "cottage-cheese-protein-cookies",
          "title": "Cottage Cheese Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "espresso-protein-brownies",
          "title": "Espresso Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "gluten-free-chocolate-peanut-butter-protein-bars",
          "title": "Gluten-Free Chocolate Peanut Butter Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 15,
      "slug": "almond-flour-protein-cookies",
      "title": "Almond Flour Protein Cookies",
      "description": "These delicious low-carb almond flour protein cookies pack a powerful punch with 19 grams of high-quality protein per serving, making them a perfect choice for supporting muscle recovery and keeping you energized throughout the day. With their tender, slightly chewy texture and a satisfying crunch from toasted almond flour, each bite offers a rich, nutty flavor that’s both wholesome and indulgent. The keto-friendly formulation contains only 8 grams of net carbs per cookie, making it an ideal treat for those following low-carb or ketogenic diets. Whether enjoyed post-workout to replenish your muscles or as a nutritious snack to curb midday cravings, these cookies fit seamlessly into any meal plan. They’re also versatile for meal prep, staying fresh in the fridge for several days—just reheat or enjoy as-is. For vegan or dairy-free options, simply swap eggs for flaxseed or chia seed gel, and use plant-based protein powder. To achieve the best texture, be sure not to overmix the batter and to slightly underbake for a softer center. These cookies are a guilt-free, delicious way to boost your daily protein intake while satisfying your sweet tooth.",
      "protein": 19,
      "calories": 175,
      "carbs": 10,
      "fat": 11,
      "fiber": 2,
      "sugar": 3,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Low-Carb",
      "tags": [
        "Almond Flour",
        "Keto",
        "Low-Carb"
      ],
      "methods": [
        "whey"
      ],
      "image": "almond-flour-protein-cookies.png",
      "ingredients": [
        "150g almond flour",
        "60g vanilla whey protein powder",
        "3g baking soda",
        "2g salt",
        "85g almond butter",
        "60g granulated sweetener (monk fruit)",
        "1 large egg",
        "5g vanilla extract",
        "45g sugar-free chocolate chips"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 325°F (165°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together almond flour, protein powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine almond butter, sweetener, egg, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until a dough forms. Fold in chocolate chips."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto baking sheet. Flatten to 1/2 inch thick."
        },
        {
          "step": "Bake",
          "text": "Bake for 10-12 minutes until edges are golden. Watch carefully as almond flour browns quickly."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 10 minutes. Cookies will be soft but firm up as they cool."
        }
      ],
      "related_recipes": [
        {
          "slug": "sugar-free-protein-cookies",
          "title": "Sugar-Free Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "single-serving-protein-brownie",
          "title": "Single-Serving Protein Brownie",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "vegan-peanut-butter-jelly-bars",
          "title": "Vegan Peanut Butter & Jelly Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 16,
      "slug": "pumpkin-spice-protein-cookies",
      "title": "Pumpkin Spice Protein Cookies",
      "description": "Soft, cakey pumpkin spice cookies with 18g protein. Perfect for fall with warm spices and real pumpkin puree. These cookies are not only irresistibly tender and melt-in-your-mouth delicious, but they also pack a powerful protein punch to fuel your active lifestyle. With a balanced blend of healthy carbs, fats, and fiber, they make an excellent post-workout treat or a satisfying snack to keep you energized throughout the day. Their rich pumpkin flavor and aromatic spices create a cozy, seasonal vibe that’s perfect for autumn gatherings or a quick grab-and-go boost. For those with dietary preferences, they can easily be made gluten-free with almond or oat flour, and vegan options are simple with plant-based protein powder and egg replacements. To get the best results, be sure to measure your pumpkin puree and avoid overmixing to keep the cookies light and fluffy. Enjoy these cookies warm from the oven or store them in an airtight container for a convenient, nutritious snack anytime you need a comforting, protein-rich pick-me-up.",
      "protein": 18,
      "calories": 145,
      "carbs": 16,
      "fat": 4,
      "fiber": 2,
      "sugar": 5,
      "servingSize": "1 cookie",
      "yield": "14 cookies",
      "prepTime": "12",
      "cookTime": "14",
      "totalTime": "26",
      "difficulty": "Easy",
      "category": "Seasonal",
      "tags": [
        "Pumpkin",
        "Fall",
        "Spiced"
      ],
      "methods": [
        "whey"
      ],
      "image": "pumpkin-spice-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "5g pumpkin pie spice",
        "3g baking powder",
        "2g salt",
        "170g pumpkin puree (not pie filling)",
        "60g maple syrup",
        "1 large egg",
        "30g coconut oil, melted",
        "5g vanilla extract"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, pumpkin pie spice, baking powder, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine pumpkin puree, maple syrup, egg, coconut oil, and vanilla."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until just combined. Batter will be thick."
        },
        {
          "step": "Shape",
          "text": "Scoop 14 portions onto baking sheet. These won't spread much, so flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 12-14 minutes until edges are set and tops spring back when touched."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "gingerbread-protein-cookies",
          "title": "Gingerbread Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "low-calorie-protein-brownies",
          "title": "Low Calorie Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "no-bake-key-lime-pie-bars",
          "title": "No-Bake Key Lime Pie Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 17,
      "slug": "lemon-protein-cookies",
      "title": "Lemon Protein Cookies",
      "description": "Bright, zesty lemon cookies with 17g protein per serving offer a delicious way to fuel your day. Packed with high-quality ingredients, these cookies deliver a satisfying balance of macros—rich in protein, moderate in healthy fats, and lightly sweetened with natural citrus notes—making them an excellent choice for post-workout recovery or a midday pick-me-up. The tender crumb melts in your mouth, while the refreshing lemon flavor invigorates your palate with each bite, leaving behind a subtle tang that perfectly complements their light, airy texture. Enjoy them straight from the oven for a warm treat, or prepare a batch in advance for easy, on-the-go snacking throughout the week. They can easily be adapted for gluten-free diets by using almond or oat flour, and vegan options are simple to achieve with plant-based protein powders and dairy-free glaze. For best results, be sure not to overmix the dough to keep the cookies tender and avoid spreading too much during baking. Whether you're craving a guilt-free dessert or a protein-packed snack, these lemon cookies are a bright, refreshing addition to your fitness-focused repertoire.",
      "protein": 17,
      "calories": 150,
      "carbs": 15,
      "fat": 5,
      "fiber": 1,
      "sugar": 5,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "12",
      "cookTime": "10",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Dessert",
      "tags": [
        "Lemon",
        "Citrus",
        "Refreshing"
      ],
      "methods": [
        "whey"
      ],
      "image": "lemon-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "3g baking powder",
        "2g salt",
        "85g Greek yogurt",
        "60g maple syrup",
        "30g coconut oil, melted",
        "10g fresh lemon zest",
        "30ml fresh lemon juice",
        "5g vanilla extract"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, baking powder, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine Greek yogurt, maple syrup, coconut oil, lemon zest, lemon juice, and vanilla."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until just combined."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto baking sheet. Flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 9-10 minutes until edges are just set. Do not overbake."
        },
        {
          "step": "Cool and Glaze",
          "text": "Cool completely. Optional: drizzle with a glaze made from powdered sweetener and lemon juice."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "chocolate-protein-brownies",
          "title": "Chocolate Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "no-bake-key-lime-pie-bars",
          "title": "No-Bake Key Lime Pie Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 18,
      "slug": "monster-protein-cookies",
      "title": "Monster Protein Cookies",
      "description": "Loaded monster cookies with oats, peanut butter, chocolate, and M&Ms with 20g protein. A protein-packed version of the classic that delivers both indulgence and nutrition in every bite. These cookies boast a satisfying chewy texture from hearty oats, complemented by the creamy richness of peanut butter and bursts of sweetness from chocolate chunks and colorful M&Ms. With each cookie offering around 20 grams of protein, they're an excellent choice for post-workout recovery or a satisfying snack to fuel your day. The balanced macros make them a great option for those looking to boost their protein intake without sacrificing flavor. Perfect for meal prep, you can enjoy these cookies fresh or stored in the fridge for a quick, nutritious treat anytime. They're naturally gluten-free if you opt for gluten-free oats, and vegan variants can be made using plant-based peanut butter and dairy-free chocolate. For best results, slightly underbake if you prefer a softer center or let them cool completely for a firmer bite—either way, they're irresistibly delicious and satisfying.",
      "protein": 20,
      "calories": 195,
      "carbs": 20,
      "fat": 8,
      "fiber": 3,
      "sugar": 8,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "12",
      "cookTime": "12",
      "totalTime": "24",
      "difficulty": "Easy",
      "category": "Classic",
      "tags": [
        "Monster",
        "Loaded",
        "Peanut Butter"
      ],
      "methods": [
        "whey"
      ],
      "image": "monster-protein-cookies.png",
      "ingredients": [
        "90g rolled oats",
        "60g vanilla whey protein powder",
        "3g baking soda",
        "2g salt",
        "128g natural peanut butter",
        "80g maple syrup",
        "1 large egg",
        "5g vanilla extract",
        "30g chocolate chips",
        "30g M&M candies"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Combine oats, protein powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "In another bowl, mix peanut butter, maple syrup, egg, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix. Fold in chocolate chips and half the M&Ms."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto baking sheet. Press remaining M&Ms on top."
        },
        {
          "step": "Bake",
          "text": "Bake for 10-12 minutes until edges are set."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-peanut-butter-protein-cookies",
          "title": "Chocolate Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "no-bake-protein-brownie-bars",
          "title": "No-Bake Protein Brownie Bars",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "nut-free-vanilla-funfetti-bars",
          "title": "Nut-Free Vanilla Funfetti Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 19,
      "slug": "high-protein-cookies-30g",
      "title": "High Protein Cookies (30g)",
      "description": "Maximize your protein intake with these indulgent cookies, each packing an impressive 30 grams of muscle-building protein to fuel your active lifestyle. Crafted to support serious athletes and fitness enthusiasts alike, these cookies deliver a satisfyingly chewy texture with a perfect balance of sweetness and richness, making every bite both delicious and nourishing. Rich in essential macros, they provide a wholesome combination of high-quality protein, healthy fats, and moderate carbs, helping you stay energized and aid muscle recovery post-workout. Whether enjoyed as a quick snack after training or prepared in advance for a convenient meal prep option, these cookies are versatile and satisfying. They are naturally gluten-free when made with gluten-free ingredients and can easily be adapted for vegans by substituting plant-based protein sources. For best results, use fresh, high-quality ingredients and avoid overmixing to keep the cookies tender and moist. These cookies are not only a tasty treat but also a smart way to meet your daily protein goals without sacrificing flavor or texture.",
      "protein": 30,
      "calories": 220,
      "carbs": 14,
      "fat": 7,
      "fiber": 2,
      "sugar": 4,
      "servingSize": "1 cookie",
      "yield": "10 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Medium",
      "category": "High Protein",
      "tags": [
        "30g+",
        "Anabolic",
        "Maximum Protein"
      ],
      "methods": [
        "whey"
      ],
      "image": "high-protein-cookies-30g.png",
      "ingredients": [
        "90g oat flour",
        "90g vanilla whey protein powder",
        "30g casein protein powder",
        "3g baking soda",
        "2g salt",
        "170g nonfat Greek yogurt",
        "60g maple syrup",
        "100g liquid egg whites",
        "5g vanilla extract"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, whey protein, casein protein, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine Greek yogurt, maple syrup, egg whites, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until a thick batter forms. Let rest 5 minutes."
        },
        {
          "step": "Shape",
          "text": "Scoop 10 large portions onto baking sheet. Flatten to 3/4 inch thick."
        },
        {
          "step": "Bake",
          "text": "Bake for 11-12 minutes until edges are set and tops are slightly golden."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 10 minutes. These are dense and will firm up significantly."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "fudgy-protein-brownies",
          "title": "Fudgy Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "dairy-free-coconut-almond-protein-bars",
          "title": "Dairy-Free Coconut Almond Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 20,
      "slug": "chocolate-peanut-butter-protein-cookies",
      "title": "Chocolate Peanut Butter Protein Cookies",
      "description": "Indulge in these irresistible chocolate peanut butter protein cookies, packed with 22 grams of muscle-nourishing protein per serving to fuel your day and support your fitness goals. The fudgy chocolate base delivers a rich, velvety texture that melts in your mouth, complemented perfectly by a luscious peanut butter swirl that adds a creamy, nutty burst of flavor in every bite. With their satisfying chew and decadent taste, these cookies serve as a delicious post-workout treat or a wholesome snack to keep you energized throughout the day. Thanks to their high protein content and balanced macros, they provide sustained energy without a sugar crash, making them ideal for meal prep or on-the-go snacking. These cookies are naturally gluten-free if made with gluten-free oats and ingredients, and vegan options can be achieved by using plant-based protein powders and nut butters. For best results, gently swirl the peanut butter on top of the chocolate batter before baking to create a beautiful marbled effect, and avoid overbaking to maintain that perfect fudgy texture. Whether you're craving something sweet after your workout or need a portable snack, these cookies deliver indulgence with a healthy twist you'll keep coming back to.",
      "protein": 22,
      "calories": 185,
      "carbs": 14,
      "fat": 9,
      "fiber": 3,
      "sugar": 5,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "12",
      "cookTime": "12",
      "totalTime": "24",
      "difficulty": "Easy",
      "category": "Dessert",
      "tags": [
        "Chocolate",
        "Peanut Butter",
        "Swirl"
      ],
      "methods": [
        "whey"
      ],
      "image": "chocolate-peanut-butter-protein-cookies.png",
      "ingredients": [
        "90g oat flour",
        "60g chocolate whey protein powder",
        "25g unsweetened cocoa powder",
        "3g baking soda",
        "2g salt",
        "85g almond butter",
        "80g maple syrup",
        "1 large egg",
        "5g vanilla extract",
        "64g natural peanut butter (for swirl)"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, cocoa powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine almond butter, maple syrup, egg, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until a dough forms."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto baking sheet. Make a small indent in each."
        },
        {
          "step": "Add Swirl",
          "text": "Add 1/2 teaspoon peanut butter to each indent. Use a toothpick to swirl."
        },
        {
          "step": "Bake",
          "text": "Bake for 10-12 minutes until edges are set."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "double-chocolate-protein-cookies",
          "title": "Double Chocolate Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "monster-protein-cookies",
          "title": "Monster Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "protein-blondies",
          "title": "Protein Blondies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "vegan-chocolate-chip-cookie-dough-bars",
          "title": "Vegan Chocolate Chip Cookie Dough Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 21,
      "slug": "banana-protein-cookies",
      "title": "Banana Protein Cookies",
      "description": "Naturally sweetened banana cookies with 16g of protein per serving, making them a delicious and nourishing treat for any time of day. Crafted with ripe bananas, these cookies deliver a moist, tender crumb with a subtle natural sweetness that satisfies your cravings without added sugars. Packed with high-quality protein, they support muscle recovery and help keep you full longer, making them an ideal post-workout snack or a satisfying midday pick-me-up. The chewy texture combined with hints of wholesome ingredients creates a flavor that’s both comforting and satisfying, with hints of banana and a light, nutty undertone. These cookies are versatile enough for meal prep, allowing you to batch them ahead of time for convenient, nutritious snacking throughout the week. For those with dietary restrictions, they can easily be made gluten-free by using gluten-free oats or flour, and vegan options are simple with plant-based protein powders and flax eggs. To get the best texture, be sure to mash the bananas thoroughly and avoid over-baking to keep them soft and moist. Whether enjoyed fresh or stored in an airtight container, these cookies are a guilt-free indulgence that fuels your body and delights your senses.",
      "protein": 16,
      "calories": 140,
      "carbs": 18,
      "fat": 4,
      "fiber": 2,
      "sugar": 8,
      "servingSize": "1 cookie",
      "yield": "14 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Beginner",
      "category": "Whole Food",
      "tags": [
        "Banana",
        "Natural",
        "Low Sugar"
      ],
      "methods": [
        "whey"
      ],
      "image": "banana-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "3g baking soda",
        "3g cinnamon",
        "2g salt",
        "200g mashed ripe bananas (about 2 large)",
        "30g maple syrup",
        "1 large egg",
        "5g vanilla extract",
        "45g walnuts, chopped (optional)"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, baking soda, cinnamon, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Mash bananas until smooth. Add maple syrup, egg, and vanilla. Mix well."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until combined. Fold in walnuts if using."
        },
        {
          "step": "Shape",
          "text": "Scoop 14 portions onto baking sheet. Flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 10-12 minutes until edges are golden."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes before transferring."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "peanut-butter-protein-brownies",
          "title": "Peanut Butter Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "meal-prep-oat-and-honey-bars",
          "title": "Meal Prep Oat and Honey Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 22,
      "slug": "sugar-free-protein-cookies",
      "title": "Sugar-Free Protein Cookies",
      "description": "These sugar-free protein cookies are a delicious way to boost your daily protein intake with 19 grams of high-quality protein per serving, making them an ideal post-workout treat or satisfying snack to fuel your day. Sweetened naturally with monk fruit and stevia, they are perfect for those managing blood sugar levels, offering a diabetic-friendly and keto-approved indulgence without sacrificing flavor. The cookies boast a satisfying crunch on the outside with a soft, chewy interior that melts in your mouth, complemented by a subtle sweetness and rich, nutty undertones. Packed with wholesome ingredients, they provide an excellent balance of macros—low in carbs and healthy fats—supporting your fitness and nutrition goals. These cookies are versatile and can easily be adapted for vegan diets with plant-based protein powders and dairy-free ingredients. For the best texture, ensure you measure your ingredients accurately and allow the cookies to cool completely before enjoying. Perfect for meal prep, you can store them in an airtight container for a quick, nutritious snack anytime you need a protein boost or a guilt-free dessert.",
      "protein": 19,
      "calories": 145,
      "carbs": 10,
      "fat": 7,
      "fiber": 2,
      "sugar": 0,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Low-Carb",
      "tags": [
        "Sugar-Free",
        "Diabetic-Friendly",
        "Keto"
      ],
      "methods": [
        "whey"
      ],
      "image": "sugar-free-protein-cookies.png",
      "ingredients": [
        "90g almond flour",
        "60g vanilla whey protein powder",
        "30g oat fiber",
        "3g baking soda",
        "2g salt",
        "85g almond butter",
        "80g granulated monk fruit sweetener",
        "1 large egg",
        "5g vanilla extract",
        "45g sugar-free chocolate chips"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 325°F (165°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together almond flour, protein powder, oat fiber, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine almond butter, sweetener, egg, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until a dough forms. Fold in chocolate chips."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto baking sheet. Flatten to 1/2 inch thick."
        },
        {
          "step": "Bake",
          "text": "Bake for 10-12 minutes until edges are golden."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 10 minutes. These firm up significantly as they cool."
        }
      ],
      "related_recipes": [
        {
          "slug": "almond-flour-protein-cookies",
          "title": "Almond Flour Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "protein-blondies",
          "title": "Protein Blondies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "no-bake-matcha-coconut-bars",
          "title": "No-Bake Matcha Coconut Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 23,
      "slug": "thin-crispy-protein-cookies",
      "title": "Thin & Crispy Protein Cookies",
      "description": "These perfectly thin and crispy protein cookies deliver a satisfying crunch with every bite, making them an irresistible treat for snack lovers and fitness enthusiasts alike. Packed with 15 grams of high-quality protein per serving, they provide an excellent way to fuel your muscles and support muscle recovery, whether you're post-workout or need a midday energy boost. The delicate, wafer-thin texture melts in your mouth, offering a delightful balance of sweetness and crunch that keeps you coming back for more. With only 135 calories per serving, they’re an ideal guilt-free snack that can easily fit into your meal prep routine or be enjoyed on-the-go. For those with dietary preferences, these cookies can be made gluten-free by using alternative flours and can be vegan-friendly with plant-based protein powders and swaps. To get the best results, ensure your dough is well chilled before baking for crispier edges, and avoid overbaking to maintain that perfect crispy yet tender bite. Whether you're craving a crunchy snack after the gym or a quick, protein-packed treat during a busy day, these cookies are a delicious and nutritious choice to satisfy your cravings while supporting your fitness goals.",
      "protein": 15,
      "calories": 135,
      "carbs": 14,
      "fat": 5,
      "fiber": 1,
      "sugar": 4,
      "servingSize": "1 cookie",
      "yield": "16 cookies",
      "prepTime": "10",
      "cookTime": "14",
      "totalTime": "24",
      "difficulty": "Easy",
      "category": "Classic",
      "tags": [
        "Thin",
        "Crispy",
        "Crunchy"
      ],
      "methods": [
        "whey"
      ],
      "image": "thin-crispy-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "45g vanilla whey protein powder",
        "3g baking soda",
        "2g salt",
        "60g coconut oil, melted",
        "80g granulated sweetener",
        "1 large egg",
        "5g vanilla extract",
        "45g chocolate chips"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine melted coconut oil, sweetener, egg, and vanilla until smooth."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix. Fold in chocolate chips."
        },
        {
          "step": "Shape",
          "text": "Scoop 16 small portions onto baking sheet, spacing 3 inches apart. Flatten very thin."
        },
        {
          "step": "Bake",
          "text": "Bake for 12-14 minutes until golden brown throughout."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet completely. Cookies will crisp up as they cool."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "avocado-protein-brownies",
          "title": "Avocado Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "nut-free-chocolate-seed-bars",
          "title": "Nut-Free Chocolate Seed Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 24,
      "slug": "red-velvet-protein-cookies",
      "title": "Red Velvet Protein Cookies",
      "description": "Stunning red velvet cookies with cream cheese frosting and 18g of protein per serving, making them the perfect guilt-free indulgence for any occasion. Packed with high-quality protein, these cookies support muscle recovery and help keep you full longer, making them an ideal treat after a workout or as a satisfying snack throughout the day. The tender, moist crumb of the cookies offers a delightful balance of rich cocoa flavor with a hint of vanilla, while the smooth, tangy cream cheese frosting adds a luscious finish that melts in your mouth. With just the right touch of sweetness, they strike a perfect harmony between indulgence and nutrition. These cookies are versatile for meal prep; bake a batch ahead and enjoy them fresh or pack them for on-the-go energy boosts. For those with dietary considerations, they can easily be made gluten-free using almond or oat flour, and vegan versions are possible with plant-based cream cheese and egg substitutes. For best results, use high-quality cocoa and ensure the cream cheese frosting is well-whipped to achieve that irresistible, velvety texture. Whether you're celebrating Valentine's Day, fueling recovery, or simply craving a decadent yet nutritious treat, these red velvet protein cookies are sure to impress.",
      "protein": 18,
      "calories": 165,
      "carbs": 16,
      "fat": 5,
      "fiber": 1,
      "sugar": 6,
      "servingSize": "1 cookie",
      "yield": "12 cookies",
      "prepTime": "15",
      "cookTime": "10",
      "totalTime": "25",
      "difficulty": "Medium",
      "category": "Seasonal",
      "tags": [
        "Red Velvet",
        "Valentine",
        "Cream Cheese"
      ],
      "methods": [
        "whey"
      ],
      "image": "red-velvet-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "15g unsweetened cocoa powder",
        "3g baking powder",
        "2g salt",
        "85g Greek yogurt",
        "60g maple syrup",
        "1 large egg",
        "10ml red food coloring",
        "5g vanilla extract",
        "60g white chocolate chips"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, cocoa powder, baking powder, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine Greek yogurt, maple syrup, egg, food coloring, and vanilla."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until combined. Fold in white chocolate chips."
        },
        {
          "step": "Shape",
          "text": "Scoop 12 portions onto baking sheet. Flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 9-10 minutes until edges are set."
        },
        {
          "step": "Cool and Frost",
          "text": "Cool completely. Optional: top with a cream cheese frosting drizzle."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "no-bake-protein-brownie-bars",
          "title": "No-Bake Protein Brownie Bars",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "dairy-free-coconut-almond-protein-bars",
          "title": "Dairy-Free Coconut Almond Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 25,
      "slug": "gingerbread-protein-cookies",
      "title": "Gingerbread Protein Cookies",
      "description": "Warm, spiced gingerbread cookies with 17g protein make for a delightful holiday treat that satisfies your sweet tooth while fueling your body. Packed with high-quality protein, these cookies help support muscle recovery and keep you energized, making them an ideal post-workout indulgence or a nutritious snack on busy days. The soft, melt-in-your-mouth texture combined with the rich, warming aroma of ginger, cinnamon, and molasses creates a comforting holiday vibe in every bite. With their balanced macros—just 150 calories per serving—they allow you to enjoy festive flavors without the guilt. Perfect for meal prep, these cookies can be baked ahead and stored for convenient snacking throughout the season. For a vegan version, substitute plant-based protein powder and dairy-free sweeteners, and for gluten-free options, use almond or oat flour. To get the best results, be sure to measure your ingredients carefully and avoid overbaking to keep the cookies irresistibly soft. Whether enjoyed on your holiday cookie platter or as a cozy treat on chilly evenings, these gingerbread protein cookies are a festive, nutritious addition to your seasonal repertoire.",
      "protein": 17,
      "calories": 150,
      "carbs": 17,
      "fat": 4,
      "fiber": 1,
      "sugar": 6,
      "servingSize": "1 cookie",
      "yield": "14 cookies",
      "prepTime": "15",
      "cookTime": "10",
      "totalTime": "25",
      "difficulty": "Easy",
      "category": "Seasonal",
      "tags": [
        "Gingerbread",
        "Holiday",
        "Spiced"
      ],
      "methods": [
        "whey"
      ],
      "image": "gingerbread-protein-cookies.png",
      "ingredients": [
        "120g oat flour",
        "60g vanilla whey protein powder",
        "5g ground ginger",
        "3g cinnamon",
        "2g nutmeg",
        "1g cloves",
        "3g baking soda",
        "2g salt",
        "60g molasses",
        "60g maple syrup",
        "1 large egg",
        "30g coconut oil, melted"
      ],
      "instructions": [
        {
          "step": "Preheat",
          "text": "Preheat your oven to 350°F (175°C). Line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Dry",
          "text": "Whisk together oat flour, protein powder, ginger, cinnamon, nutmeg, cloves, baking soda, and salt."
        },
        {
          "step": "Mix Wet",
          "text": "Combine molasses, maple syrup, egg, and melted coconut oil."
        },
        {
          "step": "Combine",
          "text": "Add wet to dry and mix until a soft dough forms."
        },
        {
          "step": "Chill",
          "text": "Refrigerate dough for 15 minutes for easier handling."
        },
        {
          "step": "Shape",
          "text": "Roll into 14 balls and place on baking sheet. Flatten slightly."
        },
        {
          "step": "Bake",
          "text": "Bake for 9-10 minutes until edges are set but centers are soft."
        },
        {
          "step": "Cool",
          "text": "Cool on baking sheet for 5 minutes. Optional: decorate with icing."
        }
      ],
      "related_recipes": [
        {
          "slug": "pumpkin-spice-protein-cookies",
          "title": "Pumpkin Spice Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "gluten-free-black-bean-protein-brownies",
          "title": "Gluten-Free Black Bean Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "dairy-free-coconut-almond-protein-bars",
          "title": "Dairy-Free Coconut Almond Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 100,
      "slug": "gluten-free-oat-flour-protein-cookies",
      "title": "Gluten-Free Oat Flour Protein Cookies",
      "description": "Soft, chewy protein cookies made with certified gluten-free oat flour are the perfect guilt-free treat that packs a punch of nutrition. Each cookie delivers around 10 grams of high-quality protein, making them an ideal post-workout snack to help repair and build muscle, or a satisfying energy boost during busy days. The tender, melt-in-your-mouth texture combined with rich chocolate chips creates a delightful balance of sweetness and wholesome goodness that everyone will enjoy. With their gluten-free oat base, these cookies are suitable for gluten-sensitive diets and can easily be made vegan by swapping in plant-based chocolate chips and a flaxseed egg. Their dense, chewy bite and comforting chocolate flavor make them a versatile choice for meal prep, snack time, or even a quick dessert. For best results, use fresh, high-quality ingredients and avoid overbaking to maintain their soft texture. These cookies are not only nutritious but also incredibly satisfying, making them a smart, delicious addition to your fitness-focused lifestyle.",
      "protein": 10,
      "calories": 125,
      "carbs": 14,
      "fat": 5,
      "fiber": 2,
      "sugar": 6,
      "servingSize": "1 cookie",
      "yield": "16 cookies",
      "prepTime": "10",
      "cookTime": "12",
      "totalTime": "22",
      "difficulty": "Easy",
      "category": "Cookies",
      "tags": [
        "gluten-free",
        "oat-flour",
        "chocolate-chip",
        "chewy"
      ],
      "methods": [
        "whey"
      ],
      "image": "gluten-free-oat-flour-protein-cookies.png",
      "ingredients": [
        "150g certified gluten-free oat flour",
        "60g vanilla whey protein powder",
        "80g coconut sugar",
        "1 large egg",
        "80g almond butter",
        "60ml unsweetened almond milk",
        "1 tsp vanilla extract",
        "1/2 tsp baking soda",
        "Pinch of salt",
        "80g dark chocolate chips"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 175°C (350°F) and line a baking sheet with parchment paper."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a large bowl, whisk together the egg, almond butter, almond milk, and vanilla until smooth."
        },
        {
          "step": "Add Dry Ingredients",
          "text": "Add the oat flour, protein powder, coconut sugar, baking soda, and salt. Mix until a dough forms."
        },
        {
          "step": "Fold in Chips",
          "text": "Fold in the chocolate chips until evenly distributed."
        },
        {
          "step": "Bake",
          "text": "Scoop tablespoon-sized balls onto the baking sheet. Flatten slightly. Bake for 10-12 minutes until edges are golden. Cool on pan for 5 minutes."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "classic-protein-brownies-recipe",
          "title": "Classic Protein Brownies Recipe",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "no-bake-cashew-coconut-bars",
          "title": "No-Bake Cashew Coconut Protein Bars",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    },
    {
      "id": 101,
      "slug": "dairy-free-peanut-butter-protein-cookies",
      "title": "Dairy-Free Peanut Butter Protein Cookies",
      "description": "These classic peanut butter cookies are completely dairy-free and infused with plant-based protein, offering a wholesome treat that’s as nourishing as it is delicious. Each cookie delivers approximately 12 grams of protein, making them an excellent choice for post-workout recovery or a satisfying snack to fuel your day. The soft, chewy texture combined with the rich, nutty flavor of peanut butter creates an irresistible mouthfeel that melts in your mouth with every bite. Their balanced macros make them a smart addition to any fitness-focused diet, supporting muscle repair and sustained energy. Perfect for meal prep, these cookies are easy to store and enjoy throughout the week, whether as a quick snack or a dessert. They’re naturally gluten-free if you opt for gluten-free oats, and vegan-friendly with plant-based ingredients, catering to various dietary needs. For best results, use high-quality peanut butter and avoid overbaking to keep the cookies soft and moist. Pair them with a glass of almond milk or a cup of tea for an enjoyable, nutrient-packed treat anytime you crave something sweet and satisfying.",
      "protein": 12,
      "calories": 135,
      "carbs": 12,
      "fat": 7,
      "fiber": 2,
      "sugar": 6,
      "servingSize": "1 cookie",
      "yield": "14 cookies",
      "prepTime": "10",
      "cookTime": "10",
      "totalTime": "20",
      "difficulty": "Easy",
      "category": "Cookies",
      "tags": [
        "dairy-free",
        "peanut-butter",
        "vegan",
        "classic"
      ],
      "methods": [
        "vegan"
      ],
      "image": "dairy-free-peanut-butter-protein-cookies.png",
      "ingredients": [
        "180g natural peanut butter",
        "60g vanilla plant-based protein powder",
        "80g coconut sugar",
        "1 flax egg (1 tbsp ground flaxseed + 3 tbsp water)",
        "60ml maple syrup",
        "1 tsp vanilla extract",
        "1/2 tsp baking soda",
        "Pinch of salt"
      ],
      "instructions": [
        {
          "step": "Prepare Flax Egg",
          "text": "Mix ground flaxseed with water and let sit for 5 minutes until gel-like."
        },
        {
          "step": "Mix Ingredients",
          "text": "In a large bowl, combine peanut butter, coconut sugar, maple syrup, flax egg, and vanilla. Mix until smooth."
        },
        {
          "step": "Add Dry Ingredients",
          "text": "Add the protein powder, baking soda, and salt. Mix until a thick dough forms."
        },
        {
          "step": "Shape Cookies",
          "text": "Roll into 14 balls and place on a parchment-lined baking sheet. Flatten with a fork in a crosshatch pattern."
        },
        {
          "step": "Bake",
          "text": "Bake at 175°C (350°F) for 8-10 minutes until edges are set. Cool on pan for 10 minutes before moving."
        }
      ],
      "related_recipes": [
        {
          "slug": "chocolate-chip-protein-cookies",
          "title": "Chocolate Chip Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "peanut-butter-protein-cookies",
          "title": "Peanut Butter Protein Cookies",
          "domain": "proteincookies.co"
        },
        {
          "slug": "no-bake-protein-cookies",
          "title": "No-Bake Protein Cookies",
          "domain": "proteincookies.co"
        }
      ],
      "empire_links": [
        {
          "slug": "low-calorie-protein-brownies",
          "title": "Low Calorie Protein Brownies",
          "domain": "proteinbrownies.co",
          "category": "protein brownies"
        },
        {
          "slug": "candy-bar-copycat-twix",
          "title": "Candy Bar Copycat: Protein Twix",
          "domain": "proteinbars.co",
          "category": "protein bars"
        }
      ]
    }
  ]
}