{
  "recipes": [
    {
      "id": 1,
      "slug": "protein-banana-bread",
      "title": "Classic Protein Banana Bread",
      "description": "This delicious and moist banana bread is packed with 25 grams of protein per slice, making it the perfect treat to fuel your day or support your post-workout recovery. Its tender crumb and subtly sweet banana flavor are complemented by a hearty, satisfying texture that melts in your mouth with every bite. Rich in quality protein, fiber, and healthy carbs, it provides sustained energy and helps keep hunger at bay, making it an ideal choice for meal prep or a quick snack on the go. Whether enjoyed warm with a spread of nut butter or sliced and topped with a dollop of Greek yogurt, this bread delivers both flavor and nutritional benefits in every slice. For those with dietary restrictions, it's easily adaptable—try using gluten-free oats or plant-based protein powder to make it vegan and gluten-free. To achieve the best results, ensure your bananas are ripe for maximum sweetness and mash them thoroughly to prevent lumps; adding a handful of chopped nuts can also boost crunch and healthy fats. Perfect for anyone looking to indulge guilt-free while hitting their daily macro goals, this banana bread is a wholesome, versatile treat you’ll want to make again and again.",
      "protein": 25,
      "calories": 220,
      "carbs": 20,
      "fat": 8,
      "fiber": 3,
      "sugar": 9,
      "servingSize": "1 slice",
      "yield": "10 slices",
      "prepTime": "15",
      "cookTime": "30",
      "totalTime": "45",
      "difficulty": "Easy",
      "category": "Banana Bread",
      "tags": [
        "banana bread",
        "protein",
        "healthy"
      ],
      "methods": [
        "whey"
      ],
      "image": "protein-banana-bread.png",
      "ingredients": [
        "200g ripe bananas",
        "100g whey protein powder (vanilla or unflavored)",
        "80g oat flour",
        "50g almond flour",
        "2 large eggs",
        "60g plain Greek yogurt",
        "30g honey or maple syrup",
        "1 tsp baking powder",
        "1/2 tsp baking soda",
        "1/2 tsp cinnamon"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 350°F (175°C) and grease a 9x5 inch loaf pan."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a large bowl, mash the ripe bananas. Whisk in the eggs, Greek yogurt, and honey until well combined."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a separate bowl, mix together the whey protein powder, oat flour, almond flour, baking powder, baking soda, and cinnamon."
        },
        {
          "step": "Combine Wet and Dry",
          "text": "Pour the dry ingredients into the wet ingredients and stir until just combined. Do not overmix."
        },
        {
          "step": "Bake",
          "text": "Pour the batter into the prepared loaf pan and bake for 25-30 minutes, or until a toothpick inserted into the center comes out clean."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool in the pan for 10 minutes before transferring it to a wire rack to cool completely."
        }
      ],
      "related_recipes": [
        {
          "slug": "healthy-protein-banana-bread",
          "title": "Healthy Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-pumpkin-bread",
          "title": "Healthy Protein Pumpkin Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "blueberry-vegan-protein-pancakes",
          "title": "Blueberry Vegan Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "maple-pecan-protein-oatmeal",
          "title": "Maple Pecan Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 2,
      "slug": "high-protein-banana-bread",
      "title": "High Protein Banana Bread Recipe",
      "description": "Boost your protein intake with this delicious banana bread, boasting 28g of protein per serving. Packed with wholesome ingredients, this bread provides a satisfying balance of macronutrients—perfect for fueling your day or supporting your post-workout recovery. The moist, tender crumb is complemented by a subtle sweetness from ripe bananas and a hint of warmth from cinnamon, creating a comforting aroma with every slice. Its dense texture is both hearty and indulgent, making each bite incredibly satisfying without feeling heavy. Ideal for meal prep, you can enjoy this bread as a quick breakfast, a nutritious snack, or an energizing post-workout treat. For those with dietary restrictions, it can easily be made gluten-free by using almond or oat flour, and vegan options are simple with plant-based protein powders and flax eggs. To achieve the best results, be sure to mash the bananas thoroughly and avoid overmixing the batter to keep the bread light and fluffy. Whether you're looking to boost your protein intake or simply indulge in a delicious treat, this banana bread is a wholesome, versatile choice that fits seamlessly into a healthy lifestyle.",
      "protein": 28,
      "calories": 240,
      "carbs": 22,
      "fat": 9,
      "fiber": 4,
      "sugar": 8,
      "servingSize": "1 slice",
      "yield": "10 slices",
      "prepTime": "15",
      "cookTime": "35",
      "totalTime": "50",
      "difficulty": "Easy",
      "category": "Banana Bread",
      "tags": [
        "high protein",
        "banana bread",
        "recipe"
      ],
      "methods": [
        "casein"
      ],
      "image": "high-protein-banana-bread.png",
      "ingredients": [
        "220g ripe bananas",
        "120g casein protein powder (chocolate)",
        "70g coconut flour",
        "3 large egg whites",
        "80g unsweetened applesauce",
        "40g stevia or other sweetener",
        "1 tsp vanilla extract",
        "1 tsp baking soda",
        "1/2 tsp salt"
      ],
      "instructions": [
        {
          "step": "Preheat and Prep",
          "text": "Preheat your oven to 325°F (165°C). Lightly grease and flour a loaf pan."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a blender, combine mashed bananas, egg whites, applesauce, and vanilla extract. Blend until smooth."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a large bowl, whisk together casein protein powder, coconut flour, sweetener, baking soda, and salt."
        },
        {
          "step": "Create Batter",
          "text": "Pour the wet ingredients into the dry ingredients and mix until a thick batter forms."
        },
        {
          "step": "Bake the Bread",
          "text": "Spread the batter evenly in the prepared pan. Bake for 30-35 minutes, or until the top is golden brown and a toothpick comes out clean."
        },
        {
          "step": "Cool and Serve",
          "text": "Allow the bread to cool for at least 20 minutes before slicing and serving."
        }
      ],
      "related_recipes": [
        {
          "slug": "high-protein-banana-bread-recipe",
          "title": "Ultimate High-Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "berries-and-cream-protein-crepes",
          "title": "Berries and Cream Protein Crepes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "coconut-protein-oatmeal",
          "title": "Coconut Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 3,
      "slug": "protein-banana-bread-recipe",
      "title": "Simple Protein Banana Bread Recipe",
      "description": "This straightforward and delicious protein banana bread recipe delivers a satisfying slice with 22 grams of muscle-loving protein per serving, making it an ideal choice for fueling your day. Packed with wholesome ingredients, it's not only rich in protein but also offers a balanced mix of healthy carbs and fats, perfect for supporting muscle recovery and sustained energy. The moist, tender crumb melts in your mouth, while the natural sweetness of ripe bananas pairs beautifully with a hint of vanilla and a touch of cinnamon, creating a comforting yet nutritious treat. Its dense texture makes it a perfect post-workout snack or a satisfying breakfast on busy mornings. Thanks to its high protein content, it can help keep you full longer and curb cravings between meals. For those with dietary restrictions, this bread can easily be made gluten-free by using almond or oat flour, and vegan options are simple with plant-based protein powders or flax eggs. To achieve the best rise and texture, be sure to measure your ingredients carefully and avoid overmixing the batter. Enjoy it fresh out of the oven, or store slices in the fridge for quick, easy meals throughout the week—it's an indulgent, health-conscious treat that fits seamlessly into any active lifestyle.",
      "protein": 22,
      "calories": 200,
      "carbs": 18,
      "fat": 7,
      "fiber": 3,
      "sugar": 10,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "10",
      "cookTime": "25",
      "totalTime": "35",
      "difficulty": "Easy",
      "category": "Banana Bread",
      "tags": [
        "protein",
        "banana bread",
        "recipe",
        "simple"
      ],
      "methods": [
        "whey"
      ],
      "image": "protein-banana-bread-recipe.png",
      "ingredients": [
        "180g ripe bananas",
        "90g vanilla whey protein",
        "100g all-purpose flour",
        "1 large egg",
        "50ml milk",
        "40g brown sugar",
        "1.5 tsp baking powder",
        "0.5 tsp cinnamon"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 180°C (350°F). Grease a loaf pan."
        },
        {
          "step": "Mash Bananas",
          "text": "In a bowl, mash the bananas with a fork."
        },
        {
          "step": "Mix Ingredients",
          "text": "Add the egg, milk, and brown sugar to the bananas and mix well. In a separate bowl, combine the flour, protein powder, baking powder, and cinnamon. Add the dry ingredients to the wet and stir until just combined."
        },
        {
          "step": "Pour and Bake",
          "text": "Pour the batter into the loaf pan."
        },
        {
          "step": "Bake",
          "text": "Bake for 20-25 minutes, or until a skewer inserted into the center comes out clean."
        },
        {
          "step": "Cool",
          "text": "Let it cool before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread-recipe",
          "title": "Ultimate High-Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "coffee-infused-protein-waffles",
          "title": "Coffee-Infused Protein Waffles",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "savory-protein-oatmeal",
          "title": "Savory Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 4,
      "slug": "protein-powder-banana-bread",
      "title": "Banana Bread with Protein Powder",
      "description": "Enhance your banana bread with a scoop of protein powder for a 26g protein boost, making it the perfect guilt-free treat to fuel your day. Rich in satisfying texture, this bread boasts a moist, tender crumb with just the right balance of sweetness and banana flavor, complemented by a subtle protein-rich richness that keeps you full longer. Packed with wholesome ingredients, it offers a balanced macro profile—ideal for post-workout recovery or a nutritious snack on busy mornings. The dense yet fluffy texture makes each bite incredibly satisfying, while the natural sweetness of ripe bananas ensures a delightful, comforting taste. Whether enjoyed warm with a smear of almond butter or sliced and packed into your lunchbox, this bread is versatile and crave-worthy. It’s easy to customize—using gluten-free oats or vegan protein powder makes it suitable for various dietary needs. For best results, fold the protein powder gently into the batter to maintain a light texture, and avoid overmixing to prevent a dense loaf. Perfect for meal prep, this high-protein banana bread provides a delicious way to stay energized and on track with your health goals.",
      "protein": 26,
      "calories": 230,
      "carbs": 21,
      "fat": 8,
      "fiber": 3,
      "sugar": 11,
      "servingSize": "1 slice",
      "yield": "10 slices",
      "prepTime": "15",
      "cookTime": "30",
      "totalTime": "45",
      "difficulty": "Easy",
      "category": "Banana Bread",
      "tags": [
        "protein powder",
        "banana bread"
      ],
      "methods": [
        "plant-based"
      ],
      "image": "protein-powder-banana-bread.png",
      "ingredients": [
        "210g ripe bananas",
        "110g plant-based protein powder (vanilla)",
        "90g whole wheat flour",
        "2 large eggs",
        "70g maple syrup",
        "60ml almond milk",
        "1 tsp baking powder",
        "1/2 tsp nutmeg"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 350°F (175°C). Grease and flour a 9x5-inch loaf pan."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a large bowl, mash the ripe bananas. Stir in the eggs, maple syrup, and almond milk."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In another bowl, whisk together the protein powder, whole wheat flour, baking powder, and nutmeg."
        },
        {
          "step": "Combine Batters",
          "text": "Add the dry ingredients to the wet ingredients and stir until just moistened. Do not overmix."
        },
        {
          "step": "Bake",
          "text": "Pour the batter into the prepared loaf pan. Bake for 25-30 minutes, or until a wooden pick inserted into the center comes out clean."
        },
        {
          "step": "Cool",
          "text": "Cool in the pan for 10 minutes before removing to a wire rack to cool completely."
        }
      ],
      "related_recipes": [
        {
          "slug": "banana-bread-with-protein-powder-recipe",
          "title": "Easy Banana Bread with Protein Powder",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "red-velvet-protein-pancakes",
          "title": "Red Velvet Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "carrot-cake-protein-oatmeal",
          "title": "Carrot Cake Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 5,
      "slug": "high-protein-banana-bread-recipe",
      "title": "Ultimate High-Protein Banana Bread",
      "description": "This ultimate high-protein banana bread is a deliciously nutritious treat, offering an impressive 30 grams of protein per serving to fuel your day and support muscle recovery. Rich in wholesome ingredients like ripe bananas and protein-packed additions, it provides a satisfying balance of moist, tender crumb and a subtly sweet, banana flavor that melts in your mouth. The dense texture is complemented by a hint of natural sweetness, making it a perfect indulgence that aligns with your fitness goals. With its balanced macros—high in protein and moderate in healthy carbs and fats—it’s ideal for post-workout recovery or a nourishing on-the-go snack. You can enjoy this bread warm with a smear of almond butter or sliced fresh, or even use it as a portable breakfast for busy mornings. For those with dietary restrictions, it can easily be made gluten-free by using almond or coconut flour, and vegan options are simple by substituting plant-based protein powders and flax eggs. For best results, ensure your bananas are very ripe for maximum sweetness and moisture, and don’t overmix the batter to keep the bread light and tender. This versatile loaf is perfect for meal prep, allowing you to batch cook and have a high-protein snack ready to go anytime hunger strikes.",
      "protein": 30,
      "calories": 250,
      "carbs": 24,
      "fat": 9,
      "fiber": 5,
      "sugar": 7,
      "servingSize": "1 slice",
      "yield": "10 slices",
      "prepTime": "15",
      "cookTime": "35",
      "totalTime": "50",
      "difficulty": "Medium",
      "category": "Banana Bread",
      "tags": [
        "high protein",
        "banana bread",
        "recipe",
        "ultimate"
      ],
      "methods": [
        "whey",
        "casein"
      ],
      "image": "high-protein-banana-bread-recipe.png",
      "ingredients": [
        "250g ripe bananas",
        "80g whey protein isolate (unflavored)",
        "50g micellar casein (vanilla)",
        "60g almond flour",
        "40g coconut flour",
        "3 large eggs",
        "100g Greek yogurt",
        "50g erythritol or sweetener of choice",
        "2 tsp baking powder",
        "1 tsp cinnamon"
      ],
      "instructions": [
        {
          "step": "Preheat Oven & Prepare Pan",
          "text": "Preheat your oven to 350°F (175°C). Grease a loaf pan thoroughly."
        },
        {
          "step": "Combine Wet Ingredients",
          "text": "In a large bowl, mash the bananas. Whisk in the eggs and Greek yogurt until smooth."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a separate bowl, combine whey protein, casein, almond flour, coconut flour, sweetener, baking powder, and cinnamon."
        },
        {
          "step": "Mix Batter",
          "text": "Gently fold the dry ingredients into the wet ingredients until just combined. The batter will be thick."
        },
        {
          "step": "Bake to Perfection",
          "text": "Spread the batter into the prepared pan and bake for 30-35 minutes. Check for doneness with a toothpick."
        },
        {
          "step": "Cool and Enjoy",
          "text": "Let the bread cool in the pan for 15 minutes, then transfer to a wire rack to cool completely before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "coffee-infused-protein-waffles",
          "title": "Coffee-Infused Protein Waffles",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "strawberry-protein-oatmeal",
          "title": "Strawberry Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 6,
      "slug": "protein-pumpkin-bread",
      "title": "Healthy Protein Pumpkin Bread",
      "description": "This moist and delicious pumpkin bread delivers a satisfying protein punch of 24g per slice, making it an ideal choice for fueling your busy day or post-workout recovery. Packed with wholesome ingredients, it offers a balanced macro profile with healthy carbs and fiber to keep you energized, alongside lean protein to support muscle repair. The tender crumb boasts a rich pumpkin flavor complemented by warm spices, with a subtle sweetness that makes every bite irresistible. Its dense yet soft texture makes it perfect for enjoying as a wholesome snack or a nutritious breakfast alongside a cup of coffee or tea. For best results, use ripe pumpkin puree and measure your ingredients carefully to ensure optimal moisture and rise. This bread is versatile for meal prep, lasting well in the fridge for several days, and can be easily adapted to gluten-free or vegan diets with alternative flours and plant-based protein powders. Whether you’re looking for a satisfying treat after the gym or a healthy addition to your weekly meal plan, this pumpkin bread hits the spot while supporting your nutritional goals.",
      "protein": 24,
      "calories": 210,
      "carbs": 19,
      "fat": 7,
      "fiber": 4,
      "sugar": 8,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "15",
      "cookTime": "30",
      "totalTime": "45",
      "difficulty": "Easy",
      "category": "Quick Bread",
      "tags": [
        "protein",
        "pumpkin bread",
        "healthy"
      ],
      "methods": [
        "whey"
      ],
      "image": "protein-pumpkin-bread.png",
      "ingredients": [
        "240g pumpkin puree",
        "100g vanilla whey protein powder",
        "80g whole wheat flour",
        "2 large eggs",
        "60g maple syrup",
        "60ml almond milk",
        "1 tsp pumpkin pie spice",
        "1 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 350°F (175°C) and grease a loaf pan."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a large bowl, combine the pumpkin puree, eggs, maple syrup, and almond milk."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a separate bowl, whisk together the protein powder, whole wheat flour, pumpkin pie spice, and baking powder."
        },
        {
          "step": "Combine Batters",
          "text": "Add the dry ingredients to the wet ingredients and stir until just combined."
        },
        {
          "step": "Bake",
          "text": "Pour the batter into the prepared loaf pan and bake for 25-30 minutes."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool before slicing and serving."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-zucchini-bread",
          "title": "Delicious Protein Zucchini Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "healthy-protein-banana-bread",
          "title": "Healthy Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "birthday-cake-protein-waffles",
          "title": "Birthday Cake Protein Waffles",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "gluten-free-certified-oats-protein-oatmeal",
          "title": "Gluten-Free Certified Oats Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 7,
      "slug": "protein-zucchini-bread",
      "title": "Delicious Protein Zucchini Bread",
      "description": "This healthy and flavorful zucchini bread packs an impressive 20g of protein per serving, making it an ideal choice for fueling your active lifestyle. Rich in fiber and low in refined sugars, it offers a balanced macro profile that supports muscle recovery and sustained energy. The moist, tender crumb is complemented by the subtle sweetness of zucchini and a hint of warming spices, creating a comforting yet nutritious treat. Perfect as a post-workout snack or a satisfying breakfast, it’s great for meal prep and can be enjoyed throughout the week. For gluten-free options, simply swap out regular flour for almond or oat flour, and vegan adaptations can be achieved with plant-based protein powder and egg substitutes. To get the best results, be sure to grate the zucchini finely and squeeze out excess moisture to prevent sogginess, and don't overmix the batter to keep the bread light and airy. Whether you're aiming to boost your protein intake or indulge in a wholesome baked good, this zucchini bread is as nourishing as it is delicious.",
      "protein": 20,
      "calories": 190,
      "carbs": 16,
      "fat": 8,
      "fiber": 3,
      "sugar": 7,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "20",
      "cookTime": "35",
      "totalTime": "55",
      "difficulty": "Easy",
      "category": "Quick Bread",
      "tags": [
        "protein",
        "zucchini bread",
        "healthy"
      ],
      "methods": [
        "whey"
      ],
      "image": "protein-zucchini-bread.png",
      "ingredients": [
        "200g grated zucchini",
        "100g vanilla whey protein powder",
        "100g all-purpose flour",
        "2 large eggs",
        "80g honey",
        "60ml coconut oil, melted",
        "1 tsp cinnamon",
        "1/2 tsp baking soda",
        "1/2 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease and flour a 9x5-inch loaf pan."
        },
        {
          "step": "Prepare Zucchini",
          "text": "Squeeze the grated zucchini to remove excess moisture."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a large bowl, whisk together the eggs, honey, and melted coconut oil."
        },
        {
          "step": "Combine Ingredients",
          "text": "Stir in the grated zucchini. In a separate bowl, combine the protein powder, flour, cinnamon, baking soda, and baking powder. Add the dry ingredients to the wet and mix until just combined."
        },
        {
          "step": "Bake",
          "text": "Pour the batter into the prepared pan and bake for 30-35 minutes."
        },
        {
          "step": "Cool",
          "text": "Cool in the pan for 10 minutes before transferring to a wire rack."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-pumpkin-bread",
          "title": "Healthy Protein Pumpkin Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "healthy-protein-banana-bread",
          "title": "Healthy Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "gluten-free-buckwheat-protein-pancakes",
          "title": "Gluten-Free Buckwheat Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "dairy-free-coconut-milk-protein-oatmeal",
          "title": "Dairy-Free Coconut Milk Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 8,
      "slug": "protein-cloud-bread",
      "title": "Fluffy Protein Cloud Bread",
      "description": "This light and airy cloud bread is a perfect high-protein, low-carb snack that delivers approximately 15 grams of protein per serving, making it an excellent choice for muscle recovery and sustained energy. Its delicate, melt-in-your-mouth texture offers a satisfying combination of fluffiness and slight chew, with a subtly sweet and savory flavor that pairs well with both sweet spreads and savory toppings. Rich in protein and low in calories, it's an ideal option for those looking to boost their macros without sacrificing taste or texture. Enjoy this versatile bread as a post-workout treat, a quick breakfast, or as part of meal prep to keep your nutrition on track throughout the week. For gluten-free options, simply ensure that any flavorings or toppings are gluten-free, and vegans can substitute egg whites with aquafaba or other plant-based foams. To achieve the best rise and fluffiness, make sure your egg whites are whipped to stiff peaks and gently fold in any additional ingredients to avoid deflating the batter. This cloud bread is not only satisfying and protein-packed but also easy to customize with your favorite herbs, spices, or sweeteners for a personalized touch.",
      "protein": 15,
      "calories": 100,
      "carbs": 2,
      "fat": 4,
      "fiber": 0,
      "sugar": 1,
      "servingSize": "2 pieces",
      "yield": "10 pieces",
      "prepTime": "10",
      "cookTime": "20",
      "totalTime": "30",
      "difficulty": "Medium",
      "category": "Quick Bread",
      "tags": [
        "protein",
        "cloud bread",
        "low-carb"
      ],
      "methods": [
        "egg"
      ],
      "image": "protein-cloud-bread.png",
      "ingredients": [
        "3 large eggs, separated",
        "60g cream cheese, softened",
        "30g unflavored whey protein powder",
        "1/4 tsp cream of tartar"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 300°F (150°C)."
        },
        {
          "step": "Beat Egg Whites",
          "text": "In a clean bowl, beat the egg whites and cream of tartar until stiff peaks form."
        },
        {
          "step": "Mix Yolks and Cheese",
          "text": "In a separate bowl, mix the egg yolks, cream cheese, and protein powder until smooth."
        },
        {
          "step": "Fold Gently",
          "text": "Gently fold the yolk mixture into the egg whites until just combined, being careful not to deflate the whites."
        },
        {
          "step": "Form and Bake",
          "text": "Spoon the mixture onto a baking sheet lined with parchment paper, forming small circles. Bake for 15-20 minutes, or until golden brown."
        },
        {
          "step": "Cool",
          "text": "Let them cool on the baking sheet for a few minutes before transferring to a wire rack."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-pumpkin-bread",
          "title": "Healthy Protein Pumpkin Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "coffee-infused-protein-waffles",
          "title": "Coffee-Infused Protein Waffles",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "apple-cinnamon-protein-oatmeal",
          "title": "Apple Cinnamon Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 9,
      "slug": "protein-bread-recipe",
      "title": "Simple Protein Bread Recipe",
      "description": "This simple protein bread recipe offers a satisfying, hearty slice packed with 20 grams of muscle-nourishing protein per serving, making it an ideal choice for fueling your active lifestyle. With its soft, slightly chewy texture and a subtly nutty flavor, each bite delivers a comforting yet nutritious experience that’s perfect for breakfast, a post-workout boost, or anytime you need a wholesome snack. Its balanced macros—combining lean protein, healthy carbs, and minimal fats—support muscle recovery and sustained energy throughout the day. Whether you're meal prepping for the week or enjoying freshly baked bread with your favorite spreads, this recipe is versatile and easy to customize. For gluten-sensitive eaters, using gluten-free flour options ensures this bread fits your dietary needs, and vegan alternatives like plant-based protein powder can easily be incorporated. To achieve the best results, be sure to measure your ingredients precisely and avoid overmixing to keep the bread light and fluffy. This high-protein loaf is not only delicious but also a smart, nourishing addition to any balanced diet.",
      "protein": 20,
      "calories": 180,
      "carbs": 15,
      "fat": 6,
      "fiber": 3,
      "sugar": 4,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "10",
      "cookTime": "30",
      "totalTime": "40",
      "difficulty": "Easy",
      "category": "Quick Bread",
      "tags": [
        "protein bread",
        "recipe",
        "simple"
      ],
      "methods": [
        "whey"
      ],
      "image": "protein-bread-recipe.png",
      "ingredients": [
        "120g unflavored whey protein powder",
        "100g oat flour",
        "3 large eggs",
        "120ml milk",
        "1 tsp baking powder",
        "1/2 tsp salt"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease a loaf pan."
        },
        {
          "step": "Combine Ingredients",
          "text": "In a large bowl, mix all ingredients together until you have a smooth batter."
        },
        {
          "step": "Pour into Pan",
          "text": "Pour the batter into the prepared loaf pan."
        },
        {
          "step": "Bake",
          "text": "Bake for 25-30 minutes, or until a toothpick inserted into the center comes out clean."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool in the pan for 10 minutes before slicing."
        },
        {
          "step": "Serve",
          "text": "Enjoy your homemade protein bread!"
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread-recipe",
          "title": "Ultimate High-Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "chocolate-casein-pancakes",
          "title": "Chocolate Casein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "high-protein-baked-oatmeal",
          "title": "High Protein Baked Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 10,
      "slug": "high-protein-bread",
      "title": "Everyday High Protein Bread",
      "description": "This versatile high-protein bread is perfect for fueling your day, offering an impressive 25 grams of protein per slice to support muscle recovery and keep you energized. With its hearty texture and subtly nutty flavor, it makes for a satisfying base for sandwiches or a deliciously crispy toast—ideal for a quick breakfast or a post-workout snack. Packed with wholesome ingredients, it’s not only high in protein but also provides balanced macros to help you stay full longer and maintain lean muscle mass. Whether you're prepping meals for the week or enjoying a fresh slice after the gym, this bread adds both nutrition and flavor to your day. It’s naturally gluten-free when made with alternative flours, and vegan options can easily be incorporated with plant-based protein sources. For best results, ensure thorough mixing and proper baking time to achieve a perfect crust and soft interior. Keep it stored in an airtight container for freshness, and toast slightly before eating for an extra satisfying crunch. This bread is a fantastic go-to for health-conscious eaters seeking a delicious, high-protein option that supports active lifestyles.",
      "protein": 25,
      "calories": 200,
      "carbs": 12,
      "fat": 7,
      "fiber": 5,
      "sugar": 2,
      "servingSize": "1 slice",
      "yield": "10 slices",
      "prepTime": "15",
      "cookTime": "35",
      "totalTime": "50",
      "difficulty": "Easy",
      "category": "Sandwich Bread",
      "tags": [
        "high protein",
        "bread",
        "sandwich"
      ],
      "methods": [
        "vital wheat gluten"
      ],
      "image": "high-protein-bread.png",
      "ingredients": [
        "150g vital wheat gluten",
        "80g oat fiber",
        "50g flaxseed meal",
        "1 packet (7g) instant yeast",
        "240ml warm water",
        "30ml olive oil",
        "1 tsp salt"
      ],
      "instructions": [
        {
          "step": "Activate Yeast",
          "text": "In a small bowl, combine the warm water and yeast. Let it sit for 5 minutes until foamy."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a large bowl, whisk together the vital wheat gluten, oat fiber, flaxseed meal, and salt."
        },
        {
          "step": "Mix Dough",
          "text": "Add the yeast mixture and olive oil to the dry ingredients. Mix until a dough forms."
        },
        {
          "step": "Knead",
          "text": "Knead the dough on a lightly floured surface for 5-7 minutes, until it becomes elastic."
        },
        {
          "step": "Rise and Bake",
          "text": "Place the dough in a greased loaf pan, cover, and let it rise for 30 minutes. Bake at 375°F (190°C) for 25-30 minutes."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool completely before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread-recipe",
          "title": "Ultimate High-Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-pumpkin-bread",
          "title": "High Protein Pumpkin Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "gluten-free-buckwheat-protein-pancakes",
          "title": "Gluten-Free Buckwheat Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "maple-pecan-protein-oatmeal",
          "title": "Maple Pecan Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 11,
      "slug": "high-protein-pumpkin-bread",
      "title": "High Protein Pumpkin Bread",
      "description": "This delicious and moist pumpkin bread is a perfect guilt-free indulgence, delivering an impressive 26g of protein per slice to fuel your day. Rich in high-quality protein and wholesome ingredients, it offers a satisfying balance of macros that can support muscle recovery and keep you energized. The tender crumb is infused with warm pumpkin spices, creating a comforting aroma and a melt-in-your-mouth texture that’s both hearty and delicately sweet. Whether enjoyed as a post-workout snack, a nutritious breakfast, or a wholesome treat on the go, it’s versatile enough to fit into any meal plan. For added convenience, this bread makes excellent meal prep, staying fresh for several days when stored properly. It’s naturally gluten-free if you use almond or coconut flour, and vegan options are easy to achieve with plant-based protein powders and egg substitutes. For the best results, be sure to measure ingredients carefully and avoid overmixing to keep the bread light and fluffy. A slice of this pumpkin bread not only satisfies your taste buds but also helps you stay on track with your high-protein goals.",
      "protein": 26,
      "calories": 230,
      "carbs": 20,
      "fat": 9,
      "fiber": 5,
      "sugar": 8,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "15",
      "cookTime": "35",
      "totalTime": "50",
      "difficulty": "Easy",
      "category": "Quick Bread",
      "tags": [
        "high protein",
        "pumpkin bread"
      ],
      "methods": [
        "whey"
      ],
      "image": "high-protein-pumpkin-bread.png",
      "ingredients": [
        "250g pumpkin puree",
        "120g vanilla whey protein powder",
        "70g almond flour",
        "3 large eggs",
        "50g coconut sugar",
        "50ml melted coconut oil",
        "1.5 tsp pumpkin pie spice",
        "1 tsp baking soda"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 350°F (175°C). Grease and flour a loaf pan."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a large bowl, whisk together the pumpkin puree, eggs, coconut sugar, and melted coconut oil."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a separate bowl, combine the whey protein powder, almond flour, pumpkin pie spice, and baking soda."
        },
        {
          "step": "Create Batter",
          "text": "Add the dry ingredients to the wet ingredients and mix until just combined. Do not overmix."
        },
        {
          "step": "Bake",
          "text": "Pour the batter into the prepared loaf pan and bake for 30-35 minutes, or until a toothpick inserted into the center comes out clean."
        },
        {
          "step": "Cool Down",
          "text": "Let the bread cool in the pan for 10 minutes before transferring to a wire rack to cool completely."
        }
      ],
      "related_recipes": [
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread-recipe",
          "title": "Ultimate High-Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-pumpkin-bread",
          "title": "Healthy Protein Pumpkin Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "classic-whey-protein-pancakes",
          "title": "Classic Whey Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "high-protein-baked-oatmeal",
          "title": "High Protein Baked Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 12,
      "slug": "protein-bagels",
      "title": "Simple Protein Bagels",
      "description": "These easy-to-make protein bagels pack an impressive 18 grams of muscle-supporting protein per serving, making them an ideal choice for a satisfying breakfast or post-workout fuel. Their dense, chewy texture offers a delightful contrast to the crispy crust, while a subtle hint of salt and a touch of sweetness create a perfectly balanced flavor profile that pairs wonderfully with cream cheese, smoked salmon, or your favorite spreads. With just 160 calories per bagel, they're a guilt-free indulgence that keeps you energized throughout the day. Perfect for meal prep, you can bake a batch ahead of time and enjoy warm or toasted on busy mornings. For those with dietary preferences, gluten-free flours can be substituted to make a gluten-free version, and vegan options are easily achieved by using plant-based protein powders and dairy-free toppings. To ensure the best rise and texture, be precise with your measurements and avoid overmixing the dough. Serve these bagels fresh or store them in an airtight container for up to a few days—reheat briefly for that just-baked feel and flavor every time.",
      "protein": 18,
      "calories": 160,
      "carbs": 15,
      "fat": 3,
      "fiber": 2,
      "sugar": 2,
      "servingSize": "1 bagel",
      "yield": "8 bagels",
      "prepTime": "15",
      "cookTime": "20",
      "totalTime": "35",
      "difficulty": "Medium",
      "category": "Bagel",
      "tags": [
        "protein",
        "bagels",
        "simple"
      ],
      "methods": [
        "greek yogurt"
      ],
      "image": "protein-bagels.png",
      "ingredients": [
        "150g all-purpose flour",
        "100g plain non-fat Greek yogurt",
        "50g unflavored whey protein powder",
        "2 tsp baking powder",
        "1/2 tsp salt",
        "1 egg white, beaten (for brushing)",
        "Everything bagel seasoning (optional)"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 375°F (190°C)."
        },
        {
          "step": "Make the Dough",
          "text": "In a bowl, mix together the flour, Greek yogurt, protein powder, baking powder, and salt until a dough forms."
        },
        {
          "step": "Knead and Shape",
          "text": "Knead the dough on a floured surface for a few minutes. Divide the dough into 8 equal pieces and roll each piece into a rope. Join the ends to form a bagel shape."
        },
        {
          "step": "Prepare for Baking",
          "text": "Place the bagels on a baking sheet lined with parchment paper. Brush the tops with the beaten egg white and sprinkle with seasoning, if desired."
        },
        {
          "step": "Bake",
          "text": "Bake for 15-20 minutes, or until golden brown."
        },
        {
          "step": "Cool",
          "text": "Let the bagels cool on a wire rack."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "cinnamon-raisin-protein-bagels",
          "title": "Cinnamon Raisin Protein Bagels",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "dairy-free-banana-oat-protein-pancakes",
          "title": "Dairy-Free Banana Oat Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "coffee-protein-oatmeal",
          "title": "Coffee Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 13,
      "slug": "savory-herb-protein-bread",
      "title": "Savory Herb Protein Bread",
      "description": "This savory herb protein bread offers a satisfying combination of flavor and nutrition, delivering an impressive 22g of protein per slice to fuel your day. Packed with wholesome ingredients, it’s an excellent choice for supporting muscle recovery post-workout or as a hearty addition to any meal. The bread boasts a tender yet slightly chewy texture, with fragrant herbs that infuse each bite with aromatic complexity, making it perfect for pairing with eggs, avocado, or your favorite spreads. Its rich, savory flavor makes it a versatile staple—ideal for meal prep, snacks, or even a quick lunch. With approximately 190 calories per slice, it’s a smart option for those mindful of their macros, providing ample protein without excess carbs or fat. For gluten-free needs, simply substitute traditional flour with a gluten-free blend, and vegan versions can be made using plant-based protein sources and dairy-free alternatives. To achieve the best texture, avoid overmixing the batter and bake until golden brown for a crisp crust. Enjoy this bread fresh from the oven or toasted to bring out its full flavor and aroma—perfect for any time of day when you crave a savory, protein-packed treat.",
      "protein": 22,
      "calories": 190,
      "carbs": 14,
      "fat": 7,
      "fiber": 4,
      "sugar": 3,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "15",
      "cookTime": "30",
      "totalTime": "45",
      "difficulty": "Easy",
      "category": "Savory Bread",
      "tags": [
        "savory",
        "herb",
        "protein bread"
      ],
      "methods": [
        "whey"
      ],
      "image": "savory-herb-protein-bread.png",
      "ingredients": [
        "120g unflavored whey protein powder",
        "100g almond flour",
        "3 large eggs",
        "120ml unsweetened almond milk",
        "30g grated Parmesan cheese",
        "1 tbsp chopped fresh rosemary",
        "1 tsp garlic powder",
        "1 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease a loaf pan."
        },
        {
          "step": "Combine Ingredients",
          "text": "In a large bowl, whisk together all the ingredients until well combined."
        },
        {
          "step": "Pour Batter",
          "text": "Pour the batter into the prepared loaf pan and smooth the top."
        },
        {
          "step": "Bake",
          "text": "Bake for 25-30 minutes, or until the top is golden and a toothpick inserted into the center comes out clean."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool in the pan for 10 minutes before transferring to a wire rack."
        },
        {
          "step": "Serve",
          "text": "Slice and enjoy this savory protein bread."
        }
      ],
      "related_recipes": [
        {
          "slug": "cheese-and-chive-protein-bread",
          "title": "Cheese and Chive Protein Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-bread-recipe",
          "title": "Simple Protein Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "cinnamon-swirl-protein-bread",
          "title": "Cinnamon Swirl Protein Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "classic-whey-protein-pancakes",
          "title": "Classic Whey Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "protein-oatmeal-recipe",
          "title": "Protein Oatmeal Recipe",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 14,
      "slug": "cinnamon-swirl-protein-bread",
      "title": "Cinnamon Swirl Protein Bread",
      "description": "This sweet and delicious cinnamon swirl bread packs a satisfying 20 grams of protein per serving, making it a perfect choice for fueling your day or recovering after a workout. Its soft, tender crumb is infused with warm cinnamon and a sweet swirl that creates a delightful contrast in both texture and flavor—crispy edges give way to moist, fluffy interior with each bite. The rich, comforting aroma of cinnamon hints at the cozy, indulgent taste, while the balanced macros support muscle repair and sustained energy. Ideal for meal prep, enjoy this bread toasted with a smear of almond butter or alongside your morning coffee, or slice it up for a nutritious snack on-the-go. For those with dietary preferences, this recipe can easily be made gluten-free using a gluten-free flour blend, and vegan versions can be achieved with plant-based protein sources and dairy-free milk. For best results, ensure the dough is well-kneaded to develop the gluten structure, and don’t overbake—just until golden—to keep it moist and tender. Whether you’re looking to satisfy a sweet craving or add a high-protein option to your meal lineup, this cinnamon swirl bread is a versatile and tasty choice that supports your fitness goals without compromising on flavor.",
      "protein": 20,
      "calories": 200,
      "carbs": 18,
      "fat": 8,
      "fiber": 3,
      "sugar": 9,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "20",
      "cookTime": "30",
      "totalTime": "50",
      "difficulty": "Medium",
      "category": "Sweet Bread",
      "tags": [
        "cinnamon swirl",
        "protein bread",
        "sweet"
      ],
      "methods": [
        "whey"
      ],
      "image": "cinnamon-swirl-protein-bread.png",
      "ingredients": [
        "120g vanilla whey protein powder",
        "100g oat flour",
        "3 large eggs",
        "120ml milk",
        "60g sweetener (e.g., erythritol)",
        "1 tsp baking powder",
        "For the swirl: 2 tbsp cinnamon, 2 tbsp sweetener"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease a loaf pan."
        },
        {
          "step": "Prepare Batter",
          "text": "In a large bowl, mix together the protein powder, oat flour, eggs, milk, sweetener, and baking powder."
        },
        {
          "step": "Create Swirl",
          "text": "In a small bowl, mix the cinnamon and sweetener for the swirl."
        },
        {
          "step": "Layer and Swirl",
          "text": "Pour half of the batter into the loaf pan. Sprinkle the cinnamon mixture over the top. Pour the remaining batter over the cinnamon layer. Use a knife to gently swirl the layers."
        },
        {
          "step": "Bake",
          "text": "Bake for 25-30 minutes, until a toothpick comes out clean."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "lemon-blueberry-protein-bread",
          "title": "Lemon Blueberry Protein Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-bread-recipe",
          "title": "Simple Protein Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "savory-herb-protein-bread",
          "title": "Savory Herb Protein Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "lemon-poppy-seed-protein-pancakes",
          "title": "Lemon Poppy Seed Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "blueberry-protein-oatmeal",
          "title": "Blueberry Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 15,
      "slug": "whole-wheat-protein-sandwich-bread",
      "title": "Whole Wheat Protein Sandwich Bread",
      "description": "This hearty and healthy whole wheat sandwich bread delivers an impressive 18 grams of protein per slice, making it an ideal choice for fueling your active lifestyle and supporting muscle recovery. Rich in fiber and complex carbs, it provides sustained energy and promotes digestive health, while its soft, chewy texture and warm, nutty flavor make every bite truly satisfying. Perfect for post-workout meals, meal prepping, or a wholesome sandwich boost, this bread keeps well in the fridge and can be sliced fresh for sandwiches, toast, or even breakfast wraps. For those with gluten sensitivities, consider using gluten-free whole wheat alternatives or adding vital wheat gluten to enhance the texture, while vegans can substitute eggs with flaxseed or chia seed egg replacements without sacrificing protein content. To achieve the best rise and a light, airy crumb, ensure your yeast is fresh and proof it properly before mixing. For added flavor, sprinkle some seeds or herbs on top before baking, and store in an airtight container to maintain freshness. Whether enjoyed as a hearty sandwich or toasted with your favorite toppings, this bread offers a nutritious, high-protein foundation for any meal.",
      "protein": 18,
      "calories": 170,
      "carbs": 16,
      "fat": 5,
      "fiber": 4,
      "sugar": 3,
      "servingSize": "1 slice",
      "yield": "14 slices",
      "prepTime": "20",
      "cookTime": "35",
      "totalTime": "55",
      "difficulty": "Easy",
      "category": "Sandwich Bread",
      "tags": [
        "whole wheat",
        "protein",
        "sandwich bread"
      ],
      "methods": [
        "vital wheat gluten"
      ],
      "image": "whole-wheat-protein-sandwich-bread.png",
      "ingredients": [
        "200g whole wheat flour",
        "100g vital wheat gluten",
        "50g unflavored whey protein",
        "1 packet (7g) instant yeast",
        "300ml warm water",
        "30ml honey",
        "30ml olive oil",
        "1 tsp salt"
      ],
      "instructions": [
        {
          "step": "Activate Yeast",
          "text": "In a bowl, combine warm water, honey, and yeast. Let it sit for 5-10 minutes until foamy."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a large bowl, whisk together the whole wheat flour, vital wheat gluten, whey protein, and salt."
        },
        {
          "step": "Mix Dough",
          "text": "Pour the wet ingredients into the dry ingredients and add the olive oil. Mix until a shaggy dough forms."
        },
        {
          "step": "Knead and Rise",
          "text": "Knead the dough for 5-7 minutes on a floured surface. Place in a greased bowl, cover, and let it rise for 1 hour."
        },
        {
          "step": "Shape and Bake",
          "text": "Punch down the dough, shape it into a loaf, and place it in a greased loaf pan. Let it rise for another 30 minutes. Bake at 375°F (190°C) for 30-35 minutes."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool completely before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "multigrain-protein-sandwich-bread",
          "title": "Multigrain Protein Sandwich Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "blueberry-vegan-protein-pancakes",
          "title": "Blueberry Vegan Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "peanut-butter-protein-oatmeal",
          "title": "Peanut Butter Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 16,
      "slug": "healthy-protein-banana-bread",
      "title": "Healthy Protein Banana Bread",
      "description": "This guilt-free and delicious banana bread packs an impressive 22g of protein per slice, making it an ideal choice for fueling your day or recovering after a tough workout. Rich in wholesome ingredients, it offers a moist, tender crumb with a subtly sweet banana flavor complemented by hints of vanilla and a hint of nuttiness, perfect for satisfying your cravings without the guilt. The high protein content helps support muscle repair and keeps you feeling fuller longer, making it a fantastic addition to your meal prep routine or a nutritious snack on busy days. Its soft, dense texture makes each bite incredibly satisfying, while the natural sweetness of ripe bananas balances out the richness from added protein sources like Greek yogurt or protein powder. For best results, use very ripe bananas for maximum flavor, and consider adding a handful of nuts or dark chocolate chips for extra texture and indulgence. This bread is versatile enough to be enjoyed as a quick breakfast, post-workout treat, or even as a healthy dessert. Plus, it’s easily adaptable for gluten-free diets by substituting almond or coconut flour, and vegan options can be made by using plant-based protein and non-dairy alternatives. Whether you're aiming to boost your protein intake or simply indulge in a nourishing, flavorful treat, this banana bread is sure to become a staple in your healthy eating arsenal.",
      "protein": 22,
      "calories": 200,
      "carbs": 20,
      "fat": 7,
      "fiber": 4,
      "sugar": 9,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "15",
      "cookTime": "30",
      "totalTime": "45",
      "difficulty": "Easy",
      "category": "Banana Bread",
      "tags": [
        "healthy",
        "protein",
        "banana bread"
      ],
      "methods": [
        "whey"
      ],
      "image": "healthy-protein-banana-bread.png",
      "ingredients": [
        "200g ripe bananas",
        "100g vanilla whey protein powder",
        "80g oat flour",
        "2 large eggs",
        "60g unsweetened applesauce",
        "30g honey",
        "1 tsp baking powder",
        "1/2 tsp cinnamon"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 350°F (175°C) and grease a loaf pan."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a large bowl, mash the bananas. Whisk in the eggs, applesauce, and honey."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a separate bowl, mix together the protein powder, oat flour, baking powder, and cinnamon."
        },
        {
          "step": "Combine Batters",
          "text": "Pour the dry ingredients into the wet ingredients and stir until just combined."
        },
        {
          "step": "Bake",
          "text": "Pour the batter into the prepared loaf pan and bake for 25-30 minutes."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-pumpkin-bread",
          "title": "Healthy Protein Pumpkin Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "samoa-inspired-protein-pancakes",
          "title": "Samoa-Inspired Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "protein-baked-oatmeal",
          "title": "Protein Baked Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 17,
      "slug": "banana-bread-with-protein-powder-recipe",
      "title": "Easy Banana Bread with Protein Powder",
      "description": "This simple banana bread recipe is not only delicious but also packed with a substantial 24 grams of protein per serving, making it an ideal choice for fueling your day or supporting muscle recovery. The moist, tender crumb is infused with the rich sweetness of ripe bananas, balanced by a subtle hint of vanilla, while the added protein powder creates a satisfying, slightly chewy texture that keeps you full longer. With just 220 calories per slice, it’s a nutritious treat perfect for post-workout refueling or a wholesome snack on busy mornings. For those with dietary preferences, this bread can easily be made gluten-free by using a gluten-free flour blend, and vegan options are simple with plant-based protein powders and flax eggs. To get the best rise and texture, be sure to measure your ingredients carefully and avoid overmixing the batter. Enjoy it warm with a smear of nut butter or Greek yogurt, or slice and store for quick grab-and-go breakfasts throughout the week. Whether you’re looking to boost your protein intake or satisfy a sweet craving healthfully, this banana bread hits all the right notes.",
      "protein": 24,
      "calories": 220,
      "carbs": 22,
      "fat": 8,
      "fiber": 3,
      "sugar": 10,
      "servingSize": "1 slice",
      "yield": "10 slices",
      "prepTime": "10",
      "cookTime": "30",
      "totalTime": "40",
      "difficulty": "Easy",
      "category": "Banana Bread",
      "tags": [
        "banana bread",
        "protein powder",
        "easy"
      ],
      "methods": [
        "whey"
      ],
      "image": "banana-bread-with-protein-powder-recipe.png",
      "ingredients": [
        "220g ripe bananas",
        "120g vanilla whey protein powder",
        "100g all-purpose flour",
        "2 eggs",
        "50ml milk",
        "40g brown sugar",
        "1 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease a loaf pan."
        },
        {
          "step": "Mix Ingredients",
          "text": "In a bowl, mash the bananas. Add the eggs, milk, and sugar and mix. In a separate bowl, combine the flour and protein powder. Add the dry ingredients to the wet and stir until combined."
        },
        {
          "step": "Pour and Bake",
          "text": "Pour the batter into the loaf pan."
        },
        {
          "step": "Bake",
          "text": "Bake for 25-30 minutes."
        },
        {
          "step": "Cool",
          "text": "Let it cool before slicing."
        },
        {
          "step": "Enjoy",
          "text": "Enjoy your protein-packed banana bread!"
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-powder-banana-bread",
          "title": "Banana Bread with Protein Powder",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "savory-herb-and-cheese-pancakes",
          "title": "Savory Herb and Cheese Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "coconut-protein-oatmeal",
          "title": "Coconut Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 18,
      "slug": "chocolate-chip-protein-zucchini-bread",
      "title": "Chocolate Chip Protein Zucchini Bread",
      "description": "This delicious zucchini bread is packed with 22 grams of high-quality protein per serving, making it an ideal choice for fueling your active lifestyle and supporting muscle recovery. Its moist, tender crumb is perfectly complemented by pockets of rich chocolate chips, offering a harmonious balance of sweetness and subtle earthiness from the zucchini. The texture is soft yet hearty, providing a satisfying bite that feels indulgent without the guilt. With its wholesome ingredients and protein boost, this bread is perfect as a post-workout snack, a nutritious breakfast, or a convenient meal prep option to keep on hand throughout the week. For those with dietary preferences, it's easily adaptable—gluten-free with almond or coconut flour, or vegan by swapping eggs for flaxseed or chia seed eggs, and dairy-free chocolate chips. To achieve the best results, be sure to squeeze out excess moisture from the zucchini before mixing, and don't overmix the batter to keep the bread light and fluffy. Enjoy slices warm from the oven or toasted with a spread of nut butter for an extra satisfying treat. Whether you're looking to increase your protein intake or simply craving a delicious, healthful baked good, this zucchini bread hits all the right notes.",
      "protein": 22,
      "calories": 210,
      "carbs": 18,
      "fat": 9,
      "fiber": 4,
      "sugar": 9,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "20",
      "cookTime": "35",
      "totalTime": "55",
      "difficulty": "Easy",
      "category": "Quick Bread",
      "tags": [
        "chocolate chip",
        "protein",
        "zucchini bread"
      ],
      "methods": [
        "whey"
      ],
      "image": "chocolate-chip-protein-zucchini-bread.png",
      "ingredients": [
        "200g grated zucchini",
        "100g chocolate whey protein powder",
        "100g all-purpose flour",
        "2 large eggs",
        "80g honey",
        "60ml coconut oil, melted",
        "50g chocolate chips",
        "1 tsp cinnamon",
        "1/2 tsp baking soda",
        "1/2 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease and flour a 9x5-inch loaf pan."
        },
        {
          "step": "Prepare Zucchini",
          "text": "Squeeze the grated zucchini to remove excess moisture."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "In a large bowl, whisk together the eggs, honey, and melted coconut oil."
        },
        {
          "step": "Combine Ingredients",
          "text": "Stir in the grated zucchini. In a separate bowl, combine the protein powder, flour, cinnamon, baking soda, and baking powder. Add the dry ingredients to the wet and mix until just combined. Fold in the chocolate chips."
        },
        {
          "step": "Bake",
          "text": "Pour the batter into the prepared pan and bake for 30-35 minutes."
        },
        {
          "step": "Cool",
          "text": "Cool in the pan for 10 minutes before transferring to a wire rack."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-zucchini-bread",
          "title": "Delicious Protein Zucchini Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "chocolate-chip-protein-banana-bread",
          "title": "Chocolate Chip Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "german-chocolate-protein-pancakes",
          "title": "German Chocolate Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "high-protein-baked-oatmeal",
          "title": "High Protein Baked Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 19,
      "slug": "cinnamon-raisin-protein-bagels",
      "title": "Cinnamon Raisin Protein Bagels",
      "description": "Indulge in these sweet and chewy cinnamon raisin bagels, each boasting a hearty 20 grams of protein to fuel your day. Packed with wholesome ingredients, they offer a balanced macro profile—perfect for supporting muscle recovery, sustained energy, and overall wellness. The tender, dense texture combines a satisfying chew with bursts of sweet cinnamon and juicy raisins, creating a delightful contrast that makes each bite irresistibly flavorful. Whether enjoyed as a energizing breakfast, post-workout treat, or a nutritious snack, these bagels are versatile and satisfying. They’re especially great for meal prep, allowing you to have a protein-rich option on hand throughout the week. For gluten-free or vegan adaptations, simply swap in gluten-free flours or vegan binders like flaxseed meal—these tweaks will still deliver a delicious, nutrient-dense result. For best results, ensure your dough is well-kneaded for a smooth, elastic consistency, and consider toasting them lightly before serving to enhance their aroma and texture. Enjoy them plain or spread with nut butter or Greek yogurt for added flavor and creaminess.",
      "protein": 20,
      "calories": 180,
      "carbs": 20,
      "fat": 3,
      "fiber": 3,
      "sugar": 6,
      "servingSize": "1 bagel",
      "yield": "8 bagels",
      "prepTime": "15",
      "cookTime": "20",
      "totalTime": "35",
      "difficulty": "Medium",
      "category": "Bagel",
      "tags": [
        "cinnamon raisin",
        "protein",
        "bagels"
      ],
      "methods": [
        "greek yogurt"
      ],
      "image": "cinnamon-raisin-protein-bagels.png",
      "ingredients": [
        "150g all-purpose flour",
        "100g plain non-fat Greek yogurt",
        "50g vanilla whey protein powder",
        "30g raisins",
        "2 tsp baking powder",
        "1 tsp cinnamon",
        "1/2 tsp salt",
        "1 egg white, beaten"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 375°F (190°C)."
        },
        {
          "step": "Make the Dough",
          "text": "In a bowl, mix together the flour, Greek yogurt, protein powder, baking powder, cinnamon, and salt. Fold in the raisins."
        },
        {
          "step": "Knead and Shape",
          "text": "Knead the dough on a floured surface. Divide into 8 pieces and shape into bagels."
        },
        {
          "step": "Prepare for Baking",
          "text": "Place the bagels on a baking sheet lined with parchment paper and brush with the beaten egg white."
        },
        {
          "step": "Bake",
          "text": "Bake for 15-20 minutes, or until golden brown."
        },
        {
          "step": "Cool",
          "text": "Let the bagels cool on a wire rack."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-bagels",
          "title": "Simple Protein Bagels",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "pumpkin-spice-protein-waffles",
          "title": "Pumpkin Spice Protein Waffles",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "overnight-protein-oats",
          "title": "Overnight Protein Oats",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 20,
      "slug": "cheese-and-chive-protein-bread",
      "title": "Cheese and Chive Protein Bread",
      "description": "This savory and cheesy bread with fresh chives offers a satisfying combination of flavors and textures that will elevate any meal. Packed with 24 grams of protein per serving, it's an excellent choice for supporting muscle recovery and keeping you energized throughout the day. The bread boasts a tender, moist crumb with a golden, slightly crispy crust, while the melty cheese and fragrant chives provide bursts of savory richness with every bite. Its robust flavor makes it perfect for enjoying alongside salads, soups, or as a standalone snack after a workout to replenish your energy levels. Whether you're meal prepping for the week or looking for a high-protein option to satisfy your cravings, this bread fits seamlessly into a balanced diet—it's naturally gluten-free if you opt for a gluten-free flour blend, and vegan versions can be created with plant-based cheese and egg substitutes. For best results, use fresh chives and ensure your cheese is well incorporated to achieve an even distribution of flavor. Serve it warm for maximum gooeyness or let it cool for a firmer texture—either way, it’s sure to become a favorite in your healthy recipe repertoire.",
      "protein": 24,
      "calories": 220,
      "carbs": 12,
      "fat": 11,
      "fiber": 4,
      "sugar": 2,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "15",
      "cookTime": "30",
      "totalTime": "45",
      "difficulty": "Easy",
      "category": "Savory Bread",
      "tags": [
        "cheese",
        "chive",
        "protein bread",
        "savory"
      ],
      "methods": [
        "whey"
      ],
      "image": "cheese-and-chive-protein-bread.png",
      "ingredients": [
        "120g unflavored whey protein powder",
        "100g almond flour",
        "50g grated cheddar cheese",
        "3 large eggs",
        "120ml unsweetened almond milk",
        "2 tbsp chopped fresh chives",
        "1 tsp garlic powder",
        "1 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease a loaf pan."
        },
        {
          "step": "Combine Ingredients",
          "text": "In a large bowl, whisk together all the ingredients until well combined."
        },
        {
          "step": "Pour Batter",
          "text": "Pour the batter into the prepared loaf pan."
        },
        {
          "step": "Bake",
          "text": "Bake for 25-30 minutes, until golden and cooked through."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool before slicing."
        },
        {
          "step": "Serve",
          "text": "Enjoy this delicious savory bread."
        }
      ],
      "related_recipes": [
        {
          "slug": "savory-herb-protein-bread",
          "title": "Savory Herb Protein Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-bread-recipe",
          "title": "Simple Protein Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "cinnamon-swirl-protein-bread",
          "title": "Cinnamon Swirl Protein Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "chocolate-chip-protein-pancakes",
          "title": "Chocolate Chip Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "protein-oatmeal-recipe",
          "title": "Protein Oatmeal Recipe",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 21,
      "slug": "lemon-blueberry-protein-bread",
      "title": "Lemon Blueberry Protein Bread",
      "description": "This refreshing and sweet lemon blueberry bread packs a satisfying 20g of protein per serving, making it an ideal choice for fueling your day or post-workout recovery. With its tender, moist crumb infused with zesty lemon and bursting blueberries, each bite offers a delightful balance of tartness and sweetness, complemented by a subtle hint of natural sweetness from wholesome ingredients. The combination of flavors creates a light yet hearty treat that keeps you energized and satisfied. Perfect for meal prep, it can be enjoyed as a quick breakfast, a midday snack, or an afternoon pick-me-up, especially when paired with a cup of tea or coffee. This bread is naturally gluten-free if made with almond or coconut flour, and vegan adaptations are simple by substituting eggs with flaxseed or chia seed gel. For best results, gently fold the blueberries into the batter to prevent them from sinking and avoid overmixing to keep the bread tender. Whether you're looking to boost your protein intake or indulge in a guilt-free sweet treat, this lemon blueberry bread is sure to become a favorite in your healthy eating arsenal.",
      "protein": 20,
      "calories": 190,
      "carbs": 18,
      "fat": 7,
      "fiber": 3,
      "sugar": 9,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "15",
      "cookTime": "30",
      "totalTime": "45",
      "difficulty": "Easy",
      "category": "Sweet Bread",
      "tags": [
        "lemon",
        "blueberry",
        "protein bread",
        "sweet"
      ],
      "methods": [
        "whey"
      ],
      "image": "lemon-blueberry-protein-bread.png",
      "ingredients": [
        "120g vanilla whey protein powder",
        "100g oat flour",
        "100g fresh or frozen blueberries",
        "3 large eggs",
        "120ml milk",
        "60g sweetener",
        "1 lemon, zested and juiced",
        "1 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease a loaf pan."
        },
        {
          "step": "Prepare Batter",
          "text": "In a large bowl, mix together the protein powder, oat flour, eggs, milk, sweetener, lemon zest, and lemon juice."
        },
        {
          "step": "Add Blueberries",
          "text": "Gently fold in the blueberries."
        },
        {
          "step": "Pour and Bake",
          "text": "Pour the batter into the loaf pan and bake for 25-30 minutes."
        },
        {
          "step": "Cool",
          "text": "Let the bread cool before slicing."
        },
        {
          "step": "Enjoy",
          "text": "A sweet and zesty protein treat."
        }
      ],
      "related_recipes": [
        {
          "slug": "cinnamon-swirl-protein-bread",
          "title": "Cinnamon Swirl Protein Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-bread-recipe",
          "title": "Simple Protein Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "savory-herb-protein-bread",
          "title": "Savory Herb Protein Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "savory-spinach-and-feta-protein-crepes",
          "title": "Savory Spinach and Feta Protein Crepes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "pumpkin-protein-oatmeal",
          "title": "Pumpkin Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 22,
      "slug": "multigrain-protein-sandwich-bread",
      "title": "Multigrain Protein Sandwich Bread",
      "description": "This healthy and hearty multigrain sandwich bread offers an impressive 20g of protein per slice, making it an excellent choice for fueling your active lifestyle and supporting muscle recovery. Packed with a blend of wholesome grains and seeds, its dense yet tender crumb delivers a satisfying bite with subtle nutty flavors and a lightly toasted aroma. The bread's rich texture holds up perfectly to hearty fillings like lean meats, avocado, or nut butters, while its balanced macros make it an ideal option for balanced meals or post-workout refueling. With only 180 calories per slice, it's a guilt-free way to enjoy your favorite sandwiches without sacrificing nutrition. For best results, use high-quality, fresh ingredients and ensure thorough mixing to achieve an even rise and texture. This bread is naturally gluten-free if made with gluten-free grains, and vegan adaptations are easy by swapping out eggs for flaxseed meal or aquafaba. It’s perfect for meal prepping ahead of busy weeks or enjoying fresh for breakfast, lunch, or an afternoon snack—just toast lightly for added crunch and flavor.",
      "protein": 20,
      "calories": 180,
      "carbs": 18,
      "fat": 6,
      "fiber": 5,
      "sugar": 3,
      "servingSize": "1 slice",
      "yield": "14 slices",
      "prepTime": "20",
      "cookTime": "35",
      "totalTime": "55",
      "difficulty": "Easy",
      "category": "Sandwich Bread",
      "tags": [
        "multigrain",
        "protein",
        "sandwich bread"
      ],
      "methods": [
        "vital wheat gluten"
      ],
      "image": "multigrain-protein-sandwich-bread.png",
      "ingredients": [
        "150g whole wheat flour",
        "100g vital wheat gluten",
        "50g mixed seeds (sunflower, pumpkin, flax)",
        "50g unflavored whey protein",
        "1 packet (7g) instant yeast",
        "300ml warm water",
        "30ml molasses",
        "30ml olive oil",
        "1 tsp salt"
      ],
      "instructions": [
        {
          "step": "Activate Yeast",
          "text": "Combine warm water, molasses, and yeast. Let sit for 5-10 minutes."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a large bowl, whisk together the flours, gluten, seeds, protein, and salt."
        },
        {
          "step": "Mix Dough",
          "text": "Pour the wet ingredients and olive oil into the dry and mix to form a dough."
        },
        {
          "step": "Knead and Rise",
          "text": "Knead for 5-7 minutes. Let rise in a covered, greased bowl for 1 hour."
        },
        {
          "step": "Shape and Bake",
          "text": "Shape into a loaf, place in a greased pan, and let rise for 30 minutes. Bake at 375°F (190°C) for 30-35 minutes."
        },
        {
          "step": "Cool",
          "text": "Cool completely before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "whole-wheat-protein-sandwich-bread",
          "title": "Whole Wheat Protein Sandwich Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "double-chocolate-protein-waffles",
          "title": "Double Chocolate Protein Waffles",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "mixed-berry-protein-oatmeal",
          "title": "Mixed Berry Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 23,
      "slug": "chocolate-chip-protein-banana-bread",
      "title": "Chocolate Chip Protein Banana Bread",
      "description": "This decadent chocolate chip banana bread packs an impressive 23 grams of protein per serving, making it an ideal choice for fueling your day or recovering after a tough workout. The moist, tender crumb is enriched with ripe bananas, delivering natural sweetness and a subtle fruity flavor that pairs perfectly with melty chocolate chips. Each bite offers a harmonious balance of rich chocolate and banana, with a satisfying texture that’s both dense and tender, making it incredibly moreish. With its high protein content and moderate calories, this bread is perfect for meal prep, snacks, or a nutritious breakfast that keeps you energized and full longer. It’s naturally gluten-free if made with almond or coconut flour, and vegan-friendly options are easy to adapt with plant-based protein and dairy-free chocolate. For best results, use very ripe bananas for maximum flavor and moisture, and gently fold in the chocolate chips to keep them evenly distributed. Toasted slightly before serving enhances the flavor and adds a delightful crunch on the outside, making every bite even more enjoyable. Whether you’re looking to boost your macros or indulge in a healthier treat, this banana bread is a delicious way to satisfy your sweet tooth without compromising your fitness goals.",
      "protein": 23,
      "calories": 240,
      "carbs": 25,
      "fat": 9,
      "fiber": 4,
      "sugar": 12,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "15",
      "cookTime": "30",
      "totalTime": "45",
      "difficulty": "Easy",
      "category": "Banana Bread",
      "tags": [
        "chocolate chip",
        "protein",
        "banana bread"
      ],
      "methods": [
        "whey"
      ],
      "image": "chocolate-chip-protein-banana-bread.png",
      "ingredients": [
        "200g ripe bananas",
        "100g chocolate whey protein powder",
        "80g oat flour",
        "50g chocolate chips",
        "2 large eggs",
        "60g plain Greek yogurt",
        "30g honey",
        "1 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease a loaf pan."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "Mash bananas, then whisk in eggs, yogurt, and honey."
        },
        {
          "step": "Combine Dry Ingredients",
          "text": "In a separate bowl, mix protein powder, oat flour, and baking powder."
        },
        {
          "step": "Combine and Add Chips",
          "text": "Add dry ingredients to wet and stir until just combined. Fold in chocolate chips."
        },
        {
          "step": "Bake",
          "text": "Pour into pan and bake for 25-30 minutes."
        },
        {
          "step": "Cool",
          "text": "Cool before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "healthy-protein-banana-bread",
          "title": "Healthy Protein Banana Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "matcha-green-tea-protein-crepes",
          "title": "Matcha Green Tea Protein Crepes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "protein-powder-in-oatmeal",
          "title": "Protein Powder in Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 24,
      "slug": "apple-cinnamon-protein-bread",
      "title": "Apple Cinnamon Protein Bread",
      "description": "This warm and comforting apple cinnamon bread delivers a satisfying combination of soft, moist texture with hints of sweet, fragrant cinnamon and tender apple chunks in every bite. Packed with 21g of high-quality protein per serving, it makes for a nourishing choice to fuel your day or recover after a workout. The balanced macros provide a hearty dose of protein while keeping the calories around 200 per slice, making it an ideal option for those aiming to build muscle or maintain a lean physique. Its natural sweetness from fresh apples pairs perfectly with the aromatic cinnamon, creating a flavor profile that's both cozy and invigorating. Whether enjoyed as a quick breakfast, a post-exercise treat, or part of your meal prep, this bread is versatile and satisfying. For gluten-free options, use a gluten-free flour blend, and to make it vegan, swap in plant-based milk and egg replacers—it's just as delicious! For the best results, mix the batter until smooth and avoid overbaking to keep the bread moist and tender. Slice it warm and spread with a little nut butter or enjoy it plain for a wholesome, protein-packed snack anytime.",
      "protein": 21,
      "calories": 200,
      "carbs": 20,
      "fat": 7,
      "fiber": 4,
      "sugar": 10,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "20",
      "cookTime": "35",
      "totalTime": "55",
      "difficulty": "Easy",
      "category": "Quick Bread",
      "tags": [
        "apple",
        "cinnamon",
        "protein bread"
      ],
      "methods": [
        "whey"
      ],
      "image": "apple-cinnamon-protein-bread.png",
      "ingredients": [
        "150g grated apple",
        "120g vanilla whey protein powder",
        "100g oat flour",
        "2 large eggs",
        "60g unsweetened applesauce",
        "40g maple syrup",
        "1.5 tsp cinnamon",
        "1 tsp baking powder"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 350°F (175°C). Grease a loaf pan."
        },
        {
          "step": "Prepare Apple",
          "text": "Grate the apple and squeeze out excess moisture."
        },
        {
          "step": "Mix Wet Ingredients",
          "text": "Whisk together eggs, applesauce, and maple syrup."
        },
        {
          "step": "Combine Ingredients",
          "text": "Stir in the grated apple. In a separate bowl, combine protein powder, oat flour, cinnamon, and baking powder. Add dry to wet and mix."
        },
        {
          "step": "Bake",
          "text": "Pour into pan and bake for 30-35 minutes."
        },
        {
          "step": "Cool",
          "text": "Cool before slicing."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-bread-recipe",
          "title": "Simple Protein Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "savory-herb-protein-bread",
          "title": "Savory Herb Protein Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "cinnamon-swirl-protein-bread",
          "title": "Cinnamon Swirl Protein Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "gluten-free-buckwheat-protein-pancakes",
          "title": "Gluten-Free Buckwheat Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "pumpkin-protein-oatmeal",
          "title": "Pumpkin Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 25,
      "slug": "everything-protein-bagels",
      "title": "Everything Protein Bagels",
      "description": "Savory everything bagels packed with 22g of protein offer a delicious way to fuel your day with wholesome goodness. These bagels boast a satisfying chewy texture with a crispy, flavorful crust topped generously with the classic everything bagel seasoning—think crunchy sesame seeds, poppy seeds, garlic, onion, and a hint of salt—that delivers a burst of savory delight in every bite. Rich in protein and balanced with healthy carbs, they make for a perfect post-workout meal or a hearty breakfast that keeps you energized for hours. Their dense, yet tender crumb pairs beautifully with cream cheese, smoked salmon, or avocado, making them versatile for any craving. Whether you're meal prepping for the week or enjoying a quick, satisfying snack, these bagels are a great gluten-free option if you use a suitable alternative flour. For vegans, swapping out dairy ingredients or using plant-based binders keeps them plant-based and equally delicious. For best results, ensure your dough is well-kneaded and allow it to rise properly—patience pays off with a light, airy interior. These protein-packed bagels are a tasty and nutritious addition to any diet, satisfying your savory cravings while supporting your fitness goals.",
      "protein": 22,
      "calories": 190,
      "carbs": 16,
      "fat": 5,
      "fiber": 3,
      "sugar": 2,
      "servingSize": "1 bagel",
      "yield": "8 bagels",
      "prepTime": "15",
      "cookTime": "20",
      "totalTime": "35",
      "difficulty": "Medium",
      "category": "Bagel",
      "tags": [
        "everything bagel",
        "protein",
        "savory"
      ],
      "methods": [
        "greek yogurt"
      ],
      "image": "everything-protein-bagels.png",
      "ingredients": [
        "150g all-purpose flour",
        "120g plain non-fat Greek yogurt",
        "60g unflavored whey protein powder",
        "2 tsp baking powder",
        "1 tsp salt",
        "1 egg white, beaten",
        "2 tbsp everything bagel seasoning"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat oven to 375°F (190°C)."
        },
        {
          "step": "Make Dough",
          "text": "Mix flour, yogurt, protein powder, baking powder, and salt to form a dough."
        },
        {
          "step": "Knead and Shape",
          "text": "Knead briefly, then divide into 8 pieces and shape into bagels."
        },
        {
          "step": "Top and Bake",
          "text": "Place on a parchment-lined baking sheet, brush with egg white, and sprinkle with seasoning."
        },
        {
          "step": "Bake",
          "text": "Bake for 15-20 minutes until golden."
        },
        {
          "step": "Cool",
          "text": "Cool on a wire rack."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-pumpkin-bread",
          "title": "Healthy Protein Pumpkin Bread",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "red-velvet-protein-pancakes",
          "title": "Red Velvet Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "chocolate-protein-oatmeal",
          "title": "Chocolate Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 100,
      "slug": "gluten-free-almond-flour-protein-bread",
      "title": "Gluten-Free Almond Flour Protein Bread",
      "description": "This soft, fluffy gluten-free bread made with almond flour and protein powder is a nutritious and satisfying addition to any meal. Packed with approximately 18 grams of protein per serving, it provides a perfect balance of macros to fuel your day and support muscle recovery. The delicate crumb offers a tender bite with a subtly nutty flavor, making it incredibly versatile—ideal for hearty sandwiches, crispy toast, or simply enjoyed on its own with a smear of nut butter or jam. Its low-carb, gluten-free profile makes it suitable for various dietary needs, and vegan options can be easily achieved by swapping out the eggs for flaxseed or chia seed alternatives. For best results, ensure your ingredients are fresh and measure carefully to maintain that light, airy texture. This bread is perfect post-workout to replenish energy and aid muscle repair or as a nutritious prep option for busy weekdays. You can also customize it by adding herbs or seeds for extra flavor and crunch. Store it in an airtight container to keep it fresh and enjoy within a few days or freeze slices for convenient, healthy snacks anytime.",
      "protein": 18,
      "calories": 165,
      "carbs": 8,
      "fat": 11,
      "fiber": 3,
      "sugar": 2,
      "servingSize": "1 slice",
      "yield": "12 slices",
      "prepTime": "10",
      "cookTime": "45",
      "totalTime": "55",
      "difficulty": "Easy",
      "category": "Loaves",
      "tags": [
        "gluten-free",
        "almond-flour",
        "high-protein",
        "low-carb"
      ],
      "methods": [
        "whey"
      ],
      "image": "gluten-free-almond-flour-protein-bread.png",
      "ingredients": [
        "200g almond flour",
        "60g unflavored whey protein powder",
        "4 large eggs",
        "60ml olive oil",
        "1 tsp baking powder (gluten-free)",
        "1/2 tsp salt",
        "1 tbsp apple cider vinegar"
      ],
      "instructions": [
        {
          "step": "Preheat Oven",
          "text": "Preheat your oven to 175°C (350°F) and line a 9x5 inch loaf pan with parchment paper."
        },
        {
          "step": "Mix Dry Ingredients",
          "text": "In a large bowl, whisk together the almond flour, protein powder, baking powder, and salt."
        },
        {
          "step": "Add Wet Ingredients",
          "text": "Add the eggs, olive oil, and apple cider vinegar to the dry ingredients. Mix until a smooth batter forms."
        },
        {
          "step": "Pour and Bake",
          "text": "Pour the batter into the prepared loaf pan and smooth the top. Bake for 40-45 minutes until golden brown and a toothpick comes out clean."
        },
        {
          "step": "Cool and Slice",
          "text": "Let the bread cool in the pan for 10 minutes, then transfer to a wire rack. Slice and serve once completely cooled."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-cloud-bread",
          "title": "Fluffy Protein Cloud Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "german-chocolate-protein-pancakes",
          "title": "German Chocolate Protein Pancakes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "oatmeal-protein-bars",
          "title": "Oatmeal Protein Bars",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    },
    {
      "id": 101,
      "slug": "dairy-free-oat-protein-sandwich-loaf",
      "title": "Dairy-Free Oat Protein Sandwich Loaf",
      "description": "This hearty, dairy-free sandwich bread made with wholesome oat flour and plant-based protein is not only delicious but also a nutritious powerhouse, offering approximately 15 grams of protein per slice to fuel your day. Its soft, tender crumb and slightly nutty flavor create the perfect canvas for any filling, from fresh veggies and lean meats to savory spreads. The bread's moist texture holds up well to hearty ingredients, making every bite satisfying and fulfilling. Whether you're enjoying a post-workout meal or meal prepping for the week, this bread provides a balanced mix of complex carbs and plant-based protein to support your active lifestyle. It’s naturally gluten-free when using certified gluten-free oat flour, and vegan-friendly, making it suitable for various dietary needs. For best results, ensure your ingredients are fresh, and avoid overmixing to keep the bread light and airy. Toast slices for added crunch or use them straight from the loaf for a quick, nourishing snack. This versatile bread is perfect for anyone looking to boost their protein intake without sacrificing flavor or texture.",
      "protein": 15,
      "calories": 145,
      "carbs": 18,
      "fat": 5,
      "fiber": 3,
      "sugar": 3,
      "servingSize": "1 slice",
      "yield": "14 slices",
      "prepTime": "15",
      "cookTime": "50",
      "totalTime": "65",
      "difficulty": "Medium",
      "category": "Loaves",
      "tags": [
        "dairy-free",
        "vegan-option",
        "oat-flour",
        "sandwich-bread"
      ],
      "methods": [
        "vegan"
      ],
      "image": "dairy-free-oat-protein-sandwich-loaf.png",
      "ingredients": [
        "200g certified gluten-free oat flour",
        "60g vanilla plant-based protein powder",
        "240ml unsweetened oat milk",
        "60ml coconut oil, melted",
        "2 tbsp maple syrup",
        "1 packet (7g) instant yeast",
        "1 tsp salt",
        "2 flax eggs (2 tbsp ground flaxseed + 6 tbsp water)"
      ],
      "instructions": [
        {
          "step": "Prepare Flax Eggs",
          "text": "Mix ground flaxseed with water and let sit for 5 minutes until gel-like."
        },
        {
          "step": "Activate Yeast",
          "text": "Warm the oat milk to 110°F (43°C), add maple syrup and yeast. Let sit for 5 minutes until foamy."
        },
        {
          "step": "Mix Dough",
          "text": "Combine oat flour, protein powder, and salt. Add the yeast mixture, flax eggs, and melted coconut oil. Mix until a sticky dough forms."
        },
        {
          "step": "Rise",
          "text": "Cover the dough and let rise in a warm place for 45 minutes until doubled in size."
        },
        {
          "step": "Bake",
          "text": "Transfer to a greased loaf pan, let rise another 20 minutes. Bake at 175°C (350°F) for 45-50 minutes until golden and hollow-sounding when tapped."
        }
      ],
      "related_recipes": [
        {
          "slug": "protein-banana-bread",
          "title": "Classic Protein Banana Bread",
          "domain": "protein-bread.com"
        },
        {
          "slug": "high-protein-banana-bread",
          "title": "High Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        },
        {
          "slug": "protein-banana-bread-recipe",
          "title": "Simple Protein Banana Bread Recipe",
          "domain": "protein-bread.com"
        }
      ],
      "empire_links": [
        {
          "slug": "savory-spinach-and-feta-protein-crepes",
          "title": "Savory Spinach and Feta Protein Crepes",
          "domain": "proteinpancakes.co",
          "category": "protein pancakes"
        },
        {
          "slug": "maple-pecan-protein-oatmeal",
          "title": "Maple Pecan Protein Oatmeal",
          "domain": "proteinoatmeal.co",
          "category": "protein oatmeal"
        }
      ]
    }
  ]
}